{"title": "Hierarchical Saliency Detection", "abstract": "Complex structures commonly exist in natural images. When an image contains small-scale high-contrast patterns either in the background or foreground, saliency detection could be adversely affected, resulting erroneous and non-uniform saliency assignment. The issue forms a fundamental challenge for prior methods. We tackle it from a scale point of view and propose a multi-layer approach to analyze saliency cues. Different from varying patch sizes or downsizing images, we measure region-based scales. The final saliency values are inferred optimally combining all the saliency cues in different scales using hierarchical inference. Through our inference model, single-scale information is selected to obtain a saliency map. Our method improves detection quality on many images that cannot be handled well traditionally. We also construct an extended Complex Scene Saliency Dataset (ECSSD) to include complex but general natural images.", "authors": ["Jianping Shi", " Qiong Yan", " Li Xu", " Jiaya Jia"], "pdf_url": "https://arxiv.org/abs/1408.5418", "list_table_and_caption": [{"table": "<table><thead><tr><th></th><th>AC [1]</th><th>CA [14]</th><th>FT [2]</th><th>GB [16]</th><th>HC [9]</th><th>IT [20]</th><th>LC [48]</th><th>LR [38]</th><th>SR [18]</th><th>RC [9]</th><th>RCC [9]</th><th>HS [46]</th><th>CHS</th></tr></thead><tbody><tr><th>ECSSD</th><td>0.2647</td><td>0.3100</td><td>0.2698</td><td>0.2821</td><td>0.3258</td><td>0.2900</td><td>0.2940</td><td>0.2669</td><td>0.2636</td><td>0.3005</td><td>0.1865</td><td>0.2244</td><td>0.2265</td></tr><tr><th>MSRA-1000</th><td>0.2102</td><td>0.2332</td><td>0.2053</td><td>0.2189</td><td>0.1774</td><td>0.1953</td><td>0.2187</td><td>0.1854</td><td>0.2149</td><td>0.2358</td><td>0.1062</td><td>0.1155</td><td>0.0961</td></tr><tr><th>MSRA-5000</th><td>0.2280</td><td>0.2503</td><td>0.2298</td><td>0.2433</td><td>0.2391</td><td>0.2475</td><td>0.2447</td><td>0.2152</td><td>0.2251</td><td>0.2638</td><td>0.1399</td><td>0.1528</td><td>0.1499</td></tr></tbody></table>", "caption": "TABLE I: Quantitative comparison for MAE on ECSSD, MSRA-1000, and MSRA-5000 datasets.", "list_citation_info": ["[20] L. Itti, C. Koch, and E. Niebur. A model of saliency-based visual attention for rapid scene analysis. TPAMI, 20(11):1254–1259, 1998.", "[1] R. Achanta, F. J. Estrada, P. Wils, and S. Süsstrunk. Salient region detection and segmentation. In ICVS, pages 66–75, 2008.", "[18] X. Hou and L. Zhang. Saliency detection: A spectral residual approach. In CVPR, 2007.", "[38] X. Shen and Y. Wu. A unified approach to salient object detection via low rank matrix recovery. In CVPR, 2012.", "[16] J. Harel, C. Koch, and P. Perona. Graph-based visual saliency. In NIPS, pages 545–552, 2006.", "[48] Y. Zhai and M. Shah. Visual attention detection in video sequences using spatiotemporal cues. In ACM Multimedia, pages 815–824, 2006.", "[14] S. Goferman, L. Zelnik-Manor, and A. Tal. Context-aware saliency detection. In CVPR, pages 2376–2383, 2010.", "[9] M.-M. Cheng, G.-X. Zhang, N. J. Mitra, X. Huang, and S.-M. Hu. Global contrast based salient region detection. In CVPR, pages 409–416, 2011.", "[2] R. Achanta, S. S. Hemami, F. J. Estrada, and S. Süsstrunk. Frequency-tuned salient region detection. In CVPR, pages 1597–1604, 2009.", "[46] Q. Yan, L. Xu, J. Shi, and J. Jia. Hierarchical saliency detection. In CVPR, 2013."]}]}