{"title": "Road Damage Detection Using Deep Neural Networks with Images Captured Through a Smartphone", "abstract": "Research on damage detection of road surfaces using image processing techniques has been actively conducted, achieving considerably high detection accuracies. Many studies only focus on the detection of the presence or absence of damage. However, in a real-world scenario, when the road managers from a governing body need to repair such damage, they need to clearly understand the type of damage in order to take effective action. In addition, in many of these previous studies, the researchers acquire their own data using different methods. Hence, there is no uniform road damage dataset available openly, leading to the absence of a benchmark for road damage detection. This study makes three contributions to address these issues. First, to the best of our knowledge, for the first time, a large-scale road damage dataset is prepared. This dataset is composed of 9,053 road damage images captured with a smartphone installed on a car, with 15,435 instances of road surface damage included in these road images. In order to generate this dataset, we cooperated with 7 municipalities in Japan and acquired road images for more than 40 hours. These images were captured in a wide variety of weather and illuminance conditions. In each image, we annotated the bounding box representing the location and type of damage. Next, we used a state-of-the-art object detection method using convolutional neural networks to train the damage detection model with our dataset, and compared the accuracy and runtime speed on both, using a GPU server and a smartphone. Finally, we demonstrate that the type of damage can be classified into eight types with high accuracy by applying the proposed object detection method. The road damage dataset, our experimental results, and the developed smartphone application used in this study are publicly available (https://github.com/sekilab/RoadDamageDetector/).", "authors": ["Hiroya Maeda", " Yoshihide Sekimoto", " Toshikazu Seto", " Takehiro Kashiyama", " Hiroshi Omata"], "pdf_url": "https://arxiv.org/abs/1801.09454", "list_table_and_caption": [{"table": "<table><thead><tr><th colspan=\"3\">Damage Type</th><th>Detail</th><th>Class Name</th></tr></thead><tbody><tr><td></td><td></td><td>Longitudinal</td><td>Wheel mark part</td><td>D00</td></tr><tr><td>Crack</td><td>Linear Crack</td><td></td><td>Construction joint part</td><td>D01</td></tr><tr><td></td><td></td><td>Lateral</td><td>Equal interval</td><td>D10</td></tr><tr><td></td><td></td><td></td><td>Construction joint part</td><td>D11</td></tr><tr><td></td><td colspan=\"2\">Alligator Crack</td><td>Partial pavement, overall pavement</td><td>D20</td></tr><tr><td></td><td></td><td></td><td>Rutting, bump, pothole, separation</td><td>D40</td></tr><tr><td colspan=\"3\">Other Corruption</td><td>White line blur</td><td>D43</td></tr><tr><td></td><td></td><td></td><td>Cross walk blur</td><td>D44</td></tr></tbody></table><p>Source: Road Maintenance and Repair Guidebook 2013 JRA, (2013) in Japan.</p><p>Note: In reality, rutting, bump, pothole, and separation are different types of road damage, but it was difficult to distinguish these four types using images. Therefore, they were classified as one class, viz., D40.</p>", "caption": "Table 1: Road damage types in our dataset and their definitions.", "list_citation_info": ["JRA, (2013) JRA (2013). Maintenance and repair guide book of the pavement 2013. Japan Road Association, 1st. edition."]}]}