{"title": "Emerging trends in federated learning: From model fusion to federated x learning", "abstract": "Federated learning is a new learning paradigm that decouples data collection and model training via multi-party computation and model aggregation. As a flexible learning setting, federated learning has the potential to integrate with other learning frameworks. We conduct a focused survey of federated learning in conjunction with other learning algorithms. Specifically, we explore various learning algorithms to improve the vanilla federated averaging algorithm and review model fusion methods such as adaptive aggregation, regularization, clustered methods, and Bayesian methods. Following the emerging trends, we also discuss federated learning in the intersection with other learning paradigms, termed as federated x learning, where x includes multitask learning, meta-learning, transfer learning, unsupervised learning, and reinforcement learning. This survey reviews the state of the art, challenges, and future directions.", "authors": ["Shaoxiong Ji", " Teemu Saravirta", " Shirui Pan", " Guodong Long", " Anwar Walid"], "pdf_url": "https://arxiv.org/abs/2102.12920", "list_table_and_caption": [{"table": "<table><tbody><tr><td><p>Main area</p></td><td><p>Subarea</p></td><td>Study</td></tr><tr><td rowspan=\"8\">Federated Model Fusion</td><td rowspan=\"2\">Adaptive/Attentive Aggregation</td><td>IDA [6], ASTW [7], FedAtt [8]</td></tr><tr><td>FedAttOpt [13], FedMed [14], FedAMP [15].</td></tr><tr><td rowspan=\"2\">Regularization Methods</td><td>FedAwS [16], FedProx [17]</td></tr><tr><td>Mime [18]</td></tr><tr><td rowspan=\"2\">Clustered Methods</td><td>FL+HC [10], IFCA [19]</td></tr><tr><td>FeSEM [20], FedFast [21]</td></tr><tr><td>Bayesian Methods</td><td>FedMA [22], PFNM [11]</td></tr><tr><td>Fairness</td><td>q-FFL [12], AFL [23]</td></tr><tr><td rowspan=\"16\">Learning Paradigms</td><td>Transfer Learning</td><td>FTL [24], \\ast UFDA [25], FedSteg [26]</td></tr><tr><td rowspan=\"2\">Multitask and Meta Learning</td><td>Mocha [27], Kernelized FMTL [28]</td></tr><tr><td>CFL [29], FedMeta [30], Per-FedAvg [31]</td></tr><tr><td rowspan=\"2\">Knowledge Distillation</td><td>FedMD [32], FedGKT [33], FedDF [34]</td></tr><tr><td rowspan=\"2\">PATE [35]</td></tr><tr><td rowspan=\"3\">Semi-Supervised Learning</td></tr><tr><td>FedMatch [36]</td></tr><tr><td rowspan=\"2\">PATE-G [35]</td></tr><tr><td rowspan=\"4\">Generative Adversarial Learning</td></tr><tr><td>Sync. Strategies [37], FedGAN [38]</td></tr><tr><td>DP-FedAvg-GAN [39]</td></tr><tr><td rowspan=\"2\">\\ast UFDA [25]</td></tr><tr><td rowspan=\"2\">Unsupervised Learning</td></tr><tr><td>FURL [40], FPCA [41], FedCA [42]</td></tr><tr><td rowspan=\"2\">Reinforcement Learning</td><td>FedRL [43], DRL-based Aggregator [44]</td></tr><tr><td>Favor [45], FRD and MixFRD [46]</td></tr></tbody></table>", "caption": "Table 1: Federated learning with other learning algorithms: categorization, conjunctions and representative methods.", "list_citation_info": ["[30] X. Yao, T. Huang, R.-X. Zhang, R. Li, L. Sun, Federated learning with unbiased gradient aggregation and controllable meta updating, in: Advances in Neural Information Processing Systems Workshop, 2019.", "[34] T. Lin, L. Kong, S. U. Stich, M. Jaggi, Ensemble distillation for robust model fusion in federated learning, in: Advances in Neural Information Processing Systems, 2020.", "[14] X. Wu, Z. Liang, J. Wang, FedMed: A federated learning framework for language modeling, Sensors 20 (14) (2020) 4048.", "[37] C. Fan, P. Liu, Federated generative adversarial learning, arXiv preprint arXiv:2005.03793 (2020).", "[10] C. Briggs, Z. Fan, P. Andras, Federated learning with hierarchical clustering of local updates to improve training on non-iid data, in: International Joint Conference on Neural Network, 2020.", "[29] F. Sattler, K.-R. Müller, W. Samek, Clustered federated learning: Model-agnostic distributed multitask optimization under privacy constraints, IEEE Transactions on Neural Networks and Learning Systems (2020).", "[21] K. Muhammad, Q. Wang, D. O’Reilly-Morgan, E. Tragos, B. Smyth, N. Hurley, J. Geraci, A. Lawlor, FedFast: Going beyond average for faster training of federated recommender systems, in: SIGKDD, 2020, pp. 1234–1242.", "[8] S. Ji, S. Pan, G. Long, X. Li, J. Jiang, Z. Huang, Learning private neural language modeling with attentive aggregation, in: International Joint Conference on Neural Network, 2019.", "[22] H. Wang, M. Yurochkin, Y. Sun, D. Papailiopoulos, Y. Khazaeni, Federated learning with matched averaging, in: International Conference on Learning Representations, 2020.", "[20] M. Xie, G. Long, T. Shen, T. Zhou, X. Wang, J. Jiang, Multi-center federated learning, arXiv preprint arXiv:2005.01026 (2020).", "[42] F. Zhang, K. Kuang, Z. You, T. Shen, J. Xiao, Y. Zhang, C. Wu, Y. Zhuang, X. Li, Federated unsupervised representation learning, arXiv preprint arXiv:2010.08982 (2020).", "[13] J. Jiang, S. Ji, G. Long, Decentralized knowledge acquisition for mobile internet applications, World Wide Web (2020).", "[18] S. P. Karimireddy, M. Jaggi, S. Kale, M. Mohri, S. J. Reddi, S. U. Stich, A. T. Suresh, Mime: Mimicking centralized stochastic algorithms in federated learning, arXiv preprint arXiv:2008.03606 (2020).", "[25] X. Peng, Z. Huang, Y. Zhu, K. Saenko, Federated adversarial domain adaptation, in: International Conference on Learning Representations, 2020.", "[26] H. Yang, H. He, W. Zhang, X. Cao, FedSteg: A Federated Transfer Learning Framework for Secure Image Steganalysis, IEEE Transactions on Network Science and Engineering (2020).", "[7] Y. Chen, X. Sun, Y. Jin, Communication-efficient federated deep learning with layerwise asynchronous model update and temporally weighted aggregation, IEEE Transactions on Neural Networks and Learning Systems (2020).", "[43] H. H. Zhuo, W. Feng, Q. Xu, Q. Yang, Y. Lin, Federated deep reinforcement learning, arXiv preprint arXiv:1901.08277 (2019).", "[31] A. Fallah, A. Mokhtari, A. Ozdaglar, Personalized federated learning with theoretical guarantees: A model-agnostic meta-learning approach, in: Advances in Neural Information Processing Systems, 2020.", "[15] Y. Huang, L. Chu, Z. Zhou, L. Wang, J. Liu, J. Pei, Y. Zhang, Personalized cross-silo federated learning on non-iid data, in: AAAI Conference on Artificial Intelligence, 2021.", "[38] M. Rasouli, T. Sun, R. Rajagopal, FedGAN: Federated generative adversarial networks for distributed data, arXiv preprint arXiv:2006.07228 (2020).", "[40] B. v. Bram, A. Saeed, T. Ozcelebi, Towards federated unsupervised representation learning, in: ACM EdgeSys, 2020, pp. 31–36.", "[16] F. X. Yu, A. S. Rawat, A. K. Menon, S. Kumar, Federated learning with only positive labels, in: International Conference on Machine Learning, 2020.", "[45] H. Wang, Z. Kaplan, D. Niu, B. Li, Optimizing Federated Learning on Non-IID Data with Reinforcement Learning, in: IEEE International Conference on Computer Communications, IEEE, 2020, pp. 1698–1707.", "[6] Y. Yeganeh, A. Farshad, N. Navab, S. Albarqouni, Inverse distance aggregation for federated learning with non-iid data, in: DCL Workshop at MICCAI, 2020, pp. 150–159.", "[11] M. Yurochkin, M. Agarwal, S. Ghosh, K. Greenewald, N. Hoang, Y. Khazaeni, Bayesian nonparametric federated learning of neural networks, in: International Conference on Machine Learning, 2019, pp. 7252–7261.", "[24] Y. Liu, Y. Kang, C. Xing, T. Chen, Q. Yang, A secure federated transfer learning framework, IEEE Intelligent Systems 35 (2020) 70–82.", "[28] S. Caldas, V. Smith, A. Talwalkar, Federated kernelized multi-task learning, in: Conference on Machine Learning and Systems, 2018.", "[35] N. Papernot, M. Abadi, Ú. Erlingsson, I. Goodfellow, K. Talwar, Semi-supervised knowledge transfer for deep learning from private training data, in: International Conference on Learning Representations, 2017.", "[36] W. Jeong, J. Yoon, E. Yang, S. J. Hwang, Federated semi-supervised learning with inter-client consistency, in: International Conference on Machine Learning Workshop, 2020.", "[44] Y. Zhan, J. Zhang, An incentive mechanism design for efficient edge learning by deep reinforcement learning approach, in: IEEE International Conference on Computer Communications, IEEE, 2020, pp. 2489–2498.", "[33] C. He, M. Annavaram, S. Avestimehr, Group knowledge transfer: Federated learning of large cnns at the edge, Advances in Neural Information Processing Systems (2020).", "[32] D. Li, J. Wang, FedMD: Heterogenous federated learning via model distillation, in: Advances in Neural Information Processing Systems Workshop, 2019.", "[17] T. Li, A. K. Sahu, M. Zaheer, M. Sanjabi, A. Talwalkar, V. Smith, Federated optimization in heterogeneous networks, in: Conference on Machine Learning and Systems, 2020.", "[39] S. Augenstein, H. B. McMahan, D. Ramage, S. Ramaswamy, P. Kairouz, M. Chen, R. Mathews, B. A. y Arcas, Generative models for effective ml on private, decentralized datasets, in: International Conference on Learning Representations, 2020.", "[41] A. Grammenos, R. Mendoza Smith, J. Crowcroft, C. Mascolo, Federated principal component analysis, in: Advances in Neural Information Processing Systems, 2020.", "[23] M. Mohri, G. Sivek, A. T. Suresh, Agnostic federated learning, in: International Conference on Machine Learning, 2019.", "[19] A. Ghosh, J. Chung, D. Yin, K. Ramchandran, An efficient framework for clustered federated learning, in: Advances in Neural Information Processing Systems, 2020.", "[12] T. Li, M. Sanjabi, A. Beirami, V. Smith, Fair resource allocation in federated learning, in: International Conference on Learning Representations, 2020.", "[46] H. Cha, J. Park, H. Kim, M. Bennis, S.-L. Kim, Proxy experience replay: Federated distillation for distributed reinforcement learning, IEEE Intelligent Systems (2020).", "[27] V. Smith, C.-K. Chiang, M. Sanjabi, A. S. Talwalkar, Federated multi-task learning, in: Advances in Neural Information Processing Systems, 2017, pp. 4427–4437."]}, {"table": "<table><thead><tr><th>Publication</th><th>Scope</th></tr></thead><tbody><tr><td>This survey</td><td>Learning algorithms</td></tr><tr><td>Jin et al. [54]</td><td>Semi-supervised learning</td></tr><tr><td>Xu et al. [50]</td><td>Healthcare informatics</td></tr><tr><td>Lo et al. [55]</td><td>Software engineering</td></tr><tr><td>Lim et al. [52]</td><td>Mobile edge networks</td></tr><tr><td>Lyu et al. [51]</td><td>Threats</td></tr><tr><td>Niknam et al. [53]</td><td>Wireless communication</td></tr><tr><td>Yang et al. [47]</td><td>General</td></tr><tr><td>Li et al. [48]</td><td>General</td></tr><tr><td>Kairouz et al. [49]</td><td>General</td></tr><tr><td>Li et al. [9]</td><td>General</td></tr></tbody></table>", "caption": "Table 2: Comparison of related survey articles about federated learning", "list_citation_info": ["[55] S. K. Lo, Q. Lu, C. Wang, H. Paik, L. Zhu, A systematic literature review on federated machine learning: From a software engineering perspective, arXiv preprint arXiv:2007.11354 (2020).", "[52] W. Y. B. Lim, N. C. Luong, D. T. Hoang, Y. Jiao, Y.-C. Liang, Q. Yang, D. Niyato, C. Miao, Federated learning in mobile edge networks: A comprehensive survey, IEEE Communications Surveys & Tutorials (2020).", "[50] J. Xu, F. Wang, Federated learning for healthcare informatics, arXiv preprint arXiv:1911.06270 (2019).", "[9] T. Li, A. K. Sahu, A. Talwalkar, V. Smith, Federated learning: Challenges, methods, and future directions, IEEE Signal Processing Magazine 37 (3) (2020) 50–60.", "[51] L. Lyu, H. Yu, Q. Yang, Threats to federated learning: A survey, arXiv preprint arXiv:2003.02133 (2020).", "[48] Q. Li, Z. Wen, B. He, Federated learning systems: Vision, hype and reality for data privacy and protection, arXiv preprint arXiv:1907.09693 (2019).", "[49] P. Kairouz, H. B. McMahan, B. Avent, A. Bellet, M. Bennis, A. N. Bhagoji, K. Bonawitz, Z. Charles, G. Cormode, R. Cummings, et al., Advances and open problems in federated learning, arXiv preprint arXiv:1912.04977 (2019).", "[54] Y. Jin, X. Wei, Y. Liu, Q. Yang, A survey towards federated semi-supervised learning, arXiv preprint arXiv:2002.11545 (2020).", "[53] S. Niknam, H. S. Dhillon, J. H. Reed, Federated learning for wireless communications: Motivation, opportunities, and challenges, IEEE Communications Magazine 58 (6) (2020) 46–51.", "[47] Q. Yang, Y. Liu, T. Chen, Y. Tong, Federated machine learning: Concept and applications, ACM Transactions on Intelligent Systems and Technology 10 (2) (2019) 12."]}]}