{"title": "Nucls: A scalable crowdsourcing, deep learning approach and dataset for nucleus classification, localization and segmentation", "abstract": "High-resolution mapping of cells and tissue structures provides a foundation for developing interpretable machine-learning models for computational pathology. Deep learning algorithms can provide accurate mappings given large numbers of labeled instances for training and validation. Generating adequate volume of quality labels has emerged as a critical barrier in computational pathology given the time and effort required from pathologists. In this paper we describe an approach for engaging crowds of medical students and pathologists that was used to produce a dataset of over 220,000 annotations of cell nuclei in breast cancers. We show how suggested annotations generated by a weak algorithm can improve the accuracy of annotations generated by non-experts and can yield useful data for training segmentation algorithms without laborious manual tracing. We systematically examine interrater agreement and describe modifications to the MaskRCNN model to improve cell mapping. We also describe a technique we call Decision Tree Approximation of Learned Embeddings (DTALE) that leverages nucleus segmentations and morphologic features to improve the transparency of nucleus classification models. The annotation data produced in this study are freely available for algorithm development and benchmarking at: https://sites.google.com/view/nucls.", "authors": ["Mohamed Amgad", " Lamees A. Atteya", " Hagar Hussein", " Kareem Hosny Mohammed", " Ehab Hafiz", " Maha A. T. Elsebaie", " Ahmed M. Alhusseiny", " Mohamed Atef AlMoslemany", " Abdelmagid M. Elmatboly", " Philip A. Pappalardo", " Rokia Adel Sakr", " Pooya Mobadersany", " Ahmad Rachid", " Anas M. Saad", " Ahmad M. Alkashash", " Inas A. Ruhban", " Anas Alrefai", " Nada M. Elgazar", " Ali Abdulkarim", " Abo-Alela Farag", " Amira Etman", " Ahmed G. Elsaeed", " Yahya Alagha", " Yomna A. Amer", " Ahmed M. Raslan ", " et al. (12 additional authors not shown)"], "pdf_url": "https://arxiv.org/abs/2102.09099", "list_table_and_caption": [[], []]}