{"title": "Deepfake Video Detection Using Convolutional Vision Transformer", "abstract": "The rapid advancement of deep learning models that can generate and synthesis hyper-realistic videos known as Deepfakes and their ease of access to the general public have raised concern from all concerned bodies to their possible malicious intent use. Deep learning techniques can now generate faces, swap faces between two subjects in a video, alter facial expressions, change gender, and alter facial features, to list a few. These powerful video manipulation methods have potential use in many fields. However, they also pose a looming threat to everyone if used for harmful purposes such as identity theft, phishing, and scam. In this work, we propose a Convolutional Vision Transformer for the detection of Deepfakes. The Convolutional Vision Transformer has two components: Convolutional Neural Network (CNN) and Vision Transformer (ViT). The CNN extracts learnable features while the ViT takes in the learned features as input and categorizes them using an attention mechanism. We trained our model on the DeepFake Detection Challenge Dataset (DFDC) and have achieved 91.5 percent accuracy, an AUC value of 0.91, and a loss value of 0.32. Our contribution is that we have added a CNN module to the ViT architecture and have achieved a competitive result on the DFDC dataset.", "authors": ["Deressa Wodajo", " Solomon Atnafu"], "pdf_url": "https://arxiv.org/abs/2102.11126", "list_table_and_caption": [{"table": "<table><thead><tr><th>Method</th><th>Validation</th><th>Test</th></tr></thead><tbody><tr><th>CNN and RNN-GRU [38] [47]</th><td>92.61%</td><td>91.88%</td></tr><tr><th>CViT</th><td>87.25</td><td>91.5</td></tr></tbody></table>", "caption": "Table 2: Accuracy of our model and other Deepfake detection modelson the DFDC dataset", "list_citation_info": ["[38] Daniel Mas Montserrat, Hanxiang Hao, S. K. Yarlagadda, Sriram Baireddy, Ruiting Shao, Janos Horvath, Emily Bartusiak, Justin Yang, David Guera, Fengqing Zhu, and Edward J. Delp. Deepfakes Detection with Automatic Face Weighting. In 2020 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW), pages 2851–2859, 2020."]}]}