{"title": "Neighborhood Contrastive Learning for Novel Class Discovery", "abstract": "In this paper, we address Novel Class Discovery (NCD), the task of unveiling new classes in a set of unlabeled samples given a labeled dataset with known classes. We exploit the peculiarities of NCD to build a new framework, named Neighborhood Contrastive Learning (NCL), to learn discriminative representations that are important to clustering performance. Our contribution is twofold. First, we find that a feature extractor trained on the labeled set generates representations in which a generic query sample and its neighbors are likely to share the same class. We exploit this observation to retrieve and aggregate pseudo-positive pairs with contrastive learning, thus encouraging the model to learn more discriminative representations. Second, we notice that most of the instances are easily discriminated by the network, contributing less to the contrastive loss. To overcome this issue, we propose to generate hard negatives by mixing labeled and unlabeled samples in the feature space. We experimentally demonstrate that these two ingredients significantly contribute to clustering performance and lead our model to outperform state-of-the-art methods by a large margin (e.g., clustering accuracy +13% on CIFAR-100 and +8% on ImageNet).", "authors": ["Zhun Zhong", " Enrico Fini", " Subhankar Roy", " Zhiming Luo", " Elisa Ricci", " Nicu Sebe"], "pdf_url": "https://arxiv.org/abs/2106.10731", "list_table_and_caption": [{"table": "<table><tbody><tr><td>Method</td><td>Venue</td><td><p>CIFAR-10</p></td><td><p>CIFAR-100</p></td><td>ImageNet</td></tr><tr><td colspan=\"5\">Methods without self-supervised learning</td></tr><tr><td>k-means [23]</td><td>Classic</td><td><p>65.5\\pm0.0%</p></td><td><p>56.6\\pm1.6%</p></td><td>71.9%</td></tr><tr><td>KCL [16]</td><td>ICLR’18</td><td><p>66.5\\pm3.9%</p></td><td><p>14.3\\pm1.3%</p></td><td>73.8%</td></tr><tr><td>MCL [17]</td><td>ICLR’19</td><td><p>64.2\\pm0.1%</p></td><td><p>21.3\\pm3.4%</p></td><td>74.4%</td></tr><tr><td>DTC [13]</td><td>ICCV’19</td><td><p>87.5\\pm0.3%</p></td><td><p>56.7\\pm1.2%</p></td><td>78.3%</td></tr><tr><td colspan=\"5\">Methods with self-supervised learning</td></tr><tr><td>k-means [23]{}^{*}</td><td>Classic</td><td><p>72.5\\pm0.0%</p></td><td><p>56.3\\pm1.7%</p></td><td>71.9%</td></tr><tr><td>KCL [16]{}^{*}</td><td>ICLR’18</td><td><p>72.3\\pm0.2%</p></td><td><p>42.1\\pm1.8%</p></td><td>73.8%</td></tr><tr><td>MCL [17]{}^{*}</td><td>ICLR’19</td><td><p>70.9\\pm0.1%</p></td><td><p>21.5\\pm2.3%</p></td><td>74.4%</td></tr><tr><td>DTC [13]{}^{*}</td><td>ICCV’19</td><td><p>88.7\\pm0.3%</p></td><td><p>67.3\\pm1.2%</p></td><td>78.3%</td></tr><tr><td>RS [12]{}^{*}</td><td>ICLR’20</td><td><p>90.4\\pm0.5%</p></td><td><p>73.2\\pm2.1%</p></td><td>82.5%</td></tr><tr><td>Ours{}^{*} w/o HNG</td><td>CVPR21</td><td>93.4\\pm0.2%</td><td>82.3\\pm2.6%</td><td>89.5%</td></tr><tr><td>Ours{}^{*}</td><td>CVPR21</td><td>93.4\\pm0.1%</td><td>86.6\\pm0.4%</td><td>90.7%</td></tr></tbody></table>", "caption": "Table 4: Comparison with state-of-the-art methods on CIFAR-10, CIFAR-100 and ImageNet for novel class discovery. Clustering accuracy is reported on the unlabelled set. “*” indicates methods that initialize models with self-supervised learning, except when evaluated on ImageNet. Ours: our method with both neighborhood contrastive learning and hard negative generation, Ours w/o HNG: our method without hard negative generation.", "list_citation_info": ["[16] Yen-Chang Hsu, Zhaoyang Lv, and Zsolt Kira. Learning to cluster in order to transfer across domains and tasks. In Proc. ICLR, 2018.", "[13] Kai Han, Andrea Vedaldi, and Andrew Zisserman. Learning to discover novel visual categories via deep transfer clustering. In Proc. ICCV, 2019.", "[17] Yen-Chang Hsu, Zhaoyang Lv, Joel Schlosser, Phillip Odom, and Zsolt Kira. Multi-class classification without multi-class labels. In Proc. ICLR, 2019.", "[23] James MacQueen et al. Some methods for classification and analysis of multivariate observations. In Proc. BSMSP, 1967.", "[12] Kai Han, Sylvestre-Alvise Rebuffi, Sebastien Ehrhardt, Andrea Vedaldi, and Andrew Zisserman. Automatically discovering and learning new visual categories with ranking statistics. In Proc. ICLR, 2020."]}]}