{"title": "A novel graph-theoretic deep representation learning method for multi-label remote sensing image retrieval", "abstract": "This paper presents a novel graph-theoretic deep representation learning method in the framework of multi-label remote sensing (RS) image retrieval problems. The proposed method aims to extract and exploit multi-label co-occurrence relationships associated to each RS image in the archive. To this end, each training image is initially represented with a graph structure that provides region-based image representation combining both local information and the related spatial organization. Unlike the other graph-based methods, the proposed method contains a novel learning strategy to train a deep neural network for automatically predicting a graph structure of each RS image in the archive. This strategy employs a region representation learning loss function to characterize the image content based on its multi-label co-occurrence relationship. Experimental results show the effectiveness of the proposed method for retrieval problems in RS compared to state-of-the-art deep representation learning methods. The code of the proposed method is publicly available at https://git.tu-berlin.de/rsim/GT-DRL-CBIR .", "authors": ["Gencer Sumbul", " Begüm Demir"], "pdf_url": "https://arxiv.org/abs/2106.00506", "list_table_and_caption": [{"table": "<table><tr><td rowspan=\"2\"> Method</td><td colspan=\"2\">Benchmark Archive</td></tr><tr><td><p>DLRSD</p></td><td><p>BigEarthNet-S2</p></td></tr><tr><td> <p>SNN (random) [11]</p></td><td><p>66.5%</p></td><td><p>83.9%</p></td></tr><tr><td> <p>SNN (batch-all) [11]</p></td><td><p>68.0%</p></td><td><p>88.6%</p></td></tr><tr><td> <p>SNN (hard) [11]</p></td><td><p>70.7%</p></td><td><p>88.3%</p></td></tr><tr><td> <p>SGCN [5]</p></td><td><p>70.1%</p></td><td><p>87.8%</p></td></tr><tr><td> <p>Proposed Method</p></td><td>84.3%</td><td>92.1%</td></tr></table>", "caption": "Table 1: Mean average precision (mAP) obtained for the DLRSD and BigEarthNet-S2 archives.", "list_citation_info": ["[11] Florian S., Dmitry K., and James P., “Facenet: A unified embedding for face recognition and clustering,” in IEEE Conf. Comput. Vis. Pattern Recog., 2015, pp. 815–823.", "[5] U. Chaudhuri, B. Banerjee, and A. Bhattacharya, “Siamese graph convolutional network for content based remote sensing image retrieval,” Comput. Vis. Image Understand., vol. 184, pp. 22–30, 2019."]}]}