{"title": "Multiple object tracking with mixture density networks for trajectory estimation", "abstract": "Multiple object tracking faces several challenges that may be alleviated with trajectory information. Knowing the posterior locations of an object helps disambiguating and solving situations such as occlusions, re-identification, and identity switching. In this work, we show that trajectory estimation can become a key factor for tracking, and present TrajE, a trajectory estimator based on recurrent mixture density networks, as a generic module that can be added to existing object trackers. To provide several trajectory hypotheses, our method uses beam search. Also, relying on the same estimated trajectory, we propose to reconstruct a track after an occlusion occurs. We integrate TrajE into two state of the art tracking algorithms, CenterTrack [63] and Tracktor [3]. Their respective performances in the MOTChallenge 2017 test set are boosted 6.3 and 0.3 points in MOTA score, and 1.8 and 3.1 in IDF1, setting a new state of the art for the CenterTrack+TrajE configuration", "authors": ["Andreu Girbau", " Xavier Giró-i-Nieto", " Ignasi Rius", " Ferran Marqués"], "pdf_url": "https://arxiv.org/abs/2106.10950", "list_table_and_caption": [{"table": "<table><tbody><tr><td colspan=\"7\">MOT17 [35]</td></tr><tr><td>Method</td><td>MOTA \\uparrow</td><td>IDF1 \\uparrow</td><td>MT % \\uparrow</td><td>ML % \\downarrow</td><td>FP \\downarrow</td><td>FN \\downarrow</td></tr><tr><td colspan=\"7\">Online, TrajE without occlusion reconstruction</td></tr><tr><td>CenterTrack+TrajE</td><td>67.4(+5.9)</td><td>61.2(+1.6)</td><td>34.8</td><td>24.9</td><td>18652</td><td>161347</td></tr><tr><td>CenterTrack [63]</td><td>61.5</td><td>59.6</td><td>26.4</td><td>31.9</td><td>14076</td><td>200672</td></tr><tr><td>GSM [28]</td><td>56.4</td><td>57.8</td><td>22.2</td><td>34.5</td><td>14379</td><td>230174</td></tr><tr><td>Tracktor(v2)+TrajE</td><td>56.3(+0.0)</td><td>57.8(+2.7)</td><td>21.4</td><td>35.8</td><td>10068</td><td>233885</td></tr><tr><td>Tracktor(v2)[3]</td><td>56.3</td><td>55.1</td><td>21.1</td><td>35.3</td><td>8866</td><td>235449</td></tr><tr><td>FAMNet [15]</td><td>52.0</td><td>48.7</td><td>19.1</td><td>33.4</td><td>14138</td><td>253616</td></tr><tr><td>STRN [55]</td><td>50.9</td><td>56.0</td><td>18.9</td><td>33.8</td><td>25295</td><td>249365</td></tr><tr><td colspan=\"7\">Offline, TrajE with occlusion reconstruction</td></tr><tr><td>CenterTrack+TrajE</td><td>67.8(+6.3)</td><td>61.4(+1.8)</td><td>36.0</td><td>24.5</td><td>20982</td><td>157468</td></tr><tr><td>Lif_T [23]</td><td>60.5</td><td>65.6</td><td>27.0</td><td>33.6</td><td>14966</td><td>206619</td></tr><tr><td>MPNTrack [7]</td><td>58.8</td><td>61.7</td><td>28.8</td><td>33.5</td><td>17413</td><td>213594</td></tr><tr><td>Tracktor(v2)+TrajE</td><td>56.6(+0.3)</td><td>58.2(+3.1)</td><td>21.9</td><td>35.7</td><td>10119</td><td>231091</td></tr><tr><td>TT17 [62]</td><td>54.9</td><td>63.1</td><td>24.4</td><td>38.1</td><td>20236</td><td>233295</td></tr><tr><td>TPM [39]</td><td>54.2</td><td>52.6</td><td>22.8</td><td>37.5</td><td>13739</td><td>242730</td></tr><tr><td>JBNOT [22]</td><td>52.6</td><td>50.8</td><td>19.7</td><td>35.8</td><td>31572</td><td>232659</td></tr><tr><td>ETC [51]</td><td>51.9</td><td>58.1</td><td>23.1</td><td>35.5</td><td>36164</td><td>232783</td></tr><tr><td>eHAF[48]</td><td>51.8</td><td>54.7</td><td>23.4</td><td>37.9</td><td>33212</td><td>236772</td></tr></tbody></table>", "caption": "Table 3: Comparison integrating TrajE to CenterTrack and Tracktor against the state of the art methods on the test set of MOTChallenge 17 dataset using public detections. In bold tracker + our method (TrajE). In red the best result, in blue the second best. The tracking baselines are CenterTrack+OFF, Tracktor+CV+CMC.", "list_citation_info": ["[22] Roberto Henschel, Yunzhe Zou, and Bodo Rosenhahn. Multiple people tracking using body and joint detections. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops, pages 0–0, 2019.", "[7] Guillem Brasó and Laura Leal-Taixé. Learning a neural solver for multiple object tracking. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 6247–6257, 2020.", "[48] Hao Sheng, Yang Zhang, Jiahui Chen, Zhang Xiong, and Jun Zhang. Heterogeneous association graph fusion for target association in multiple object tracking. IEEE Transactions on Circuits and Systems for Video Technology, 29(11):3269–3280, 2018.", "[15] Peng Chu and Haibin Ling. Famnet: Joint learning of feature, affinity and multi-dimensional assignment for online multiple object tracking. In Proceedings of the IEEE International Conference on Computer Vision, pages 6172–6181, 2019.", "[51] Gaoang Wang, Yizhou Wang, Haotian Zhang, Renshu Gu, and Jenq-Neng Hwang. Exploit the connectivity: Multi-object tracking with trackletnet. In Proceedings of the 27th ACM International Conference on Multimedia, pages 482–490, 2019.", "[39] Jinlong Peng, Tao Wang, Weiyao Lin, Jian Wang, John See, Shilei Wen, and Erui Ding. Tpm: Multiple object tracking with tracklet-plane matching. Pattern Recognition, page 107480, 2020.", "[62] Yang Zhang, Hao Sheng, Yubin Wu, Shuai Wang, Weifeng Lyu, Wei Ke, and Zhang Xiong. Long-term tracking with deep tracklet association. IEEE Transactions on Image Processing, 29:6694–6706, 2020.", "[63] Xingyi Zhou, Vladlen Koltun, and Philipp Krähenbühl. Tracking objects as points. arXiv preprint arXiv:2004.01177, 2020.", "[55] Jiarui Xu, Yue Cao, Zheng Zhang, and Han Hu. Spatial-temporal relation networks for multi-object tracking. In Proceedings of the IEEE International Conference on Computer Vision, pages 3988–3998, 2019.", "[3] Philipp Bergmann, Tim Meinhardt, and Laura Leal-Taixe. Tracking without bells and whistles. In Proceedings of the IEEE International Conference on Computer Vision, pages 941–951, 2019.", "[23] Andrea Hornakova, Roberto Henschel, Bodo Rosenhahn, and Paul Swoboda. Lifted disjoint paths with application in multiple object tracking. arXiv preprint arXiv:2006.14550, 2020.", "[28] Qiankun Liu, Qi Chu, Bin Liu, and Nenghai Yu. Gsm: Graph similarity model for multi-object tracking. In Christian Bessiere, editor, Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence, IJCAI-20, pages 530–536. International Joint Conferences on Artificial Intelligence Organization, 7 2020. Main track.", "[35] A. Milan, L. Leal-Taixé, I. Reid, S. Roth, and K. Schindler. MOT16: A benchmark for multi-object tracking. arXiv:1603.00831 [cs], Mar. 2016. arXiv: 1603.00831."]}, {"table": "<table><tbody><tr><td colspan=\"7\">UA-DETRAC [52]</td></tr><tr><td>Method</td><td>MOTA \\uparrow</td><td>IDF1 \\uparrow</td><td>MT % \\uparrow</td><td>ML % \\downarrow</td><td>FP \\downarrow</td><td>FN \\downarrow</td></tr><tr><td colspan=\"7\">Online, TrajE without occlusion reconstruction</td></tr><tr><td>CenterTrack+TrajE</td><td>69.9(+0.1)</td><td>80.1(+1.6)</td><td>70.0</td><td>7.9</td><td>41664</td><td>146722</td></tr><tr><td>CenterTrack [63]</td><td>69.8</td><td>78.4</td><td>69.9</td><td>7.9</td><td>40994</td><td>147244</td></tr><tr><td>POI [60]</td><td>69.2</td><td>-</td><td>67.4</td><td>5.2</td><td>-</td><td>-</td></tr><tr><td>WD [61]</td><td>68.5</td><td>-</td><td>70.2</td><td>3.1</td><td>-</td><td>-</td></tr><tr><td>Tracktor(v2)+TrajE</td><td>67.7(+0.1)</td><td>75.5(+1.3)</td><td>60.4</td><td>10.0</td><td>23273</td><td>194040</td></tr><tr><td>Tracktor(v2) [3]</td><td>67.6</td><td>74.2</td><td>60.3</td><td>10.1</td><td>23699</td><td>194234</td></tr><tr><td>DeepSORT [54]</td><td>65.4</td><td>-</td><td>65.9</td><td>4.7</td><td>-</td><td>-</td></tr><tr><td>RMOT [59]</td><td>62.6</td><td>-</td><td>42.1</td><td>6.5</td><td>-</td><td>-</td></tr><tr><td>IHTLS [16]</td><td>62.6</td><td>-</td><td>63.4</td><td>3.8</td><td>-</td><td>-</td></tr><tr><td colspan=\"7\">Offline, TrajE with occlusion reconstruction</td></tr><tr><td>CenterTrack+TrajE</td><td>70.3(+0.5)</td><td>80.4(+2.0)</td><td>70.3</td><td>7.9</td><td>42277</td><td>143938</td></tr><tr><td>Tracktor(v2)+TrajE</td><td>68.9+(1.3)</td><td>75.7(+1.5)</td><td>63.3</td><td>9.0</td><td>30135</td><td>179468</td></tr></tbody></table>", "caption": "Table 4: Comparison integrating TrajE to CenterTrack and Tracktor with state-of-the art methods on the test set of UA-DETRAC dataset using CompACT [8] public detections. In bold tracker + our method (TrajE). In red the best result, in blue the second best. Results from [61].", "list_citation_info": ["[63] Xingyi Zhou, Vladlen Koltun, and Philipp Krähenbühl. Tracking objects as points. arXiv preprint arXiv:2004.01177, 2020.", "[52] Longyin Wen, Dawei Du, Zhaowei Cai, Zhen Lei, Ming-Ching Chang, Honggang Qi, Jongwoo Lim, Ming-Hsuan Yang, and Siwei Lyu. UA-DETRAC: A new benchmark and protocol for multi-object detection and tracking. Computer Vision and Image Understanding, 2020.", "[3] Philipp Bergmann, Tim Meinhardt, and Laura Leal-Taixe. Tracking without bells and whistles. In Proceedings of the IEEE International Conference on Computer Vision, pages 941–951, 2019.", "[59] Ju Hong Yoon, Ming-Hsuan Yang, Jongwoo Lim, and Kuk-Jin Yoon. Bayesian multi-object tracking using motion context from multiple objects. In 2015 IEEE Winter Conference on Applications of Computer Vision, pages 33–40. IEEE, 2015.", "[8] Zhaowei Cai, Mohammad Saberian, and Nuno Vasconcelos. Learning complexity-aware cascades for deep pedestrian detection. In Proceedings of the IEEE International Conference on Computer Vision, pages 3361–3369, 2015.", "[61] Yanjie Zeng, Xinsha Fu, Lei Gao, Jiawei Zhu, Haifeng Li, and Yuheng Li. Robust multivehicle tracking with wasserstein association metric in surveillance videos. IEEE Access, 8:47863–47876, 2020.", "[16] Caglayan Dicle, Octavia I Camps, and Mario Sznaier. The way they move: Tracking multiple targets with similar appearance. In Proceedings of the IEEE international conference on computer vision, pages 2304–2311, 2013.", "[60] Fengwei Yu, Wenbo Li, Quanquan Li, Yu Liu, Xiaohua Shi, and Junjie Yan. Poi: Multiple object tracking with high performance detection and appearance feature. In European Conference on Computer Vision, pages 36–42. Springer, 2016.", "[54] Nicolai Wojke, Alex Bewley, and Dietrich Paulus. Simple online and realtime tracking with a deep association metric. In 2017 IEEE international conference on image processing (ICIP), pages 3645–3649. IEEE, 2017."]}]}