{"title": "Rgl-net: A recurrent graph learning framework for progressive part assembly", "abstract": "Autonomous assembly of objects is an essential task in robotics and 3D computer vision. It has been studied extensively in robotics as a problem of motion planning, actuator control and obstacle avoidance. However, the task of developing a generalized framework for assembly robust to structural variants remains relatively unexplored. In this work, we tackle this problem using a recurrent graph learning framework considering inter-part relations and the progressive update of the part pose. Our network can learn more plausible predictions of shape structure by accounting for priorly assembled parts. Compared to the current state-of-the-art, our network yields up to 10% improvement in part accuracy and up to 15% improvement in connectivity accuracy on the PartNet dataset. Moreover, our resulting latent space facilitates exciting applications such as shape recovery from the point-cloud components. We conduct extensive experiments to justify our design choices and demonstrate the effectiveness of the proposed framework.", "authors": ["Abhinav Narayan Harish", " Rajendra Nagar", " Shanmuganathan Raman"], "pdf_url": "https://arxiv.org/abs/2107.12859", "list_table_and_caption": [{"table": "<table><tr><td></td><td></td><td>B-Global [27, 17]</td><td>B-LSTM [33]</td><td>B-Complement [31]</td><td>B-DGL [11]</td><td>Ours without MoN</td><td>Ours (Complete)</td></tr><tr><td rowspan=\"3\">SCD\\downarrow</td><td>Chair</td><td>0.0146</td><td>0.0131</td><td>0.0241</td><td>0.0091</td><td>0.0101</td><td>0.0087</td></tr><tr><td>Table</td><td>0.0112</td><td>0.0125</td><td>0.0298</td><td>0.0050</td><td>0.0053</td><td>0.0048</td></tr><tr><td>Lamp</td><td>0.0079</td><td>0.0077</td><td>0.0150</td><td>0.0093</td><td>0.0088</td><td>0.0072</td></tr><tr><td rowspan=\"3\">PA\\uparrow</td><td>Chair</td><td>15.70</td><td>21.77</td><td>8.78</td><td>39.00</td><td>42.84</td><td>49.06</td></tr><tr><td>Table</td><td>15.37</td><td>28.64</td><td>2.32</td><td>49.51</td><td>49.15</td><td>54.16</td></tr><tr><td>Lamp</td><td>22.61</td><td>20.78</td><td>12.67</td><td>33.33</td><td>31.66</td><td>37.56</td></tr><tr><td rowspan=\"3\">CA\\uparrow</td><td>Chair</td><td>9.90</td><td>6.80</td><td>9.19</td><td>23.87</td><td>28.74</td><td>32.26</td></tr><tr><td>Table</td><td>33.84</td><td>22.56</td><td>15.57</td><td>39.96</td><td>39.71</td><td>42.15</td></tr><tr><td>Lamp</td><td>18.60</td><td>14.05</td><td>26.56</td><td>41.70</td><td>46.28</td><td>57.34</td></tr></table>", "caption": "Table 1: Quantitative comparison with baseline methods. Here SCD: Shape Chamfer Distance, PA: Part Accuracy and CA: Connectivity Accuracy. Green represents the best performance and Blue represents the second best. ", "list_citation_info": ["[27] Nadav Schor, Oren Katzir, Hao Zhang, and Daniel Cohen-Or. Componet: Learning to generate the unseen by part synthesis and composition. Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 8759–8768, 2019.", "[31] Minhyuk Sung, Hao Su, Vladimir G Kim, Siddhartha Chaudhuri, and Leonidas Guibas. Complementme: Weakly-supervised component suggestions for 3d modeling. ACM Transactions on Graphics (TOG), 36(6):1–12, 2017.", "[33] Rundi Wu, Yixin Zhuang, Kai Xu, Hao Zhang, and Baoquan Chen. Pq-net: A generative part seq2seq network for 3d shapes. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 829–838, 2020.", "[11] Jialei Huang, Guanqi Zhan, Qingnan Fan, Kaichun Mo, Lin Shao, Baoquan Chen, Leonidas Guibas, and Hao Dong. Generative 3d part assembly via dynamic graph learning. The IEEE Conference on Neural Information Processing Systems (NeurIPS), 2020."]}]}