{"title": "The CORSMAL benchmark for the prediction of the properties of containers", "abstract": "The contactless estimation of the weight of a container and the amount of its content manipulated by a person are key pre-requisites for safe human-to-robot handovers. However, opaqueness and transparencies of the container and the content, and variability of materials, shapes, and sizes, make this estimation difficult. In this paper, we present a range of methods and an open framework to benchmark acoustic and visual perception for the estimation of the capacity of a container, and the type, mass, and amount of its content. The framework includes a dataset, specific tasks and performance measures. We conduct an in-depth comparative analysis of methods that used this framework and audio-only or vision-only baselines designed from related works. Based on this analysis, we can conclude that audio-only and audio-visual classifiers are suitable for the estimation of the type and amount of the content using different types of convolutional neural networks, combined with either recurrent neural networks or a majority voting strategy, whereas computer vision methods are suitable to determine the capacity of the container using regression and geometric approaches. Classifying the content type and level using only audio achieves a weighted average F1-score up to 81% and 97%, respectively. Estimating the container capacity with vision-only approaches and estimating the filling mass with audio-visual multi-stage approaches reach up to 65% weighted average capacity and mass scores. These results show that there is still room for improvement on the design of new methods. These new methods can be ranked and compared on the individual leaderboards provided by our open framework.", "authors": ["Alessio Xompero", " Santiago Donaher", " Vladimir Iashin", " Francesca Palermo", " Gökhan Solak", " Claudio Coppola", " Reina Ishikawa", " Yuichi Nagao", " Ryo Hachiuma", " Qi Liu", " Fan Feng", " Chuanlin Lan", " Rosa H. M. Chan", " Guilherme Christmann", " Jyun-Ting Song", " Gonuguntla Neeharika", " Chinnakotla Krishna Teja Reddy", " Dinesh Jain", " Bakhtawar Ur Rehman", " Andrea Cavallaro"], "pdf_url": "https://arxiv.org/abs/2107.12719", "list_table_and_caption": [[], []]}