{"title": "Sensor data augmentation with resampling for contrastive learning in human activity recognition", "abstract": "While deep learning has contributed to the advancement of sensor-based Human Activity Recognition (HAR), it is usually a costly and challenging supervised task with the needs of a large amount of labeled data. To alleviate this issue, contrastive learning has been applied for sensor-based HAR. Data augmentation is an essential part of contrastive learning and has a significant impact on the performance of downstream tasks. However, current popular augmentation methods do not achieve competitive performance in contrastive learning for sensor-based HAR. Motivated by this issue, we propose a new sensor data augmentation method by resampling, which simulates more realistic activity data by varying the sampling frequency to maximize the coverage of the sampling space. In addition, we extend MoCo, a popular contrastive learning framework, to MoCoHAR for HAR. The resampling augmentation method will be evaluated on two contrastive learning frameworks, SimCLRHAR and MoCoHAR, using UCI-HAR, MotionSensor, and USC-HAD datasets. The experiment results show that the resampling augmentation method outperforms all state-of-the-art methods under a small amount of labeled data, on SimCLRHAR and MoCoHAR, with mean F1-score as the evaluation metric. The results also demonstrate that not all data augmentation methods have positive effects in the contrastive learning framework.", "authors": ["Jinqiang Wang", " Tao Zhu", " Jingyuan Gan", " Liming Chen", " Huansheng Ning", " Yaping Wan"], "pdf_url": "https://arxiv.org/abs/2109.02054", "list_table_and_caption": [{"table": "<table><tbody><tr><td></td><th>Linear evaluation</th><th>Fine-tuned</th></tr><tr><td rowspan=\"2\">Rotated [16]</td><td>85.67</td><td>91.41</td></tr><tr><td>[82.55,88.79]</td><td>[90.44,92.38]</td></tr><tr><td rowspan=\"2\">Resampling(ours)</td><td>89.50</td><td>92.10</td></tr><tr><td>[88.42,90.57]</td><td>[89.36,94.84]</td></tr></tbody></table>", "caption": "TABLE VII: TPN backbone network on MotionSensor dataset", "list_citation_info": ["[16] C. I. Tang, I. Perez-Pozuelo, D. Spathis, and C. Mascolo, “Exploring contrastive learning in human activity recognition for healthcare,” arXiv preprint arXiv:2011.11542, 2020."]}]}