{"title": "Federated contrastive learning for decentralized unlabeled medical images", "abstract": "A label-efficient paradigm in computer vision is based on self-supervised contrastive pre-training on unlabeled data followed by fine-tuning with a small number of labels. Making practical use of a federated computing environment in the clinical domain and learning on medical images poses specific challenges. In this work, we propose FedMoCo, a robust federated contrastive learning (FCL) framework, which makes efficient use of decentralized unlabeled medical data. FedMoCo has two novel modules: metadata transfer, an inter-node statistical data augmentation module, and self-adaptive aggregation, an aggregation module based on representational similarity analysis. To the best of our knowledge, this is the first FCL work on medical images. Our experiments show that FedMoCo can consistently outperform FedAvg, a seminal federated learning framework, in extracting meaningful representations for downstream tasks. We further show that FedMoCo can substantially reduce the amount of labeled data required in a downstream task, such as COVID-19 detection, to achieve a reasonable performance.", "authors": ["Nanqing Dong", " Irina Voiculescu"], "pdf_url": "https://arxiv.org/abs/2109.07504", "list_table_and_caption": [{"table": "<table><tr><td>dataset</td><td>size</td><td># of classes</td><td>multi-label</td><td>multi-view</td><td>balanced</td><td>resolution</td></tr><tr><td> CheXpert [11]</td><td>371920</td><td>14</td><td>✓</td><td>✓</td><td>✗</td><td>390\\times 320</td></tr><tr><td>ChestX-ray8 [26]</td><td>112120</td><td>15</td><td>✓</td><td>✗</td><td>✗</td><td>1024\\times 1024</td></tr><tr><td>VinDr-CXR [17]</td><td>15000</td><td>15</td><td>✓</td><td>✗</td><td>✗</td><td>512\\times 512</td></tr><tr><td>COVID-19 [5]</td><td>3886</td><td>3</td><td>✗</td><td>✗</td><td>✓</td><td>256\\times 256</td></tr></table>", "caption": "Table 1: Dataset description.", "list_citation_info": ["[26] Wang, X., Peng, Y., Lu, L., Lu, Z., Bagheri, M., Summers, R.M.: Chestx-ray8: Hospital-scale chest x-ray database and benchmarks on weakly-supervised classification and localization of common thorax diseases. In: CVPR. pp. 2097–2106 (2017)", "[11] Irvin, J., Rajpurkar, P., Ko, M., Yu, Y., Ciurea-Ilcus, S., Chute, C., Marklund, H., Haghgoo, B., Ball, R., Shpanskaya, K., et al.: Chexpert: A large chest radiograph dataset with uncertainty labels and expert comparison. In: AAAI. vol. 33(01), pp. 590–597 (2019)", "[5] Chowdhury, M.E., Rahman, T., Khandakar, A., Mazhar, R., Kadir, M.A., Mahbub, Z.B., Islam, K.R., Khan, M.S., Iqbal, A., Al Emadi, N., et al.: Can ai help in screening viral and covid-19 pneumonia? IEEE Access 8, 132665–132676 (2020)", "[17] Nguyen, H.Q., Lam, K., Le, L.T., Pham, H.H., Tran, D.Q., Nguyen, D.B., Le, D.D., Pham, C.M., Tong, H.T., Dinh, D.H., et al.: Vindr-cxr: An open dataset of chest x-rays with radiologist’s annotations. arXiv preprint arXiv:2012.15029 (2020)"]}]}