{"title": "Measuring hidden bias within face recognition via racial phenotypes", "abstract": "Recent work reports disparate performance for intersectional racial groups across face recognition tasks: face verification and identification. However, the definition of those racial groups has a significant impact on the underlying findings of such racial bias analysis. Previous studies define these groups based on either demographic information (e.g. African, Asian etc.) or skin tone (e.g. lighter or darker skins). The use of such sensitive or broad group definitions has disadvantages for bias investigation and subsequent counter-bias solutions design. By contrast, this study introduces an alternative racial bias analysis methodology via facial phenotype attributes for face recognition. We use the set of observable characteristics of an individual face where a race-related facial phenotype is hence specific to the human face and correlated to the racial profile of the subject. We propose categorical test cases to investigate the individual influence of those attributes on bias within face recognition tasks. We compare our phenotype-based grouping methodology with previous grouping strategies and show that phenotype-based groupings uncover hidden bias without reliance upon any potentially protected attributes or ill-defined grouping strategies. Furthermore, we contribute corresponding phenotype attribute category labels for two face recognition tasks: RFW for face verification and VGGFace2 (test set) for face identification.", "authors": ["Seyma Yucer", " Furkan Tektas", " Noura Al Moubayed", " Toby P. Breckon"], "pdf_url": "https://arxiv.org/abs/2110.09839", "list_table_and_caption": [{"table": "<table><tr><td>Attribute</td><td>Categories</td><td>RFW</td><td>VGGFace2</td></tr><tr><td>Skin Type</td><td>Type 1 / 2 / 3 / 4 / 5 / 6</td><td>0.71</td><td>1.14</td></tr><tr><td>Eyelid Type</td><td>Monolid / Other</td><td>0.80</td><td>1.09</td></tr><tr><td>Nose Shape</td><td>Wide / Narrow</td><td>0.24</td><td>0.18</td></tr><tr><td>Lip Shape</td><td>Full / Small</td><td>0.28</td><td>0.63</td></tr><tr><td>Hair Type</td><td>Straight / Wavy / Curly / Bald</td><td>0.70</td><td>1.11</td></tr><tr><td>Hair Colour</td><td>Red / Blonde / Brown / Black / Grey</td><td>1.23</td><td>0.67</td></tr></table>", "caption": "Table 2: Facial phenotype attributes and their categorisation based on [44] along with normalised standard deviations \\sigma/\\mu.", "list_citation_info": ["[44] Cynthia Feliciano. Shades of race: How phenotype and observer characteristics shape racial classification. American Behavioral Scientist, 2016."]}]}