{"title": "ibot: Image bert pre-training with online tokenizer", "abstract": "The success of language Transformers is primarily attributed to the pretext task of masked language modeling (MLM), where texts are first tokenized into semantically meaningful pieces. In this work, we study masked image modeling (MIM) and indicate the advantages and challenges of using a semantically meaningful visual tokenizer. We present a self-supervised framework iBOT that can perform masked prediction with an online tokenizer. Specifically, we perform self-distillation on masked patch tokens and take the teacher network as the online tokenizer, along with self-distillation on the class token to acquire visual semantics. The online tokenizer is jointly learnable with the MIM objective and dispenses with a multi-stage training pipeline where the tokenizer needs to be pre-trained beforehand. We show the prominence of iBOT by achieving an 82.3% linear probing accuracy and an 87.8% fine-tuning accuracy evaluated on ImageNet-1K. Beyond the state-of-the-art image classification results, we underline emerging local semantic patterns, which helps the models to obtain strong robustness against common corruptions and achieve leading results on dense downstream tasks, eg., object detection, instance segmentation, and semantic segmentation.", "authors": ["Jinghao Zhou", " Chen Wei", " Huiyu Wang", " Wei Shen", " Cihang Xie", " Alan Yuille", " Tao Kong"], "pdf_url": "https://arxiv.org/abs/2111.07832", "list_table_and_caption": [{"table": "<table><tr><td>Method</td><td>k-NN</td><td>Linear</td><td>Fine-Tune</td></tr><tr><td>Rand.</td><td>-</td><td>-</td><td>79.9</td></tr><tr><td>MPP (Dosovitskiy et al., 2021)</td><td>16.4</td><td>37.2</td><td>80.8</td></tr><tr><td>Patch Clustering</td><td>19.2</td><td>40.1</td><td>81.3</td></tr><tr><td>BEiT (Bao et al., 2021)</td><td>6.9</td><td>24.2</td><td>81.4</td></tr><tr><td>Standalone DINO as tokenizer</td><td>44.3</td><td>60.0</td><td>81.7</td></tr><tr><td>iBOT</td><td>70.3</td><td>74.8</td><td>81.5</td></tr></table>", "caption": "Table 20: Methodology comparison over different approaches to tokenize the patches. We report ImageNet-1K k-NN, linear and fine-tuning validation accuracy. Models are pre-trained with ViT-S/16 and 300 epochs.", "list_citation_info": ["Dosovitskiy et al. (2021) Alexey Dosovitskiy, Lucas Beyer, Alexander Kolesnikov, Dirk Weissenborn, Xiaohua Zhai, Thomas Unterthiner, Mostafa Dehghani, Matthias Minderer, Georg Heigold, Sylvain Gelly, Jakob Uszkoreit, and Neil Houlsby. An image is worth 16x16 words: Transformers for image recognition at scale. In ICLR, 2021.", "Bao et al. (2021) Hangbo Bao, Li Dong, and Furu Wei. BEiT: BERT pre-training of image transformers. arXiv preprint arXiv:2106.08254, 2021."]}]}