{"title": "Textured mesh quality assessment: Large-scale dataset and deep learning-based quality metric", "abstract": "Over the past decade, 3D graphics have become highly detailed to mimic the real world, exploding their size and complexity. Certain applications and device constraints necessitate their simplification and/or lossy compression, which can degrade their visual quality. Thus, to ensure the best Quality of Experience (QoE), it is important to evaluate the visual quality to accurately drive the compression and find the right compromise between visual quality and data size. In this work, we focus on subjective and objective quality assessment of textured 3D meshes. We first establish a large-scale dataset, which includes 55 source models quantitatively characterized in terms of geometric, color, and semantic complexity, and corrupted by combinations of 5 types of compression-based distortions applied on the geometry, texture mapping and texture image of the meshes. This dataset contains over 343k distorted stimuli. We propose an approach to select a challenging subset of 3000 stimuli for which we collected 148929 quality judgments from over 4500 participants in a large-scale crowdsourced subjective experiment. Leveraging our subject-rated dataset, a learning-based quality metric for 3D graphics was proposed. Our metric demonstrates state-of-the-art results on our dataset of textured meshes and on a dataset of distorted meshes with vertex colors. Finally, we present an application of our metric and dataset to explore the influence of distortion interactions and content characteristics on the perceived quality of compressed textured meshes.", "authors": ["Yana Nehmé", " Florent Dupont", " Jean-Philippe Farrugia", " Patrick Le Callet", " Guillaume Lavoué"], "pdf_url": "https://arxiv.org/abs/2202.02397", "list_table_and_caption": [{"table": "<table><tr><td>Dataset</td><td> 3D Repre-sentation </td><td>Attributes</td><td> # Stimulirated </td></tr><tr><td>LIRIS Textured Mesh(Guo et al., 2016) </td><td>Mesh</td><td>Texture maps</td><td> \\bullet 100\\times2 renderings\\bullet 36\\times2 renderings </td></tr><tr><td>3D Meshes with VertexColors (Nehmé et al., 2021b) </td><td>Mesh</td><td>Vertex colors</td><td>480</td></tr><tr><td>\\clineB1-43M-PCCD(Alexiou et al., 2019) </td><td>Point cloud</td><td>Colored</td><td> \\bullet 240\\bullet 40 &amp; 30 </td></tr><tr><td>IRPC (Javaheri et al., 2019)</td><td>Point cloud</td><td>\\bullet 2\\timesColorless\\bullet Colored </td><td> \\bullet 54\\bullet 54 </td></tr><tr><td>WPC (Suet al., 2019)</td><td>Point cloud</td><td>Colored</td><td>740</td></tr><tr><td>VsenseVVDB(Zermanet al., 2019) </td><td>Point cloud</td><td>Colored</td><td>32</td></tr><tr><td>VsenseVVDB2(Zermanet al., 2020) </td><td>\\bullet Point cloud\\bullet Mesh </td><td>\\bullet Colored\\bullet Texture maps </td><td> \\bullet 136\\bullet 28 </td></tr><tr><td>ICIP2020 (Perryet al., 2020) </td><td>Point cloud</td><td>Colored</td><td>96</td></tr><tr><td>PointXR (Alexiouet al., 2020) </td><td>Point cloud</td><td>Colored</td><td>40</td></tr><tr><td>SJTU-PCQA (Yang et al., 2020) </td><td>Point cloud</td><td>Colored</td><td>378</td></tr><tr><td>SIAT-PCQD (Wuet al., 2021) </td><td>Point cloud</td><td>Colored</td><td>340</td></tr><tr><td>LB-PCCD(Lazzarottoet al., 2021) </td><td>Point cloud</td><td>Colored</td><td>105</td></tr><tr><td>2DTV-VR-QoE(Violaet al., 2022) </td><td>Point cloud</td><td>Colored</td><td>72</td></tr><tr><td>LS-PCQA (Liuet al., 2021a)Available after publication </td><td>Point cloud</td><td>Colored</td><td> \\bullet 1320(MOS)\\bullet 22704(Pseudo-MOS) </td></tr><tr><td>\\clineB1-43Our dataset</td><td>Mesh</td><td>Texture maps</td><td> \\bullet 3000(MOS)\\bullet 340750(Pseudo-MOS) </td></tr></table>", "caption": "Table 1. Publicly available quality assessment datasets for meshes and point clouds.", "list_citation_info": ["Zerman et al. (2020) Emin Zerman, Cagri Ozcinar, Pan Gao, and Aljosa Smolic. 2020. Textured mesh vs coloured point cloud: A subjective study for volumetric video compression. In 2020 Twelfth International Conference on Quality of Multimedia Experience (QoMEX). IEEE, 1–6.", "Perry et al. (2020) S. Perry, H. P. Cong, L. A. da Silva Cruz, J. Prazeres, M. Pereira, A. Pinheiro, E. Dumic, E. Alexiou, and T. Ebrahimi. 2020. Quality Evaluation Of Static Point Clouds Encoded Using MPEG Codecs. In 2020 IEEE International Conference on Image Processing (ICIP). 3428–3432. https://doi.org/10.1109/ICIP40778.2020.9191308", "Guo et al. (2016) Jinjiang Guo, Vincent Vidal, Irene Cheng, Anup Basu, Atilla Baskurt, and Guillaume Lavoué. 2016. Subjective and Objective Visual Quality Assessment of Textured 3D Meshes. ACM Transactions on Applied Perception 14 (10 2016), 1–20. https://doi.org/10.1145/2996296", "Nehmé et al. (2021b) Yana Nehmé, Florent Dupont, Jean-Philippe Farrugia, Patrick Le Callet, and Guillaume Lavoué. 2021b. Visual Quality of 3D Meshes With Diffuse Colors in Virtual Reality: Subjective and Objective Evaluation. IEEE Transactions on Visualization and Computer Graphics 27, 3 (2021), 2202–2219. https://doi.org/10.1109/TVCG.2020.3036153", "Javaheri et al. (2019) A Javaheri, C Brites, F Pereira, and J Ascenso. 2019. Point Cloud Rendering after Coding : Impacts on Subjective and Objective Quality. arXiv:1912.09137 (2019), 1–13.", "Zerman et al. (2019) Emin Zerman, Pan Gao, Cagri Ozcinar, and Aljosa Smolic. 2019. Subjective and objective quality assessment for volumetric video compression. Electronic Imaging 2019, 10 (2019), 323–1.", "Wu et al. (2021) Xinju Wu, Yun Zhang, Chunling Fan, Junhui Hou, and Sam Kwong. 2021. Subjective Quality Database and Objective Study of Compressed Point Clouds With 6DoF Head-Mounted Display. IEEE Transactions on Circuits and Systems for Video Technology 31, 12 (2021), 4630–4644.", "Liu et al. (2021a) Yipeng Liu, Qi Yang, Yiling Xu, and Le Yang. 2021a. Point Cloud Quality Assessment: Dataset Construction and Learning-based No-Reference Approach. preprint arXiv:2012.11895 (2021).", "Lazzarotto et al. (2021) Davi Lazzarotto, Evangelos Alexiou, and Touradj Ebrahimi. 2021. Benchmarking of objective quality metrics for point cloud compression. In 2021 IEEE 23rd International Workshop on Multimedia Signal Processing (MMSP). 1–6.", "Alexiou et al. (2020) E. Alexiou, N. Yang, and T. Ebrahimi. 2020. PointXR: A Toolbox for Visualization and Subjective Evaluation of Point Clouds in Virtual Reality. In 2020 Twelfth International Conference on Quality of Multimedia Experience (QoMEX). 1–6. https://doi.org/10.1109/QoMEX48832.2020.9123121", "Su et al. (2019) H. Su, Z. Duanmu, W. Liu, Q. Liu, and Z. Wang. 2019. Perceptual Quality Assessment of 3D Point Clouds. In 2019 IEEE International Conference on Image Processing (ICIP). 3182–3186.", "Alexiou et al. (2019) E. Alexiou, I. Viola, T. M. Borges, T. A. Fonseca, R. L. de Queiroz, and T. Ebrahimi. 2019. A comprehensive study of the rate-distortion performance in MPEG point cloud compression. APSIPA Transactions on Signal and Information Processing 8 (2019), e27.", "Yang et al. (2020) Q. Yang, H. Chen, Z. Ma, Y. Xu, R. Tang, and J. Sun. 2020. Predicting the Perceptual Quality of Point Cloud: A 3D-to-2D Projection-Based Exploration. IEEE Transactions on Multimedia (2020), 3877–3891.", "Viola et al. (2022) Irene Viola, Shishir Subramanyam, Jie Li, and Pablo Cesar. 2022. On the impact of VR assessment on the Quality of Experience of Highly Realistic Digital Humans. arXiv:2201.07701 [cs.MM]"]}, {"table": "<table><tr><td></td><td>Graphics-LPIPS</td><td>CMDM<sub>vis</sub>*</td><td>SSIM*</td><td>HDR-VDP2*</td><td>iCID*</td></tr><tr><td>PLCC</td><td>0.89</td><td>0.89</td><td>0.79</td><td>0.81</td><td>0.86</td></tr><tr><td>SROCC</td><td>0.88</td><td>0.87</td><td>0.8</td><td>0.83</td><td>0.87</td></tr></table>", "caption": "Table 4. Performance comparison of different metrics on a dataset of meshes with vertex colors. For metrics marked with a *, the values are reprinted from the supplementary material of (Nehmé et al., 2021b).", "list_citation_info": ["Nehmé et al. (2021b) Yana Nehmé, Florent Dupont, Jean-Philippe Farrugia, Patrick Le Callet, and Guillaume Lavoué. 2021b. Visual Quality of 3D Meshes With Diffuse Colors in Virtual Reality: Subjective and Objective Evaluation. IEEE Transactions on Visualization and Computer Graphics 27, 3 (2021), 2202–2219. https://doi.org/10.1109/TVCG.2020.3036153"]}]}