{"title": "Lightx3ecg: A Lightweight and Explainable Deep Learning System for 3-Lead Electrocardiogram Classification", "abstract": "Cardiovascular diseases (CVDs) are a group of heart and blood vessel disorders that is one of the most serious dangers to human health, and the number of such patients is still growing. Early and accurate detection plays a key role in successful treatment and intervention. Electrocardiogram (ECG) is the gold standard for identifying a variety of cardiovascular abnormalities. In clinical practices and most of the current research, standard 12-lead ECG is mainly used. However, using a lower number of leads can make ECG more prevalent as it can be conveniently recorded by portable or wearable devices. In this research, we develop a novel deep learning system to accurately identify multiple cardiovascular abnormalities by using only three ECG leads.", "authors": ["Khiem H. Le", " Hieu H. Pham", " Thao BT. Nguyen", " Tu A. Nguyen", " Tien N. Thanh", " Cuong D. Do"], "pdf_url": "https://arxiv.org/abs/2207.12381", "list_table_and_caption": [{"table": "<table><tr><td>Method</td><td>F1 on Chapman</td><td>F1 on CPSC-2018</td><td>No. Params (M)</td><td>No. FLOPs (B)</td><td>Size (MB)</td></tr><tr><td>1D-ResNet34 [22]</td><td>0.9624</td><td>0.7684</td><td>16.61</td><td>5.91</td><td>58.18</td></tr><tr><td>1D-SEResNet34 [23]</td><td>0.9659</td><td>0.7845</td><td>16.76</td><td>5.91</td><td>58.75</td></tr><tr><td>TI-ResNet18 [24]</td><td>0.9647</td><td>0.7872</td><td>11.39</td><td>1.42</td><td>40.51</td></tr><tr><td>InceptionTime [40]</td><td>0.9417</td><td>0.7352</td><td>0.45</td><td>2.29</td><td>1.63</td></tr><tr><td>LightX3ECG (Ours)</td><td>0.9718</td><td>0.8004</td><td>5.31</td><td>1.34</td><td>6.52</td></tr><tr><td>LightX3ECG (w/o pruning)</td><td>0.9722</td><td>0.8010</td><td>5.31</td><td>1.34</td><td>19.28</td></tr></table>", "caption": "Table 3: Comparison of the proposed system to other methods.", "list_citation_info": ["[40] Hassan Ismail Fawaz, Benjamin Lucas, Germain Forestier, Charlotte Pelletier, Daniel F. Schmidt, Jonathan Weber, Geoffrey I. Webb, Lhassane Idoumghar, Pierre-Alain Muller, and François Petitjean. Inceptiontime: Finding alexnet for time series classification. Data Min. Knowl. Discov., 34(6):1936–1962, nov 2020.", "[23] Zhaowei Zhu, Xiang Lan, Tingting Zhao, Yangming Guo, Pipin Kojodjojo, Zhuoyang Xu, Zhuo Liu, Siqi Liu, Han Wang, Xingzhi Sun, and Mengling Feng. Identification of 27 abnormalities from multi-lead ecg signals: an ensembled se-resnet framework with sign loss function. Physiological Measurement, 42, 06 2021.", "[22] Dongdong Zhang, Samuel Yang, Xiaohui Yuan, and Ping Zhang. Interpretable deep learning for automatic diagnosis of 12-lead electrocardiogram. iScience, 24(4):102373, 2021.", "[24] Qihang Yao, Xiaomao Fan, Yunpeng Cai, Ruxin Wang, Liyan Yin, and Ye Li. Time-incremental convolutional neural network for arrhythmia detection in varied-length electrocardiogram. In 2018 IEEE 16th Intl Conf on Dependable, Autonomic and Secure Computing, 16th Intl Conf on Pervasive Intelligence and Computing, 4th Intl Conf on Big Data Intelligence and Computing and Cyber Science and Technology Congress(DASC/PiCom/DataCom/CyberSciTech), pages 754–761, 2018."]}, {"table": "<table><tr><td>Method</td><td>Chapman</td><td>CPSC-2018</td></tr><tr><td>SHAP [22]</td><td>0.16</td><td>0.18</td></tr><tr><td>Lead-wise Grad-CAM (Ours)</td><td>0.10</td><td>0.11</td></tr></table>", "caption": "Table 4: Spearman’s rank correlation of explanations<br/>between the original system and randomized system.", "list_citation_info": ["[22] Dongdong Zhang, Samuel Yang, Xiaohui Yuan, and Ping Zhang. Interpretable deep learning for automatic diagnosis of 12-lead electrocardiogram. iScience, 24(4):102373, 2021."]}]}