{"title": "A review of applications in federated learning", "abstract": "Federated learning (FL) has gained popularity in clinical research in recent years to facilitate privacy-preserving collaboration. Structured data, one of the most prevalent forms of clinical data, has experienced significant growth in volume concurrently, notably with the widespread adoption of electronic health records in clinical practice. This review examines FL applications on structured medical data, identifies contemporary limitations and discusses potential innovations. We searched five databases, SCOPUS, MEDLINE, Web of Science, Embase, and CINAHL, to identify articles that applied FL to structured medical data and reported results following the PRISMA guidelines. Each selected publication was evaluated from three primary perspectives, including data quality, modeling strategies, and FL frameworks. Out of the 1160 papers screened, 34 met the inclusion criteria, with each article consisting of one or more studies that used FL to handle structured clinical/medical data. Of these, 24 utilized data acquired from electronic health records, with clinical predictions and association studies being the most common clinical research tasks that FL was applied to. Only one article exclusively explored the vertical FL setting, while the remaining 33 explored the horizontal FL setting, with only 14 discussing comparisons between single-site (local) and FL (global) analysis. The existing FL applications on structured medical data lack sufficient evaluations of clinically meaningful benefits, particularly when compared to single-site analyses. Therefore, it is crucial for future FL applications to prioritize clinical motivations and develop designs and methodologies that can effectively support and aid clinical practice and research.", "authors": ["Siqi Li", " Pinyan Liu", " Gustavo G. Nascimento", " Xinru Wang", " Fabio Renato Manzolli Leite", " Bibhas Chakraborty", " Chuan Hong", " Yilin Ning", " Feng Xie", " Zhen Ling Teo", " Daniel Shu Wei Ting", " Hamed Haddadi", " Marcus Eng Hock Ong", " Marco Aurélio Peres", " Nan Liu"], "pdf_url": "https://arxiv.org/abs/2304.07310", "list_table_and_caption": [[], []]}