{"title": "Simulation-to-Reality domain adaptation for offline 3D object annotation on pointclouds with correlation alignment", "abstract": "Annotating objects with 3D bounding boxes in LiDAR pointclouds is a costly\nhuman driven process in an autonomous driving perception system. In this paper,\nwe present a method to semi-automatically annotate real-world pointclouds\ncollected by deployment vehicles using simulated data. We train a 3D object\ndetector model on labeled simulated data from CARLA jointly with real world\npointclouds from our target vehicle. The supervised object detection loss is\naugmented with a CORAL loss term to reduce the distance between labeled\nsimulated and unlabeled real pointcloud feature representations. The goal here\nis to learn representations that are invariant to simulated (labeled) and\nreal-world (unlabeled) target domains. We also provide an updated survey on\ndomain adaptation methods for pointclouds.", "authors": ["Weishuang Zhang", "B Ravi Kiran", "Thomas Gauthier", "Yanis Mazouz", "Theo Steger"], "published_date": "2022_02_06", "pdf_url": "http://arxiv.org/pdf/2202.02666v2", "list_table_and_caption": [{"table": "<table><thead><tr><th><p>DA Methods</p></th><th><p>Description</p></th></tr></thead><tbody><tr><td><p>Aligning I/O representations</p></td><td><p>Dataset-to-Dataset(D2D) transfer [Triess et al., 2021] involves transfer learning between LiDAR Datasets collected with different LiDAR configurations (number, scanning patter, spatial resolution, different classes/label spaces) would require alignment either by upsampling, downsampling, re-sampling of pointclouds. [Alonso. et al., 2021] class sensitive dataaugmentation. These methods are frequently hand-engineered. [Tomasello et al., 2019] present a Deep Sensor Cloning methods which enables the generation of pointclouds from expensive LiDARs (HDL64) using CNNs along with in-expensive LiDARs (Scala).</p></td></tr><tr><td><p>Modeling Physics</p></td><td><p>Authors [Hahner et al., 2021] have proposed a fog simulation method in pointclouds that is applicable to anyLiDAR dataset. [Zhao et al., 2020] learn dropout noise from real world data.</p></td></tr><tr><td><p>Adversarial Domain Mapping (ADM)</p></td><td><p>Learns a conditional mapping from source domain samples to their target domain samples using Generative Adversarial Networks (GANs). ADM can enable Simulation-to-Real(S2R) DA. Annotations from simulation can be leveraged by mapping Simulated clouds to real target domain clouds with subsequent training using source domain labels. Authors [Sallab et al., 2019] map simulated BEV images to real world equivalents while improving object detection performance.</p></td></tr><tr><td><p>Domain Invariant Learning</p></td><td><p>These methods are usually adversarial methods that align the feature spaces between source &amp; target pointcloud domains, thus enforcing consistent prediction on target domain. CORAL loss based on [Sun et al., 2017] belongs to this family. Authors [Langer et al., 2020] generate semi-synthetic pointclouds from the source data while performing correlation alignment between synthetic target scans and target scans.</p></td></tr><tr><td><p>Simulation-To-Real (S2R)</p></td><td><p>These families of methods focus on reducing the domain gap between simulation and reality. Authors [DeBortoli et al., 2021] claims to have encouraged the 3D feature encoder to extract features thatare invariant across simulated and real scenes. Authors [Huang and Qiao, 2021] generate synthetic pointclouds totrain classification models instead of aligning features. They are thus able to highlight which part of the object istransferred.</p></td></tr></tbody></table>", "caption": "Table 1: Categorization of Domain adaptation methods for LiDAR pointclouds.", "list_citation_info": ["Huang and Qiao, 2021 Huang, J. and Qiao, C. (2021). Generation for adaption: A gan-based approach for 3d domain adaption with point cloud data. ArXiv, abs/2102.07373.", "Langer et al., 2020 Langer, F., Milioto, A., Haag, A., Behley, J., and Stachniss, C. (2020). Domain transfer for semantic segmentation of lidar data using deep neural networks. In 2020 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), pages 8263–8270. IEEE.", "Sallab et al., 2019 Sallab, A. E., Sobh, I., Zahran, M., and Essam, N. (2019). Lidar sensor modeling and data augmentation with gans for autonomous driving. arXiv preprint arXiv:1905.07290.", "Sun et al., 2017 Sun, B., Feng, J., and Saenko, K. (2017). Correlation alignment for unsupervised domain adaptation. In Domain Adaptation in Computer Vision Applications, pages 153–171. Springer.", "Zhao et al., 2020 Zhao, S., Wang, Y., Li, B., Wu, B., Gao, Y., Xu, P., Darrell, T., and Keutzer, K. (2020). epointda: An end-to-end simulation-to-real domain adaptation framework for lidar point cloud segmentation. arXiv preprint arXiv:2009.03456, 2.", "Triess et al., 2021 Triess, L. T., Dreissig, M., Rist, C. B., and Zöllner, J. M. (2021). A survey on deep domain adaptation for lidar perception. In Proc. IEEE Intelligent Vehicles Symposium (IV) Workshops.", "DeBortoli et al., 2021 DeBortoli, R., Fuxin, L., Kapoor, A., and Hollinger, G. A. (2021). Adversarial training on point clouds for sim-to-real 3d object detection. IEEE Robotics and Automation Letters, 6(4):6662–6669.", "Hahner et al., 2021 Hahner, M., Sakaridis, C., Dai, D., and Van Gool, L. (2021). Fog simulation on real lidar point clouds for 3d object detection in adverse weather. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 15283–15292.", "Tomasello et al., 2019 Tomasello, P., Sidhu, S., Shen, A., Moskewicz, M. W., Redmon, N., Joshi, G., Phadte, R., Jain, P., and Iandola, F. (2019). Dscnet: Replicating lidar point clouds with deep sensor cloning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops, pages 0–0.", "Alonso. et al., 2021 Alonso., I., Riazuelo., L., Montesano., L., and Murillo., A. (2021). Domain adaptation in lidar semantic segmentation by aligning class distributions. In Proceedings of the 18th International Conference on Informatics in Control, Automation and Robotics - ICINCO,, pages 330–337. INSTICC, SciTePress."]}], "citation_info_to_title": {"DeBortoli et al., 2021 DeBortoli, R., Fuxin, L., Kapoor, A., and Hollinger, G. A. (2021). Adversarial training on point clouds for sim-to-real 3d object detection. IEEE Robotics and Automation Letters, 6(4):6662–6669.": "Adversarial training on point clouds for sim-to-real 3d object detection", "Tomasello et al., 2019 Tomasello, P., Sidhu, S., Shen, A., Moskewicz, M. W., Redmon, N., Joshi, G., Phadte, R., Jain, P., and Iandola, F. (2019). Dscnet: Replicating lidar point clouds with deep sensor cloning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops, pages 0–0.": "Dscnet: Replicating lidar point clouds with deep sensor cloning", "Langer et al., 2020 Langer, F., Milioto, A., Haag, A., Behley, J., and Stachniss, C. (2020). Domain transfer for semantic segmentation of lidar data using deep neural networks. In 2020 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), pages 8263–8270. IEEE.": "Domain Transfer for Semantic Segmentation of LiDAR Data using Deep Neural Networks", "Hahner et al., 2021 Hahner, M., Sakaridis, C., Dai, D., and Van Gool, L. (2021). Fog simulation on real lidar point clouds for 3d object detection in adverse weather. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pages 15283–15292.": "Fog simulation on real lidar point clouds for 3d object detection in adverse weather", "Alonso. et al., 2021 Alonso., I., Riazuelo., L., Montesano., L., and Murillo., A. (2021). Domain adaptation in lidar semantic segmentation by aligning class distributions. In Proceedings of the 18th International Conference on Informatics in Control, Automation and Robotics - ICINCO,, pages 330–337. INSTICC, SciTePress.": "Domain Adaptation in Lidar Semantic Segmentation by Aligning Class Distributions", "Sallab et al., 2019 Sallab, A. E., Sobh, I., Zahran, M., and Essam, N. (2019). Lidar sensor modeling and data augmentation with gans for autonomous driving. arXiv preprint arXiv:1905.07290.": "Lidar Sensor Modeling and Data Augmentation with GANs for Autonomous Driving", "Sun et al., 2017 Sun, B., Feng, J., and Saenko, K. (2017). Correlation alignment for unsupervised domain adaptation. In Domain Adaptation in Computer Vision Applications, pages 153–171. Springer.": "Correlation alignment for unsupervised domain adaptation", "Triess et al., 2021 Triess, L. T., Dreissig, M., Rist, C. B., and Zöllner, J. M. (2021). A survey on deep domain adaptation for lidar perception. In Proc. IEEE Intelligent Vehicles Symposium (IV) Workshops.": "A survey on deep domain adaptation for lidar perception", "Zhao et al., 2020 Zhao, S., Wang, Y., Li, B., Wu, B., Gao, Y., Xu, P., Darrell, T., and Keutzer, K. (2020). epointda: An end-to-end simulation-to-real domain adaptation framework for lidar point cloud segmentation. arXiv preprint arXiv:2009.03456, 2.": "epointda: An end-to-end simulation-to-real domain adaptation framework for lidar point cloud segmentation", "Huang and Qiao, 2021 Huang, J. and Qiao, C. (2021). Generation for adaption: A gan-based approach for 3d domain adaption with point cloud data. ArXiv, abs/2102.07373.": "Generation for Adaption: A GAN-Based Approach for 3D Domain Adaption with Point Cloud Data"}, "source_title_to_arxiv_id": {"Domain Adaptation in Lidar Semantic Segmentation by Aligning Class Distributions": "2010.12239"}}