{"title": "The Right Spin: Learning Object Motion from Rotation-Compensated Flow Fields", "abstract": "Both a good understanding of geometrical concepts and a broad familiarity\nwith objects lead to our excellent perception of moving objects. The human\nability to detect and segment moving objects works in the presence of multiple\nobjects, complex background geometry, motion of the observer and even\ncamouflage. How humans perceive moving objects so reliably is a longstanding\nresearch question in computer vision and borrows findings from related areas\nsuch as psychology, cognitive science and physics. One approach to the problem\nis to teach a deep network to model all of these effects. This contrasts with\nthe strategy used by human vision, where cognitive processes and body design\nare tightly coupled and each is responsible for certain aspects of correctly\nidentifying moving objects. Similarly from the computer vision perspective,\nthere is evidence that classical, geometry-based techniques are better suited\nto the \"motion-based\" parts of the problem, while deep networks are more\nsuitable for modeling appearance. In this work, we argue that the coupling of\ncamera rotation and camera translation can create complex motion fields that\nare difficult for a deep network to untangle directly. We present a novel\nprobabilistic model to estimate the camera's rotation given the motion field.\nWe then rectify the flow field to obtain a rotation-compensated motion field\nfor subsequent segmentation. This strategy of first estimating camera motion,\nand then allowing a network to learn the remaining parts of the problem, yields\nimproved results on the widely used DAVIS benchmark as well as the recently\npublished motion segmentation data set MoCA (Moving Camouflaged Animals).", "authors": ["Pia Bideau", "Erik Learned-Miller", "Cordelia Schmid", "Karteek Alahari"], "published_date": "2022_02_28", "pdf_url": "http://arxiv.org/pdf/2203.00115v1", "list_table_and_caption": [{"table": "<table><tbody><tr><th></th><th></th><td>SegI</td><td>MG</td><td>CIS</td><td>COD</td><td>COSNet</td><td>MATNet</td><td>Ours</td><td>Ours+Temp</td></tr><tr><th rowspan=\"3\"></th><th>Supervised</th><td>✗</td><td>✗</td><td>✗</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td></tr><tr><th>RGB</th><td>✗</td><td>✗</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✗</td><td>✗</td></tr><tr><th>Flow</th><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✗</td><td>✓</td><td>✓</td><td>✓</td></tr><tr><th></th><th>Multi-frame</th><td>✓</td><td>✓</td><td>✓</td><td>✗</td><td>✗</td><td>✓</td><td>✗</td><td>✓</td></tr><tr><th>\\mathcal{J}</th><th>Mean \\downarrow</th><td>68.6</td><td>63.4</td><td>49.4</td><td>44.9</td><td>50.7</td><td>64.2</td><td>58.3</td><td>65.8</td></tr><tr><th rowspan=\"6\">Success Rate</th><th>\\tau=0.5</th><td>77.2</td><td>74.2</td><td>55.6</td><td>41.4</td><td>58.8</td><td>71.2</td><td>64.5</td><td>72.7</td></tr><tr><th>\\tau=0.6</th><td>71.7</td><td>65.4</td><td>33.0</td><td>53.4</td><td>67.0</td><td>46.3</td><td>58.0</td><td>65.2</td></tr><tr><th>\\tau=0.7</th><td>62.3</td><td>52.4</td><td>32.9</td><td>23.5</td><td>45.7</td><td>59.9</td><td>49.8</td><td>53.8</td></tr><tr><th>\\tau=0.8</th><td>46.4</td><td>35.1</td><td>17.6</td><td>14.0</td><td>33.7</td><td>49.2</td><td>36.2</td><td>38.9</td></tr><tr><th>\\tau=0.9</th><td>25.5</td><td>14.7</td><td>3.0</td><td>5.9</td><td>16.7</td><td>24.6</td><td>16.6</td><td>17.3</td></tr><tr><th>SR_{mean}</th><td>56.6</td><td>48.4</td><td>31.1</td><td>23.6</td><td>41.7</td><td>54.4</td><td>45.0</td><td>49.6</td></tr></tbody></table>", "caption": "Table 2: Motion segmentation: Comparison to state-of-the-art motion segmentation methods on MoCA. Methods we compare against from left to right: (Lamdouaret al., 2021; Yanget al., 2021, 2019; Lamdouaret al., 2020; Luet al., 2019b; Zhouet al., 2020). Bold indicates best among all methods, while 1st-best and  2nd-best represent the best and second best within the supervised methods. Best viewed in color.", "list_citation_info": ["Lamdouar et al. (2021) Lamdouar, H., W. Xie, and A. Zisserman 2021. Segmenting invisible moving objects. In British Machine Vision Conference. Lamdouar et al. (2020) Lamdouar, H., C. Yang, W. Xie, and A. Zisserman 2020. Betrayed by motion: Camouflaged object discovery via motion segmentation. In Proceedings of the Asian Conference on Computer Vision. Lezama et al. (2011) Lezama, J., K. Alahari, J. Sivic, and I. Laptev 2011. Track to the future: Spatio-temporal video segmentation with long-range motion cues. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Longuet-Higgins et al. (1980) Longuet-Higgins, H.C., K. Prazdny, et al. 1980. The interpretation of a moving retinal image. Proceedings of the Royal Society of London. Series B, Biological sciences 208(1173): 385–397 . Lu et al. (2019a) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019a. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lu et al. (2019b) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019b. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Mahadevan et al. (2020) Mahadevan, S., A. Athar, A. Ošep, S. Hennen, L. Leal-Taixé, and B. Leibe 2020. Making a case for 3d convolutions for object segmentation in videos. In Proceedings of the British Machine Vision Conference. Mayer et al. (2016) Mayer, N., E. Ilg, P. Hausser, P. Fischer, D. Cremers, A. Dosovitskiy, and T. Brox 2016. A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Narayana et al. (2013) Narayana, M., A. Hanson, and E. Learned-Miller 2013. Coherent motion segmentation in moving camera videos using optical flow orientations. In Proceedings of the IEEE International Conference on Computer Vision. Ochs and Brox (2011) Ochs, P. and T. Brox 2011. Object segmentation in video: A hierarchical variational approach for turning point trajectories into dense regions. In Proceedings of the IEEE International Conference on Computer Vision. IEEE. Ogale et al. (2005) Ogale, A.S., C. Fermüller, and Y. Aloimonos. 2005. Motion segmentation using occlusions. IEEE Transactions Pattern Analysis and Machine Intelligence 27(6): 988–992 . Papazoglou and Ferrari (2013) Papazoglou, A. and V. Ferrari 2013. Fast object segmentation in unconstrained video. In Proceedings of the IEEE International Conference on Computer Vision. Perazzi et al. (2016) Perazzi, F., J. Pont-Tuset, B. McWilliams, L. Van Gool, M. Gross, and A. Sorkine-Hornung 2016. A benchmark dataset and evaluation methodology for video object segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Pirenne (1952) Pirenne, M.H. 1952. The scientific basis of Leonardo da Vinci’s theory of perspective. The British Journal for the Philosophy of Science 3(10): 169–185 . Ranjan et al. (2019) Ranjan, A., V. Jampani, L. Balles, K. Kim, D. Sun, J. Wulff, and M.J. Black 2019. Competitive collaboration: Joint unsupervised learning of depth, camera motion, optical flow and motion segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Shen et al. (2018) Shen, J., J. Peng, and L. Shao. 2018. Submodular trajectories for better motion segmentation in videos. IEEE Transactions on Image Processing 27(6): 2688–2700 . Sun et al. (2010) Sun, D., S. Roth, and M.J. Black 2010. Secrets of optical flow estimation and their principles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 ."]}, {"table": "<table><tbody><tr><td></td><td></td><td>SFL</td><td>COSNet</td><td>MATNet</td><td>LMP+App</td><td>FSEG</td><td>LVO</td><td>Ours+App</td><td>CIS</td><td>ARP</td><td>SegI</td></tr><tr><td></td><td>Supervised</td><td>✤</td><td>✤</td><td>✤</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✗</td><td>✗</td><td>✗</td></tr><tr><td></td><td>RGB</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✗</td></tr><tr><td></td><td>Flow</td><td>✓</td><td>✗</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td></tr><tr><td></td><td>Multi-frame</td><td>✗</td><td>✗</td><td>✓</td><td>✗</td><td>✗</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td><td>✓</td></tr><tr><td rowspan=\"3\">\\mathcal{J}</td><td>Mean \\uparrow</td><td>67.4</td><td>80.5</td><td>82.4</td><td>70.0</td><td>70.7</td><td>72.2</td><td>73.5</td><td>71.5</td><td>76.2</td><td>67.8</td></tr><tr><td>Recall \\uparrow</td><td>81.4</td><td>94.0</td><td>94.5</td><td>85.0</td><td>83.5</td><td>82.4</td><td>85.5</td><td>86.5</td><td>91.1</td><td>-</td></tr><tr><td>Decay \\downarrow</td><td>6.2</td><td>0.0</td><td>5.5</td><td>1.3</td><td>1.5</td><td>0.1</td><td>1.2</td><td>9.5</td><td>7.0</td><td>-</td></tr><tr><td rowspan=\"3\">\\mathcal{F}</td><td>Mean \\uparrow</td><td>66.7</td><td>79.4</td><td>80.7</td><td>65.9</td><td>65.3</td><td>67.5</td><td>68.9</td><td>70.5</td><td>70.6</td><td>-</td></tr><tr><td>Recall \\uparrow</td><td>77.1</td><td>90.4</td><td>90.2</td><td>79.2</td><td>73.8</td><td>75.4</td><td>79.6</td><td>83.5</td><td>83.5</td><td>-</td></tr><tr><td>Decay \\downarrow</td><td>5.1</td><td>0.0</td><td>4.5</td><td>2.5</td><td>1.8</td><td>2.7</td><td>1.4</td><td>7.0</td><td>7.9</td><td>-</td></tr></tbody></table>", "caption": "Table 3: Motion segmentation: Comparison to state-of-the-art motion segmentation methods on DAVIS2016. We group approaches according their training strategy: supervised and trained on the DAVIS training split (✤), supervised and trained on other segmentation data sets (✓) and unsupervised methods (✗). Methods we compare against from left to right: (Chenget al., 2017a; Luet al., 2019b; Zhouet al., 2020; Tokmakovet al., 2017a; Jainet al., 2017; Tokmakovet al., 2017b; Yanget al., 2019; Koh andKim, 2017; Lamdouaret al., 2021; Yanget al., 2021). Bold indicates best among all methods, while 1st-best and  2nd-best represent the best and second best within the supervised methods. Best viewed in color.", "list_citation_info": ["Cheng et al. (2017a) Cheng, J., Y.H. Tsai, S. Wang, and M.H. Yang 2017a. Segflow: Joint learning for video object segmentation and optical flow. In Proceedings of the IEEE International Conference on Computer Vision. Cheng et al. (2017b) Cheng, J., Y.H. Tsai, S. Wang, and M.H. Yang 2017b. SegFlow: Joint learning for video object segmentation and optical flow. In Proceedings of the IEEE International Conference on Computer Vision. Dave et al. (2019) Dave, A., P. Tokmakov, and D. Ramanan 2019. Towards segmenting anything that moves. In Proceedings of the IEEE International Conference on Computer Vision Workshops. Faktor and Irani (2014) Faktor, A. and M. Irani 2014. Video segmentation by non-local consensus voting. In Proceedings of the British Machine Vision Conference. Fragkiadaki et al. (2012) Fragkiadaki, K., G. Zhang, and J. Shi 2012. Video segmentation by tracing discontinuities in a trajectory embedding. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Gordon et al. (2019) Gordon, A., H. Li, R. Jonschkowski, and A. Angelova 2019. Depth from videos in the wild: Unsupervised monocular depth learning from unknown cameras. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pp. 8977–8986. Horn (1999) Horn, B.K. 1999. Projective geometry considered harmful. Unpublished Memo . Ilg et al. (2017) Ilg, E., N. Mayer, T. Saikia, M. Keuper, A. Dosovitskiy, and T. Brox 2017. Flownet 2.0: Evolution of optical flow estimation with deep networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Irani and Anandan (1998) Irani, M. and P. Anandan. 1998. A unified approach to moving object detection in 2D and 3D scenes. IEEE Transactions Pattern Analysis and Machine Intelligence 20(6): 577–589 . Jain et al. (2017) Jain, S., B. Xiong, and K. Grauman 2017. FusionSeg: Learning to combine motion and appearance for fully automatic segmention of generic objects in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Jin et al. (2008) Jin, Y., L. Tao, H. Di, N.I. Rao, and G. Xu 2008. Background modeling from a free-moving camera by multi-layer homography algorithm. In Proceedings of the IEEE International Conference on Image Processing. Ke and Kanade (2002) Ke, Q. and T. Kanade 2002. A robust subspace approach to layer extraction. In Workshop on Motion and Video Computing. IEEE. Keuper (2017) Keuper, M. 2017. Higher-order minimum cost lifted multicuts for motion segmentation. In Proceedings of the IEEE International Conference on Computer Vision. Keuper et al. (2015) Keuper, M., B. Andres, and T. Brox 2015. Motion trajectory segmentation via minimum cost multicuts. In Proceedings of the IEEE International Conference on Computer Vision. Koh and Kim (2017) Koh, Y.J. and C.S. Kim 2017. Primary object segmentation in videos based on region augmentation and reduction. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lai et al. (2020) Lai, Z., E. Lu, and W. Xie 2020. Mast: A memory-augmented self-supervised tracker. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lamdouar et al. (2021) Lamdouar, H., W. Xie, and A. Zisserman 2021. Segmenting invisible moving objects. In British Machine Vision Conference. Lamdouar et al. (2020) Lamdouar, H., C. Yang, W. Xie, and A. Zisserman 2020. Betrayed by motion: Camouflaged object discovery via motion segmentation. In Proceedings of the Asian Conference on Computer Vision. Lezama et al. (2011) Lezama, J., K. Alahari, J. Sivic, and I. Laptev 2011. Track to the future: Spatio-temporal video segmentation with long-range motion cues. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Longuet-Higgins et al. (1980) Longuet-Higgins, H.C., K. Prazdny, et al. 1980. The interpretation of a moving retinal image. Proceedings of the Royal Society of London. Series B, Biological sciences 208(1173): 385–397 . Lu et al. (2019a) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019a. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lu et al. (2019b) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019b. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Mahadevan et al. (2020) Mahadevan, S., A. Athar, A. Ošep, S. Hennen, L. Leal-Taixé, and B. Leibe 2020. Making a case for 3d convolutions for object segmentation in videos. In Proceedings of the British Machine Vision Conference. Mayer et al. (2016) Mayer, N., E. Ilg, P. Hausser, P. Fischer, D. Cremers, A. Dosovitskiy, and T. Brox 2016. A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Narayana et al. (2013) Narayana, M., A. Hanson, and E. Learned-Miller 2013. Coherent motion segmentation in moving camera videos using optical flow orientations. In Proceedings of the IEEE International Conference on Computer Vision. Ochs and Brox (2011) Ochs, P. and T. Brox 2011. Object segmentation in video: A hierarchical variational approach for turning point trajectories into dense regions. In Proceedings of the IEEE International Conference on Computer Vision. IEEE. Ogale et al. (2005) Ogale, A.S., C. Fermüller, and Y. Aloimonos. 2005. Motion segmentation using occlusions. IEEE Transactions Pattern Analysis and Machine Intelligence 27(6): 988–992 . Papazoglou and Ferrari (2013) Papazoglou, A. and V. Ferrari 2013. Fast object segmentation in unconstrained video. In Proceedings of the IEEE International Conference on Computer Vision. Perazzi et al. (2016) Perazzi, F., J. Pont-Tuset, B. McWilliams, L. Van Gool, M. Gross, and A. Sorkine-Hornung 2016. A benchmark dataset and evaluation methodology for video object segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Pirenne (1952) Pirenne, M.H. 1952. The scientific basis of Leonardo da Vinci’s theory of perspective. The British Journal for the Philosophy of Science 3(10): 169–185 . Ranjan et al. (2019) Ranjan, A., V. Jampani, L. Balles, K. Kim, D. Sun, J. Wulff, and M.J. Black 2019. Competitive collaboration: Joint unsupervised learning of depth, camera motion, optical flow and motion segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Shen et al. (2018) Shen, J., J. Peng, and L. Shao. 2018. Submodular trajectories for better motion segmentation in videos. IEEE Transactions on Image Processing 27(6): 2688–2700 . Sun et al. (2010) Sun, D., S. Roth, and M.J. Black 2010. Secrets of optical flow estimation and their principles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 ."]}, {"table": "<table><thead><tr><th>trained with…</th><th>tested with…</th><th>angle+magnitude</th></tr></thead><tbody><tr><td>gt flow</td><td>gt flow</td><td>90.68</td></tr><tr><td>gt t-flow</td><td>gt t-flow</td><td> 93.23</td></tr><tr><td>PWC flow</td><td>PWC flow</td><td>77.18</td></tr><tr><td>PWC t-flow</td><td>PWC t-flow</td><td>78.69</td></tr></tbody></table>", "caption": "Table 4: Ablation study: Network variants. We trained four networks using flow angle and magnitude with: the provided ground truth optical flow of FT3D (Mayer et al., 2016) (gt flow), ground truth optical flow after subtracting ground truth camera rotation (gt t-flow), estimated optical flow using (Sunet al., 2018) (PWC flow), and estimated optical flow after subtracting ground truth camera rotation (PWC t-flow). Segmentation accuracy is measured on the FT3D test set with intersection over union (IoU) scores.", "list_citation_info": ["Mayer et al. (2016) Mayer, N., E. Ilg, P. Hausser, P. Fischer, D. Cremers, A. Dosovitskiy, and T. Brox 2016. A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Narayana et al. (2013) Narayana, M., A. Hanson, and E. Learned-Miller 2013. Coherent motion segmentation in moving camera videos using optical flow orientations. In Proceedings of the IEEE International Conference on Computer Vision. Ochs and Brox (2011) Ochs, P. and T. Brox 2011. Object segmentation in video: A hierarchical variational approach for turning point trajectories into dense regions. In Proceedings of the IEEE International Conference on Computer Vision. IEEE. Ogale et al. (2005) Ogale, A.S., C. Fermüller, and Y. Aloimonos. 2005. Motion segmentation using occlusions. IEEE Transactions Pattern Analysis and Machine Intelligence 27(6): 988–992 . Papazoglou and Ferrari (2013) Papazoglou, A. and V. Ferrari 2013. Fast object segmentation in unconstrained video. In Proceedings of the IEEE International Conference on Computer Vision. Perazzi et al. (2016) Perazzi, F., J. Pont-Tuset, B. McWilliams, L. Van Gool, M. Gross, and A. Sorkine-Hornung 2016. A benchmark dataset and evaluation methodology for video object segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Pirenne (1952) Pirenne, M.H. 1952. The scientific basis of Leonardo da Vinci’s theory of perspective. The British Journal for the Philosophy of Science 3(10): 169–185 . Ranjan et al. (2019) Ranjan, A., V. Jampani, L. Balles, K. Kim, D. Sun, J. Wulff, and M.J. Black 2019. Competitive collaboration: Joint unsupervised learning of depth, camera motion, optical flow and motion segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Shen et al. (2018) Shen, J., J. Peng, and L. Shao. 2018. Submodular trajectories for better motion segmentation in videos. IEEE Transactions on Image Processing 27(6): 2688–2700 . Sun et al. (2010) Sun, D., S. Roth, and M.J. Black 2010. Secrets of optical flow estimation and their principles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 .", "Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 ."]}], "citation_info_to_title": {"Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 .": "Learning to Segment Rigid Motions from Two Frames", "Mayer et al. (2016) Mayer, N., E. Ilg, P. Hausser, P. Fischer, D. Cremers, A. Dosovitskiy, and T. Brox 2016. A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Narayana et al. (2013) Narayana, M., A. Hanson, and E. Learned-Miller 2013. Coherent motion segmentation in moving camera videos using optical flow orientations. In Proceedings of the IEEE International Conference on Computer Vision. Ochs and Brox (2011) Ochs, P. and T. Brox 2011. Object segmentation in video: A hierarchical variational approach for turning point trajectories into dense regions. In Proceedings of the IEEE International Conference on Computer Vision. IEEE. Ogale et al. (2005) Ogale, A.S., C. Fermüller, and Y. Aloimonos. 2005. Motion segmentation using occlusions. IEEE Transactions Pattern Analysis and Machine Intelligence 27(6): 988–992 . Papazoglou and Ferrari (2013) Papazoglou, A. and V. Ferrari 2013. Fast object segmentation in unconstrained video. In Proceedings of the IEEE International Conference on Computer Vision. Perazzi et al. (2016) Perazzi, F., J. Pont-Tuset, B. McWilliams, L. Van Gool, M. Gross, and A. Sorkine-Hornung 2016. A benchmark dataset and evaluation methodology for video object segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Pirenne (1952) Pirenne, M.H. 1952. The scientific basis of Leonardo da Vinci’s theory of perspective. The British Journal for the Philosophy of Science 3(10): 169–185 . Ranjan et al. (2019) Ranjan, A., V. Jampani, L. Balles, K. Kim, D. Sun, J. Wulff, and M.J. Black 2019. Competitive collaboration: Joint unsupervised learning of depth, camera motion, optical flow and motion segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Shen et al. (2018) Shen, J., J. Peng, and L. Shao. 2018. Submodular trajectories for better motion segmentation in videos. IEEE Transactions on Image Processing 27(6): 2688–2700 . Sun et al. (2010) Sun, D., S. Roth, and M.J. Black 2010. Secrets of optical flow estimation and their principles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 .": "A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation", "Cheng et al. (2017a) Cheng, J., Y.H. Tsai, S. Wang, and M.H. Yang 2017a. Segflow: Joint learning for video object segmentation and optical flow. In Proceedings of the IEEE International Conference on Computer Vision. Cheng et al. (2017b) Cheng, J., Y.H. Tsai, S. Wang, and M.H. Yang 2017b. SegFlow: Joint learning for video object segmentation and optical flow. In Proceedings of the IEEE International Conference on Computer Vision. Dave et al. (2019) Dave, A., P. Tokmakov, and D. Ramanan 2019. Towards segmenting anything that moves. In Proceedings of the IEEE International Conference on Computer Vision Workshops. Faktor and Irani (2014) Faktor, A. and M. Irani 2014. Video segmentation by non-local consensus voting. In Proceedings of the British Machine Vision Conference. Fragkiadaki et al. (2012) Fragkiadaki, K., G. Zhang, and J. Shi 2012. Video segmentation by tracing discontinuities in a trajectory embedding. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Gordon et al. (2019) Gordon, A., H. Li, R. Jonschkowski, and A. Angelova 2019. Depth from videos in the wild: Unsupervised monocular depth learning from unknown cameras. In Proceedings of the IEEE/CVF International Conference on Computer Vision, pp. 8977–8986. Horn (1999) Horn, B.K. 1999. Projective geometry considered harmful. Unpublished Memo . Ilg et al. (2017) Ilg, E., N. Mayer, T. Saikia, M. Keuper, A. Dosovitskiy, and T. Brox 2017. Flownet 2.0: Evolution of optical flow estimation with deep networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Irani and Anandan (1998) Irani, M. and P. Anandan. 1998. A unified approach to moving object detection in 2D and 3D scenes. IEEE Transactions Pattern Analysis and Machine Intelligence 20(6): 577–589 . Jain et al. (2017) Jain, S., B. Xiong, and K. Grauman 2017. FusionSeg: Learning to combine motion and appearance for fully automatic segmention of generic objects in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Jin et al. (2008) Jin, Y., L. Tao, H. Di, N.I. Rao, and G. Xu 2008. Background modeling from a free-moving camera by multi-layer homography algorithm. In Proceedings of the IEEE International Conference on Image Processing. Ke and Kanade (2002) Ke, Q. and T. Kanade 2002. A robust subspace approach to layer extraction. In Workshop on Motion and Video Computing. IEEE. Keuper (2017) Keuper, M. 2017. Higher-order minimum cost lifted multicuts for motion segmentation. In Proceedings of the IEEE International Conference on Computer Vision. Keuper et al. (2015) Keuper, M., B. Andres, and T. Brox 2015. Motion trajectory segmentation via minimum cost multicuts. In Proceedings of the IEEE International Conference on Computer Vision. Koh and Kim (2017) Koh, Y.J. and C.S. Kim 2017. Primary object segmentation in videos based on region augmentation and reduction. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lai et al. (2020) Lai, Z., E. Lu, and W. Xie 2020. Mast: A memory-augmented self-supervised tracker. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lamdouar et al. (2021) Lamdouar, H., W. Xie, and A. Zisserman 2021. Segmenting invisible moving objects. In British Machine Vision Conference. Lamdouar et al. (2020) Lamdouar, H., C. Yang, W. Xie, and A. Zisserman 2020. Betrayed by motion: Camouflaged object discovery via motion segmentation. In Proceedings of the Asian Conference on Computer Vision. Lezama et al. (2011) Lezama, J., K. Alahari, J. Sivic, and I. Laptev 2011. Track to the future: Spatio-temporal video segmentation with long-range motion cues. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Longuet-Higgins et al. (1980) Longuet-Higgins, H.C., K. Prazdny, et al. 1980. The interpretation of a moving retinal image. Proceedings of the Royal Society of London. Series B, Biological sciences 208(1173): 385–397 . Lu et al. (2019a) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019a. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lu et al. (2019b) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019b. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Mahadevan et al. (2020) Mahadevan, S., A. Athar, A. Ošep, S. Hennen, L. Leal-Taixé, and B. Leibe 2020. Making a case for 3d convolutions for object segmentation in videos. In Proceedings of the British Machine Vision Conference. Mayer et al. (2016) Mayer, N., E. Ilg, P. Hausser, P. Fischer, D. Cremers, A. Dosovitskiy, and T. Brox 2016. A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Narayana et al. (2013) Narayana, M., A. Hanson, and E. Learned-Miller 2013. Coherent motion segmentation in moving camera videos using optical flow orientations. In Proceedings of the IEEE International Conference on Computer Vision. Ochs and Brox (2011) Ochs, P. and T. Brox 2011. Object segmentation in video: A hierarchical variational approach for turning point trajectories into dense regions. In Proceedings of the IEEE International Conference on Computer Vision. IEEE. Ogale et al. (2005) Ogale, A.S., C. Fermüller, and Y. Aloimonos. 2005. Motion segmentation using occlusions. IEEE Transactions Pattern Analysis and Machine Intelligence 27(6): 988–992 . Papazoglou and Ferrari (2013) Papazoglou, A. and V. Ferrari 2013. Fast object segmentation in unconstrained video. In Proceedings of the IEEE International Conference on Computer Vision. Perazzi et al. (2016) Perazzi, F., J. Pont-Tuset, B. McWilliams, L. Van Gool, M. Gross, and A. Sorkine-Hornung 2016. A benchmark dataset and evaluation methodology for video object segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Pirenne (1952) Pirenne, M.H. 1952. The scientific basis of Leonardo da Vinci’s theory of perspective. The British Journal for the Philosophy of Science 3(10): 169–185 . Ranjan et al. (2019) Ranjan, A., V. Jampani, L. Balles, K. Kim, D. Sun, J. Wulff, and M.J. Black 2019. Competitive collaboration: Joint unsupervised learning of depth, camera motion, optical flow and motion segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Shen et al. (2018) Shen, J., J. Peng, and L. Shao. 2018. Submodular trajectories for better motion segmentation in videos. IEEE Transactions on Image Processing 27(6): 2688–2700 . Sun et al. (2010) Sun, D., S. Roth, and M.J. Black 2010. Secrets of optical flow estimation and their principles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 .": "Video Object Segmentation: A Collection of Recent Advances", "Lamdouar et al. (2021) Lamdouar, H., W. Xie, and A. Zisserman 2021. Segmenting invisible moving objects. In British Machine Vision Conference. Lamdouar et al. (2020) Lamdouar, H., C. Yang, W. Xie, and A. Zisserman 2020. Betrayed by motion: Camouflaged object discovery via motion segmentation. In Proceedings of the Asian Conference on Computer Vision. Lezama et al. (2011) Lezama, J., K. Alahari, J. Sivic, and I. Laptev 2011. Track to the future: Spatio-temporal video segmentation with long-range motion cues. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Longuet-Higgins et al. (1980) Longuet-Higgins, H.C., K. Prazdny, et al. 1980. The interpretation of a moving retinal image. Proceedings of the Royal Society of London. Series B, Biological sciences 208(1173): 385–397 . Lu et al. (2019a) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019a. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Lu et al. (2019b) Lu, X., W. Wang, C. Ma, J. Shen, L. Shao, and F. Porikli 2019b. See more, know more: Unsupervised video object segmentation with co-attention siamese networks. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). Mahadevan et al. (2020) Mahadevan, S., A. Athar, A. Ošep, S. Hennen, L. Leal-Taixé, and B. Leibe 2020. Making a case for 3d convolutions for object segmentation in videos. In Proceedings of the British Machine Vision Conference. Mayer et al. (2016) Mayer, N., E. Ilg, P. Hausser, P. Fischer, D. Cremers, A. Dosovitskiy, and T. Brox 2016. A large dataset to train convolutional networks for disparity, optical flow, and scene flow estimation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Narayana et al. (2013) Narayana, M., A. Hanson, and E. Learned-Miller 2013. Coherent motion segmentation in moving camera videos using optical flow orientations. In Proceedings of the IEEE International Conference on Computer Vision. Ochs and Brox (2011) Ochs, P. and T. Brox 2011. Object segmentation in video: A hierarchical variational approach for turning point trajectories into dense regions. In Proceedings of the IEEE International Conference on Computer Vision. IEEE. Ogale et al. (2005) Ogale, A.S., C. Fermüller, and Y. Aloimonos. 2005. Motion segmentation using occlusions. IEEE Transactions Pattern Analysis and Machine Intelligence 27(6): 988–992 . Papazoglou and Ferrari (2013) Papazoglou, A. and V. Ferrari 2013. Fast object segmentation in unconstrained video. In Proceedings of the IEEE International Conference on Computer Vision. Perazzi et al. (2016) Perazzi, F., J. Pont-Tuset, B. McWilliams, L. Van Gool, M. Gross, and A. Sorkine-Hornung 2016. A benchmark dataset and evaluation methodology for video object segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Pirenne (1952) Pirenne, M.H. 1952. The scientific basis of Leonardo da Vinci’s theory of perspective. The British Journal for the Philosophy of Science 3(10): 169–185 . Ranjan et al. (2019) Ranjan, A., V. Jampani, L. Balles, K. Kim, D. Sun, J. Wulff, and M.J. Black 2019. Competitive collaboration: Joint unsupervised learning of depth, camera motion, optical flow and motion segmentation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Shen et al. (2018) Shen, J., J. Peng, and L. Shao. 2018. Submodular trajectories for better motion segmentation in videos. IEEE Transactions on Image Processing 27(6): 2688–2700 . Sun et al. (2010) Sun, D., S. Roth, and M.J. Black 2010. Secrets of optical flow estimation and their principles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Sun et al. (2018) Sun, D., X. Yang, M.Y. Liu, and J. Kautz 2018. PWC-Net: CNNs for optical flow using pyramid, warping, and cost volume. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Taylor et al. (2015) Taylor, B., V. Karasev, and S. Soatto 2015. Causal video object segmentation from persistence of occlusions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017a) Tokmakov, P., K. Alahari, and C. Schmid 2017a. Learning motion patterns in videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Tokmakov et al. (2017b) Tokmakov, P., K. Alahari, and C. Schmid 2017b. Learning video object segmentation with visual memory. In Proceedings of the IEEE International Conference on Computer Vision. Torr (1998) Torr, P.H. 1998. Geometric motion segmentation and model selection. Philosophical Transactions of the Royal Society of London A: Mathematical, Physical and Engineering Sciences 356(1740): 1321–1340 . Tung et al. (2019) Tung, H.Y.F., R. Cheng, and K. Fragkiadaki 2019. Learning spatial common sense with geometry-aware recurrent networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Vertens et al. (2017) Vertens, J., A. Valada, and W. Burgard 2017. SMSnet: Semantic motion segmentation using deep convolutional neural networks. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems. Vidal and Ma (2004) Vidal, R. and Y. Ma 2004. A unified algebraic approach to 2-D and 3-D motion segmentation. In Proceedings of the European Conference on Computer Vision. Vidal et al. (2002) Vidal, R., S. Soatto, Y. Ma, and S. Sastry 2002. Segmentation of dynamic scenes from the multibody fundamental matrix. In Proceedings of the European Conference on Computer Vision Workshops. Walls (1962) Walls, G. 1962. The evolutionary history of eye movements. Vision Research 2(1-4): 69–80 . Wang and Adelson (1994) Wang, J.Y. and E.H. Adelson. 1994. Representing moving images with layers. IEEE Trans. Image Processing 3(5): 625–638 . Wulff et al. (2012) Wulff, J., D.J. Butler, G.B. Stanley, and M.J. Black 2012. Lessons and insights from creating a synthetic optical flow benchmark. In Proceedings of the European Conference on Computer Vision Workshops. Xiao and Shah (2005) Xiao, J. and M. Shah. 2005. Motion layer extraction in the presence of occlusion using graph cuts. IEEE Transactions Pattern Analysis and Machine Intelligence 27(10): 1644–1659 . Xu et al. (2018) Xu, X., L. Fah Cheong, and Z. Li 2018. Motion segmentation by exploiting complementary geometric models. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yan and Pollefeys (2006) Yan, J. and M. Pollefeys 2006. A general framework for motion segmentation: Independent, articulated, rigid, non-rigid, degenerate and non-degenerate. In Proceedings of the European Conference on Computer Vision. Yang et al. (2021) Yang, C., H. Lamdouar, E. Lu, A. Zisserman, and W. Xie 2021. Self-supervised video object segmentation by motion grouping. In Proceedings of the IEEE International Conference on Computer Vision. Yang and Ramanan (2021) Yang, G. and D. Ramanan 2021. Learning to segment rigid motions from two frames. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Yang et al. (2019) Yang, Y., A. Loquercio, D. Scaramuzza, and S. Soatto 2019. Unsupervised moving object detection via contextual information separation. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. Zamalieva and Yilmaz (2014) Zamalieva, D. and A. Yilmaz. 2014. Background subtraction for the moving camera: A geometric approach. Computer Vision and Image Understanding 127: 73–85 . Zhang et al. (2007) Zhang, G., J. Jia, W. Xiong, T.T. Wong, P.A. Heng, and H. Bao 2007. Moving object extraction with a hand-held camera. In Proceedings of the IEEE International Conference on Computer Vision. Zhou et al. (2020) Zhou, T., J. Li, S. Wang, R. Tao, and J. Shen. 2020. Matnet: Motion-attentive transition network for zero-shot video object segmentation. IEEE Transactions on Image Processing 29: 8326–8338 .": "Segmenting invisible moving objects"}, "source_title_to_arxiv_id": {"Learning to Segment Rigid Motions from Two Frames": "2101.03694"}}