{"title": "MultiPathGAN: Structure Preserving Stain Normalization using Unsupervised Multi-domain Adversarial Network with Perception Loss", "abstract": "Histopathology relies on the analysis of microscopic tissue images to\ndiagnose disease. A crucial part of tissue preparation is staining whereby a\ndye is used to make the salient tissue components more distinguishable.\nHowever, differences in laboratory protocols and scanning devices result in\nsignificant confounding appearance variation in the corresponding images. This\nvariation increases both human error and the inter-rater variability, as well\nas hinders the performance of automatic or semi-automatic methods. In the\npresent paper we introduce an unsupervised adversarial network to translate\n(and hence normalize) whole slide images across multiple data acquisition\ndomains. Our key contributions are: (i) an adversarial architecture which\nlearns across multiple domains with a single generator-discriminator network\nusing an information flow branch which optimizes for perceptual loss, and (ii)\nthe inclusion of an additional feature extraction network during training which\nguides the transformation network to keep all the structural features in the\ntissue image intact. We: (i) demonstrate the effectiveness of the proposed\nmethod firstly on H\\&E slides of 120 cases of kidney cancer, as well as (ii)\nshow the benefits of the approach on more general problems, such as flexible\nillumination based natural image enhancement and light source adaptation.", "authors": ["Haseeb Nazki", "Ognjen Arandjelović", "InHwa Um", "David Harrison"], "published_date": "2022_04_20", "pdf_url": "http://arxiv.org/pdf/2204.09782v2", "list_table_and_caption": [{"table": "<table><tbody><tr><th>Method</th><td>PSNR</td><td>SSIM</td><td>MS-SSIM</td><td>HaarPSI</td></tr><tr><th>Runz et al. (Runz et al., 2021)</th><td>21.16</td><td>0.80</td><td>0.92</td><td>0.77</td></tr><tr><th>Mahapatra et al. (Mahapatra et al., 2020)</th><td>21.96</td><td>0.93</td><td>0.96</td><td>0.88</td></tr><tr><th>Vasiljevic et al. (Vasiljević et al., 2021)</th><td>14.73</td><td>-0.20</td><td>0.01</td><td>0.53</td></tr><tr><th>Choi et al. (Choi et al., 2020)</th><td>16.19</td><td>0.20</td><td>0.15</td><td>0.38</td></tr><tr><th>Wagner et al. (Wagner et al., 2021)</th><td>18.92</td><td>0.58</td><td>0.64</td><td>0.55</td></tr><tr><th>MuliPathGAN (Ours)</th><td>22.96</td><td>0.96</td><td>0.98</td><td>0.93</td></tr></tbody></table>", "caption": "Table 1. Comparison with previous methods. We calculate PSNR, SSIM, MS-SSIM and HaarPSI between the test set of Hamamatsu-HT patches and Hamamatsu-HT \\rightarrow Hamamatsu-S60 translations.", "list_citation_info": ["Mahapatra et al. (2020) Dwarikanath Mahapatra, Behzad Bozorgtabar, Jean-Philippe Thiran, and Ling Shao. 2020. Structure preserving stain normalization of histopathology images using self supervised semantic guidance. In International Conference on Medical Image Computing and Computer-Assisted Intervention. Springer, 309–319.", "Runz et al. (2021) Marlen Runz, Daniel Rusche, Stefan Schmidt, Martin R Weihrauch, Jürgen Hesser, and Cleo-Aron Weis. 2021. Normalization of HE-stained histological images using cycle consistent generative adversarial networks. Diagnostic Pathology 16, 1 (2021), 1–10.", "Choi et al. (2020) Yunjey Choi, Youngjung Uh, Jaejun Yoo, and Jung-Woo Ha. 2020. Stargan v2: Diverse image synthesis for multiple domains. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 8188–8197.", "Vasiljević et al. (2021) Jelica Vasiljević, Friedrich Feuerhake, Cédric Wemmert, and Thomas Lampert. 2021. Towards histopathological stain invariance by unsupervised domain augmentation using generative adversarial networks. Neurocomputing 460 (2021), 277–291.", "Wagner et al. (2021) Sophia J Wagner, Nadieh Khalili, Raghav Sharma, Melanie Boxberg, Carsten Marr, Walter de Back, and Tingying Peng. 2021. Structure-preserving multi-domain stain color augmentation using style-transfer with disentangled representations. In International Conference on Medical Image Computing and Computer-Assisted Intervention. Springer, 257–266."]}], "citation_info_to_title": {"Vasiljević et al. (2021) Jelica Vasiljević, Friedrich Feuerhake, Cédric Wemmert, and Thomas Lampert. 2021. Towards histopathological stain invariance by unsupervised domain augmentation using generative adversarial networks. Neurocomputing 460 (2021), 277–291.": "Towards histopathological stain invariance by unsupervised domain augmentation using generative adversarial networks", "Choi et al. (2020) Yunjey Choi, Youngjung Uh, Jaejun Yoo, and Jung-Woo Ha. 2020. Stargan v2: Diverse image synthesis for multiple domains. In Proceedings of the IEEE/CVF conference on computer vision and pattern recognition. 8188–8197.": "StarGAN v2: Diverse Image Synthesis for Multiple Domains", "Wagner et al. (2021) Sophia J Wagner, Nadieh Khalili, Raghav Sharma, Melanie Boxberg, Carsten Marr, Walter de Back, and Tingying Peng. 2021. Structure-preserving multi-domain stain color augmentation using style-transfer with disentangled representations. In International Conference on Medical Image Computing and Computer-Assisted Intervention. Springer, 257–266.": "Structure-Preserving Multi-Domain Stain Color Augmentation Using Style-Transfer with Disentangled Representations", "Runz et al. (2021) Marlen Runz, Daniel Rusche, Stefan Schmidt, Martin R Weihrauch, Jürgen Hesser, and Cleo-Aron Weis. 2021. Normalization of HE-stained histological images using cycle consistent generative adversarial networks. Diagnostic Pathology 16, 1 (2021), 1–10.": "Normalization of HE-stained histological images using cycle consistent generative adversarial networks", "Mahapatra et al. (2020) Dwarikanath Mahapatra, Behzad Bozorgtabar, Jean-Philippe Thiran, and Ling Shao. 2020. Structure preserving stain normalization of histopathology images using self supervised semantic guidance. In International Conference on Medical Image Computing and Computer-Assisted Intervention. Springer, 309–319.": "Structure preserving stain normalization of histopathology images using self supervised semantic guidance"}, "source_title_to_arxiv_id": {"StarGAN v2: Diverse Image Synthesis for Multiple Domains": "1912.01865", "Structure-Preserving Multi-Domain Stain Color Augmentation Using Style-Transfer with Disentangled Representations": "2107.12357"}}