{"title": "Computer Vision for Road Imaging and Pothole Detection: A State-of-the-Art Review of Systems and Algorithms", "abstract": "Computer vision algorithms have been prevalently utilized for 3-D road\nimaging and pothole detection for over two decades. Nonetheless, there is a\nlack of systematic survey articles on state-of-the-art (SoTA) computer vision\ntechniques, especially deep learning models, developed to tackle these\nproblems. This article first introduces the sensing systems employed for 2-D\nand 3-D road data acquisition, including camera(s), laser scanners, and\nMicrosoft Kinect. Afterward, it thoroughly and comprehensively reviews the SoTA\ncomputer vision algorithms, including (1) classical 2-D image processing, (2)\n3-D point cloud modeling and segmentation, and (3) machine/deep learning,\ndeveloped for road pothole detection. This article also discusses the existing\nchallenges and future development trends of computer vision-based road pothole\ndetection approaches: classical 2-D image processing-based and 3-D point cloud\nmodeling and segmentation-based approaches have already become history; and\nConvolutional neural networks (CNNs) have demonstrated compelling road pothole\ndetection results and are promising to break the bottleneck with the future\nadvances in self/un-supervised learning for multi-modal semantic segmentation.\nWe believe that this survey can serve as practical guidance for developing the\nnext-generation road condition assessment systems.", "authors": ["Nachuan Ma", "Jiahe Fan", "Wenshuo Wang", "Jin Wu", "Yu Jiang", "Lihua Xie", "Rui Fan"], "published_date": "2022_04_28", "pdf_url": "http://arxiv.org/pdf/2204.13590v1", "list_table_and_caption": [{"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Details</p></td></tr><tr><td><p>Koch and Brilakis [14] (2011)</p></td><td><p>Color image</p></td><td><p>A road image is segmented into damaged and undamaged road regions using a histogram-based thresholding method. The damaged road areas are processed with morphological operations and elliptic regression. The road potholes are detected by comparing the road textures inside and outside the ellipse.</p></td></tr><tr><td><p>Buza et al. [37] (2013)</p></td><td><p>Color image</p></td><td><p>Otsu’s thresholding method is adopted to segment road images. Spectral clustering is utilized to extract damaged road areas (potholes).</p></td></tr><tr><td><p>Ryu et al. [38] (2015)</p></td><td><p>Color image</p></td><td><p>Road images are processed with morphological filters and segmented using a histogram-based thresholding method. A potential road pothole contour is extracted based on geometric properties. An ordered histogram intersection method is used to determine whether the extracted area contains a road pothole.</p></td></tr><tr><td><p>Schiopu et al. [39] (2016)</p></td><td><p>Color image</p></td><td><p>A histogram-based thresholding method is utilized to generate a set of road pothole candidates. The candidates with specific geometric properties are determined to be road potholes.</p></td></tr><tr><td><p>Jakštys et al. [40] (2016)</p></td><td><p>Color image</p></td><td><p>Triangle thresholding and adaptive thresholding methods are used to segment road images. A heuristic edge detection approach is designed for road pothole contour extraction.</p></td></tr><tr><td><p>Akagic et al. [41] (2017)</p></td><td><p>Color image</p></td><td><p>Road pothole regions of interest (RoIs) are detected by (1) manipulating the B component in the RGB color space and (2) performing two-level dynamic road pixel selection. The search for road potholes is conducted only in the RoIs. The road potholes are detected by comparing two cropped road images based on the method proposed in [37].</p></td></tr><tr><td><p>Wang et al.  [42] (2017)</p></td><td><p>Gray-scale image</p></td><td><p>The wavelet energy field of a road image is constructed to highlight road potholes. Damaged road areas are processed with morphological filters. A Markov random fields-based image segmentation method is used to segment the damaged road areas for pothole detection. Morphological filters are used again to refine the road pothole detection results.</p></td></tr><tr><td><p>Chung and Khan [43] (2019)</p></td><td><p>Gray-scale image</p></td><td><p>Otsu’s thresholding method is used to segment road images. The segmented images are processed with morphological filters before performing distance transform. The watershed algorithm is applied to the distance transform images for road pothole detection.</p></td></tr><tr><td><p>Moazzam et al. [28] (2013)</p></td><td><p>Depth images</p></td><td><p>The road potholes are detected by analyzing road depth distribution w.r.t. different azimuth and elevation angles. The approximate volume of each road pothole is calculated using the trapezoidal rule with unit spacing on the area-depth curves.</p></td></tr><tr><td><p>Fan et al. [6] (2019)</p></td><td><p>Transformed disparity image</p></td><td><p>A dense road disparity image is transformed to better distinguish the damaged and undamaged road areas. The transformed disparity image is segmented using Otus’s thresholding method for road pothole detection.</p></td></tr><tr><td><p>Fan et al. [5] (2021)</p></td><td><p>Transformed disparity image</p></td><td><p>SLIC is utilized to group the transformed disparities into a collection of superpixels. The road potholes are then detected by finding the superpixels, whose values are lower than an adaptively determined threshold.</p></td></tr></table>", "caption": "Table 1: Representative classical 2-D image processing-based approaches.", "list_citation_info": ["[5] Rui Fan et al. Rethinking road surface 3-d reconstruction and pothole detection: From perspective transformation to disparity map segmentation. IEEE Transactions on Cybernetics, DOI:10.1109/TCYB.2021.3060461, 2021.", "[39] Ionut Schiopu et al. Pothole detection and tracking in car video sequence. In 2016 39th International Conference on Telecommunications and Signal Processing (TSP), pages 701–706. IEEE, 2016.", "[37] Emir Buza et al. Pothole detection with image processing and spectral clustering. In Proceedings of the 2nd International Conference on Information Technology and Computer Networks, volume 810, page 4853, 2013.", "[14] Christian Koch and Ioannis Brilakis. Pothole detection in asphalt pavement images. Advanced Engineering Informatics, 25(3):507–515, 2011.", "[40] Vytautas Jakštys et al. Detection of the road pothole contour in raster images. Information Technology and Control, 45(3):300–307, 2016.", "[43] Tran Duc Chung and MKA Ahamed Khan. Watershed-based real-time image processing for multi-potholes detection on asphalt road. In 2019 IEEE 9th International Conference on System Engineering and Technology (ICSET), pages 268–272. IEEE, 2019.", "[42] Penghui Wang et al. Asphalt pavement pothole detection and segmentation based on wavelet energy field. Mathematical Problems in Engineering, 2017, 2017.", "[28] Imran Moazzam et al. Metrology and visualization of potholes using the microsoft kinect sensor. In 16th International IEEE Conference on Intelligent Transportation Systems (ITSC), pages 1284–1291. IEEE, 2013.", "[41] Amila Akagic et al. Pothole detection: An efficient vision based method using rgb color space image segmentation. In 2017 40th International Convention on Information and Communication Technology, Electronics and Microelectronics (MIPRO), pages 1104–1109. IEEE, 2017.", "[38] Seung-Ki Ryu et al. Feature-based pothole detection in two-dimensional images. Transportation Research Record, 2528(1):9–17, 2015.", "[6] Rui Fan and Ming Liu. Road damage detection based on unsupervised disparity map segmentation. IEEE Transactions on Intelligent Transportation Systems, 21(11):4906–4911, 2019."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Key algorithm(s)</p></td><td><p>Details</p></td></tr><tr><td><p>Zhang and Elaksher [31] (2012)</p></td><td><p>3-D point cloud</p></td><td><p>SfM, BA, 3-D feature extraction</p></td><td><p>Sparse 3-D road geometry models are reconstructed with SfM and refined with BA. Road potholes are detected by finding distinguishable 3-D features.</p></td></tr><tr><td><p>Zhang [34] (2013)</p></td><td><p>3-D point cloud</p></td><td><p>Stereo vision, quadratic surface fitting, connected component labeling (CCL)</p></td><td><p>A quadratic surface is fitted to the observed 3-D road point cloud. The 3-D points under the fitted surface are considered part of road potholes. Different road potholes are labeled using CCL.</p></td></tr><tr><td><p>Li et al. [55] (2018)</p></td><td><p>3-D point cloud</p></td><td><p>Stereo vision, planar surface fitting, bi-square weighted robust least-squares approximation, CCL</p></td><td><p>An observed 3-D road point cloud is interpolated into a planar surface using a bi-square weighted robust least-squares approximation. The 3-D points under the fitted surface are considered to be part of road potholes. CCL is also used to label different road potholes.</p></td></tr><tr><td><p>Du et al. [56] (2020)</p></td><td><p>3-D point cloud</p></td><td><p>Stereo vision, planar surface fitting and segmentation, K-means clustering, region growing</p></td><td><p>The surface normal information is incorporated into the road surface modeling process. K-means clustering and region growing algorithms are used to extract road potholes.</p></td></tr></table>", "caption": "Table 2: Representative 3-D point cloud modeling and segmentation-based approaches.", "list_citation_info": ["[55] Yaqi Li et al. Road pothole detection system based on stereo vision. In NAECON 2018-IEEE National Aerospace and Electronics Conference, pages 292–297. IEEE, 2018.", "[56] Ying Du et al. A pothole detection method based on 3d point cloud segmentation. In Twelfth International Conference on Digital Image Processing (ICDIP 2020), volume 11519, page 1151909. International Society for Optics and Photonics, 2020.", "[34] Zhen Zhang. Advanced stereo vision disparity calculation and obstacle analysis for intelligent vehicles. PhD thesis, University of Bristol, 2013.", "[31] Chunsun Zhang and Ahmed Elaksher. An unmanned aerial vehicle-based imaging system for 3d measurement of unpaved road surface distresses. Computer-Aided Civil and Infrastructure Engineering, 27(2):118–129, 2012."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Key algorithm(s)</p></td><td><p>Details</p></td></tr><tr><td><p>Lin and Liu [16] (2010)</p></td><td><p>Gray-scale image</p></td><td><p>NL-SVM</p></td><td><p>Average gray level, contrast, consistency, entropy, and three-order moments of gray-scale road images are computed to create hand-crafted visual features; An NL-SVM model is trained to learn these features for road image classification.</p></td></tr><tr><td><p>Daniel and Preeja [57] (2014)</p></td><td><p>Gray-scale image</p></td><td><p>SVM</p></td><td><p>Classical image processing algorithms are utilized to reduce road image noise and highlight informative visual features; CCL is then employed to obtain the connected components; The five most prominent components are selected as training samples to train an SVM model for road image classification.</p></td></tr><tr><td><p>Hadjidemetriou et al. [58] (2016)</p></td><td><p>Gray-scale image</p></td><td><p>SVM, DCT, GLCM</p></td><td><p>Road image patches are utilized to generate feature vectors using discrete cosine transform (DCT) [59] and gray-level co-occurrence matrix (GLCM) algorithms [60]. An SVM model is then trained with such feature vectors to realize binary road patch classification.</p></td></tr><tr><td><p>Hoang [61] (2018)</p></td><td><p>Gray-scale image</p></td><td><p>LS-SVM, ANN</p></td><td><p>Classical image processing algorithms are used to generate hand-crafted visual features; A least-squares SVM (LS-SVM) model and an artificial neural network (ANN) model are trained with such hand-crafted visual features to recognize road images containing potholes.</p></td></tr><tr><td><p>Pan et al. [62] (2018)</p></td><td><p>Color image, Multi-spectral image</p></td><td><p>ANN, RF, SVM</p></td><td><p>Spectral, geometric, and textural features are extracted; Three models: ANN, random forest (RF), and SVM, are trained to learn these features for road image classification.</p></td></tr><tr><td><p>Gao et al. [63] (2020)</p></td><td><p>Color image</p></td><td><p>LIBSVM</p></td><td><p>Classical image processing algorithms, including binarization, morphology operations, and integral projection, are used to generate hand-crafted visual features; A model based on the library for SVM (LIBSVM) is trained to detect road potholes and cracks.</p></td></tr><tr><td><p>Pereira et al. [64] (2018)</p></td><td><p>Color image</p></td><td><p>Self-designed DCNN</p></td><td><p>A DCNN, consisting of four convolutional-pooling layers and one FC layer, is developed from scratch to classify road images.</p></td></tr><tr><td><p>An et al. [65] (2018)</p></td><td><p>Color image, gray-scale image</p></td><td><p>Inception, ResNet, and MobileNet</p></td><td><p>Four existing DCNNs are trained to classify color and gray-scale road image patches.</p></td></tr><tr><td><p>Ye et al. [66] (2019)</p></td><td><p>Color image</p></td><td><p>Self-designed DCNN</p></td><td><p>A DCNN containing a pre-pooling layer (used to reduce the characteristics unrelated to road potholes) is designed from scratch to classify road images.</p></td></tr><tr><td><p>Bhatia et al. [67] (2019)</p></td><td><p>Thermal image</p></td><td><p>Self-designed DCNN</p></td><td><p>A DCNN model (with ResNet as the backbone network) is designed to classify thermal road images.</p></td></tr></table>", "caption": "Table 3: Image classification-based approaches.", "list_citation_info": ["[66] Wanli Ye et al. Convolutional neural network for pothole detection in asphalt pavement. Road materials and pavement design, 22(1):42–58, 2021.", "[57] Akhila Daniel and V. Preeja. Automatic road distress detection and analysis. International Journal of Computer Applications, 101(10), 2014.", "[63] Mingxing Gao et al. Detection and segmentation of cement concrete pavement pothole based on image processing technology. Mathematical Problems in Engineering, 2020, 2020.", "[65] Kwang Eun An et al. Detecting a pothole using deep convolutional neural network models for an adaptive shock observing in a vehicle driving. In 2018 IEEE International Conference on Consumer Electronics (ICCE), pages 1–2. IEEE, 2018.", "[16] Jin Lin and Yayu Liu. Potholes detection based on svm in the pavement distress image. In 2010 Ninth International Symposium on Distributed Computing and Applications to Business, Engineering and Science, pages 544–547. IEEE, 2010.", "[60] Robert M Haralick et al. Textural features for image classification. IEEE Transactions on systems, man, and cybernetics, SMC-3(6):610–621, 1973. DOI: 10.1109/TSMC.1973.4309314.", "[64] Vosco Pereira et al. A deep learning-based approach for road pothole detection in timor leste. In 2018 IEEE International Conference on Service Operations and Logistics, and Informatics (SOLI), pages 279–284. IEEE, 2018.", "[67] Yukti Bhatia et al. Convolutional neural networks based potholes detection using thermal imaging. Journal of King Saud University-Computer and Information Sciences, 2019.", "[62] Yifan Pan et al. Detection of asphalt pavement potholes and cracks based on the unmanned aerial vehicle multispectral imagery. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 11(10):3701–3712, 2018.", "[61] Nhat-Duc Hoang. An artificial intelligence method for asphalt pavement pothole detection using least squares support vector machine and neural network with steerable filter-based feature extraction. Advances in Civil Engineering, 2018, 2018.", "[58] Georgios M Hadjidemetriou et al. Automated detection of pavement patches utilizing support vector machine classification. In 2016 18th Mediterranean Electrotechnical Conference (MELECON), pages 1–5. IEEE, 2016.", "[59] Nasir Ahmed et al. Discrete cosine transform. IEEE transactions on Computers, 100(1):90–93, 1974."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Key algorithm(s)</p></td><td><p>Details</p></td></tr><tr><td><p>Suong et al. [89] (2018)</p></td><td><p>Color image</p></td><td><p>YOLO</p></td><td><p>Two object detection networks: F2-Anchor and Den-F2-Anchor, developed based on YOLOv2, are trained to detect potholes in the color road images.</p></td></tr><tr><td><p>Maeda et al. [86] (2018)</p></td><td><p>Color image</p></td><td><p>SSD</p></td><td><p>Two SSD-based DCNNs (with Inception-v2 and MobileNet as the backbone networks, respectively) are trained to detect potholes in color road images.</p></td></tr><tr><td><p>Wang et al. [90] (2018)</p></td><td><p>Color image</p></td><td><p>Faster R-CNN</p></td><td><p>Two Faster R-CNNs (with ResNet-101 and ResNet-152 as the backbone networks, separately) are trained to detect road potholes.</p></td></tr><tr><td><p>Ukhwah et al. [91] (2019)</p></td><td><p>Gray-scale image</p></td><td><p>YOLO</p></td><td><p>YOLOv3, YOLOv3 Tiny, and YOLOv3 SPP are trained to detect potholes in gray-scale road images. YOLOv3 SPP achieves the best overall performance.</p></td></tr><tr><td><p>Dharneeshkar et al. [92] (2020)</p></td><td><p>Color image</p></td><td><p>YOLO</p></td><td><p>YOLOv2, YOLOv3, and YOLOv3 Tiny are trained to detect road potholes. YOLOv3 Tiny achieves the highest mAP, precision, and recall.</p></td></tr><tr><td><p>Baek and Chung [93] (2020)</p></td><td><p>Color image</p></td><td><p>YOLO</p></td><td><p>Two YOLOv1 models are trained to detect cars (background) and road potholes (in the foreground).</p></td></tr><tr><td><p>Kortmann et al. [94] (2020)</p></td><td><p>Color image</p></td><td><p>Faster R-CNN</p></td><td><p>A classifier is first trained to infer the country where the road image was taken. A Faster R-CNN is then trained w.r.t. each country for road crack and pothole detection.</p></td></tr><tr><td><p>Yebes et al. [75] (2020)</p></td><td><p>Color image</p></td><td><p>Faster R-CNN, SSD</p></td><td><p>Three Faster R-CNNs (with Inception-ResNet-v2, Inception-v2, and ResNet-101 as the backbone networks, separately) and one SSD (with MobileNet-v2 as the backbone network) are trained to detect road potholes. Faster R-CNN (with ResNet-101 as the backbone network) achieves the best performance.</p></td></tr><tr><td><p>Gupta et al. [88] (2020)</p></td><td><p>Thermal image</p></td><td><p>SSD</p></td><td><p>Two SSDs (with ResNet-34 and ResNet-50 as the backbone networks, separately) are trained to detect potholes in thermal road images. The latter significantly outperforms the former.</p></td></tr><tr><td><p>Javed et al. [95] (2021)</p></td><td><p>Color image</p></td><td><p>R-CNN, SSD</p></td><td><p>R-CNN and SSD are compared on the road data collected in Bangladesh. They achieve similar road pothole detection performances.</p></td></tr></table>", "caption": "Table 4: Object detection-based approaches.", "list_citation_info": ["[89] Lim Kuoy Suong and Jangwoo Kwon. Detection of potholes using a deep convolutional neural network. J. Univers. Comput. Sci., 24(9):1244–1257, 2018.", "[92] J. Dharneeshkar et al. Deep learning based detection of potholes in indian roads using yolo. In 2020 International Conference on Inventive Computation Technologies (ICICT), pages 381–385. IEEE, 2020.", "[95] Aaquib Javed et al. Pothole detection system using region-based convolutional neural network. In 2021 IEEE 4th International Conference on Computer and Communication Engineering Technology (CCET), pages 6–11. IEEE, 2021.", "[90] Wenzhe Wang et al. Road damage detection and classification with faster r-cnn. In 2018 IEEE international conference on big data (Big data), pages 5220–5223. IEEE, 2018.", "[86] Hiroya Maeda et al. Road damage detection using deep neural networks with images captured through a smartphone. CoRR, 2018.", "[93] Ji-Won Baek and Kyungyong Chung. Pothole classification model using edge detection in road image. Applied Sciences, 10(19):6662, 2020.", "[75] J Javier Yebes et al. Learning to automatically catch potholes in worldwide road scene images. IEEE Intelligent Transportation Systems Magazine, 13(3):192–205, 2020.", "[88] Saksham Gupta et al. Detection and localization of potholes in thermal images using deep neural networks. Multimedia Tools and Applications, 79(35):26265–26284, 2020.", "[91] Ernin Niswatul Ukhwah et al. Asphalt pavement pothole detection using deep learning method based on yolo neural network. In 2019 International Seminar on Intelligent Technology and Its Applications (ISITIA), pages 35–40. IEEE, 2019.", "[94] Felix Kortmann et al. Detecting various road damage types in global countries utilizing faster r-cnn. In 2020 IEEE International Conference on Big Data (Big Data), pages 5563–5571. IEEE, 2020."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Key algorithm(s)</p></td><td><p>Details</p></td></tr><tr><td><p>Pereira et al. [97] (2019)</p></td><td><p>Color image</p></td><td><p>U-Net</p></td><td><p>A conventional U-Net is trained to segment color road images for pothole detection.</p></td></tr><tr><td><p>Chun and Ryu [98] (2019)</p></td><td><p>Color image</p></td><td><p>FCN</p></td><td><p>An FCN is trained to segment color road images; A semi-supervised learning strategy is also employed to produce additional pseudo labels for network fine-tuning.</p></td></tr><tr><td><p>Fan et al. [11] (2020)</p></td><td><p>Color image, transformed disparity image</p></td><td><p>AA, GAN</p></td><td><p>An AA framework and a training set augmentation technique are developed to enhance both single-modal and data-fusion semantic segmentation networks. The developed networks outperform all other SoTA networks.</p></td></tr><tr><td><p>Masihullah et al. [99] (2021)</p></td><td><p>Color image</p></td><td><p>DeepLabv3+</p></td><td><p>An attention-based feature refinement module is incorporated into DeepLabv3+ for road pothole detection; The effectiveness of few-shot learning for road pothole detection is also validated.</p></td></tr><tr><td><p>Fan et al. [100] (2021)</p></td><td><p>Color image, transformed disparity image</p></td><td><p>DeepLabv3+</p></td><td><p>An MSFFM is proposed to refine the learning representations in single-modal semantic segmentation networks for road pothole detection.</p></td></tr><tr><td><p>Fan et al. [44] (2021)</p></td><td><p>Color image, disparity image, transformed disparity image</p></td><td><p>DCNNs with GAL</p></td><td><p>A GNN-inspired GAL is designed; GAL-DeepLabv3+ achieves the best road pothole detection performance over all other SoTA single-modal DCNNs on color images, disparity images, and transformed disparity images.</p></td></tr></table>", "caption": "Table 5: Semantic segmentation-based approaches. ", "list_citation_info": ["[11] Rui Fan et al. We learn better road pothole detection: from attention aggregation to adversarial domain adaptation. In European Conference on Computer Vision Workshops (ECCVW), pages 285–300. Springer, 2020.", "[100] Jiahe Fan et al. Multi-scale feature fusion: Learning better semantic segmentation for road pothole detection. In 2021 IEEE International Conference on Autonomous Systems (ICAS). IEEE, 2021.", "[98] Chanjun Chun and Seung-Ki Ryu. Road surface damage detection using fully convolutional neural networks and semi-supervised learning. Sensors, 19(24):5501, 2019.", "[97] Vosco Pereira et al. Semantic segmentation of paved road and pothole image using u-net architecture. In 2019 International Conference of Advanced Informatics: Concepts, Theory and Applications (ICAICTA), pages 1–4. IEEE, 2019.", "[44] Rui Fan et al. Graph attention layer evolves semantic segmentation for road pothole detection: A benchmark and algorithms. IEEE transactions on image processing, 30:8144–8154, 2021.", "[99] Shaik Masihullah et al. Attention based coupled framework for road and pothole segmentation. In 2020 25th International Conference on Pattern Recognition (ICPR), pages 5812–5819. IEEE, 2021."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Details</p></td></tr><tr><td><p>Joubert et al. [111] (2011)</p></td><td><p>3-D point cloud, color image</p></td><td><p>The keyframes (potentially containing road potholes) are selected using 2-D image processing algorithms; Road potholes in the keyframes are detected by comparing the observed and modeled 3-D road point clouds.</p></td></tr><tr><td><p>Jog et al. [29] (2012)</p></td><td><p>3-D point cloud, color image</p></td><td><p>The road videos are analyzed with 2-D image processing algorithms to produce keyframes; The road videos are also used to reconstruct 3-D road geometry for road pothole detection.</p></td></tr><tr><td><p>Jahanshahi et al. [22] (2013)</p></td><td><p>3-D point cloud, depth image</p></td><td><p>A planar surface is fitted to the depth image; A normalized depth-difference image, reflecting the difference between the observed the fitted depth images, is created;Otsu’s thresholding method is used to segment the normalized depth-difference image for road pothole detection.</p></td></tr><tr><td><p>Fan et al. [3] (2019)</p></td><td><p>3-D point cloud, transformed disparity image</p></td><td><p>A disparity image is transformed into a quasi bird’s eye view. Otsu’s thresholding method is utilized to segment the transformed disparity image to produce the undamaged road areas. The 3-D points in the undamaged road areas are used to interpolate a quadratic surface; Road potholes are detected by comparing the observed and interpolated surfaces.</p></td></tr></table>", "caption": "Table 6: Hybrid approaches.", "list_citation_info": ["[29] G. M. Jog et al. Pothole properties measurement through visual 2d recognition and 3d reconstruction. In Computing in Civil Engineering (2012), pages 553–560. American Society of Civil Engineers (ASCE), 2012.", "[3] Rui Fan et al. Pothole detection based on disparity transformation and road surface modeling. IEEE Transactions on Image Processing, 29:897–908, 2019.", "[111] Deon Joubert et al. Pothole tagging system. th Robotics and Mechatronics Conference of South Africa, CSIR International Conference Centre, Pretoria, pages 23–25, 2011.", "[22] Mohammad R. Jahanshahi et al. Unsupervised approach for autonomous pavement-defect detection and quantification using an inexpensive depth sensor. Journal of Computing in Civil Engineering, 27(6):743–754, 2013."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Details</p></td></tr><tr><td><p>Azhar et al. [112] (2016)</p></td><td><p>Color image</p></td><td><p>HOG features are extracted from road images; An NBC is trained with the HOG features to classify road images. The NGCS method is used to segment road images potentially containing potholes.</p></td></tr><tr><td><p>Yousaf et al. [113] (2018)</p></td><td><p>Color image</p></td><td><p>Road images are classified using the BoW algorithm; The GCS is used to segment the road images that potentially contain potholes.</p></td></tr><tr><td><p>Anand et al. [114] (2018)</p></td><td><p>Color image</p></td><td><p>A SegNet is trained to segment road images for freespace detection; The freespace regions are processed to generate road pothole/crack candidates; A SqueezeNet is trained to determine whether the generated candidates were road potholes or cracks.</p></td></tr></table>", "caption": "((b)) Classical 2-D image processing &amp; machine/deep learning.", "list_citation_info": ["[114] Sukhad Anand et al. Crack-pot: Autonomous road crack and pothole detection. In 2018 Digital Image Computing: Techniques and Applications (DICTA), pages 1–6. IEEE, 2018.", "[112] Kanza Azhar et al. Computer vision based detection and localization of potholes in asphalt pavement images. In 2016 IEEE Canadian Conference on Electrical and Computer Engineering (CCECE), pages 1–5. IEEE, 2016.", "[113] Muhammad Haroon Yousaf et al. Visual analysis of asphalt pavement for detection and localization of potholes. Advanced Engineering Informatics, 38:527–537, 2018."]}, {"table": "<table><tr><td><p>Reference</p></td><td><p>Input</p></td><td><p>Details</p></td></tr><tr><td><p>Dhiman and Klette [115] (2019)</p></td><td><p>3-D point cloud, color image, disparity image</p></td><td><p>Four existing computer vision techniques are compared: (1) single-frame stereo vision-based method; (2) multi-frame vision sensor data fusion-based method; (3) Mask R-CNN trained with transfer learning; and (4) YOLOv2 trained with transfer learning.</p></td></tr><tr><td><p>Wu et al. [116] (2019)</p></td><td><p>3-D point cloud, color image</p></td><td><p>A semantic segmentation network is used to provide initial road pothole detection results; A 3-D point cloud modeling and segmentation algorithm is used to refine such results and calculate the road pothole volumes.</p></td></tr></table>", "caption": "((c)) Machine/deep learning &amp; 3-D point cloud modeling and segmentation.", "list_citation_info": ["[116] Hangbin Wu et al. Road pothole extraction and safety evaluation by integration of point cloud and images derived from mobile mapping sensors. Advanced Engineering Informatics, 42:100936, 2019.", "[115] Amita Dhiman and Reinhard Klette. Pothole detection using computer vision and learning. IEEE Transactions on Intelligent Transportation Systems, 21(8):3536–3550, 2019."]}], "citation_info_to_title": {"[86] Hiroya Maeda et al. Road damage detection using deep neural networks with images captured through a smartphone. CoRR, 2018.": "Road Damage Detection Using Deep Neural Networks with Images Captured Through a Smartphone", "[31] Chunsun Zhang and Ahmed Elaksher. An unmanned aerial vehicle-based imaging system for 3d measurement of unpaved road surface distresses. Computer-Aided Civil and Infrastructure Engineering, 27(2):118–129, 2012.": "An unmanned aerial vehicle-based imaging system for 3d measurement of unpaved road surface distresses", "[56] Ying Du et al. A pothole detection method based on 3d point cloud segmentation. In Twelfth International Conference on Digital Image Processing (ICDIP 2020), volume 11519, page 1151909. International Society for Optics and Photonics, 2020.": "A pothole detection method based on 3d point cloud segmentation", "[60] Robert M Haralick et al. Textural features for image classification. IEEE Transactions on systems, man, and cybernetics, SMC-3(6):610–621, 1973. DOI: 10.1109/TSMC.1973.4309314.": "Textural features for image classification", "[94] Felix Kortmann et al. Detecting various road damage types in global countries utilizing faster r-cnn. In 2020 IEEE International Conference on Big Data (Big Data), pages 5563–5571. IEEE, 2020.": "Detecting Various Road Damage Types in Global Countries Utilizing Faster R-CNN", "[3] Rui Fan et al. Pothole detection based on disparity transformation and road surface modeling. IEEE Transactions on Image Processing, 29:897–908, 2019.": "Pothole detection based on disparity transformation and road surface modeling", "[112] Kanza Azhar et al. Computer vision based detection and localization of potholes in asphalt pavement images. In 2016 IEEE Canadian Conference on Electrical and Computer Engineering (CCECE), pages 1–5. IEEE, 2016.": "Computer vision based detection and localization of potholes in asphalt pavement images", "[28] Imran Moazzam et al. Metrology and visualization of potholes using the microsoft kinect sensor. In 16th International IEEE Conference on Intelligent Transportation Systems (ITSC), pages 1284–1291. IEEE, 2013.": "Metrology and visualization of potholes using the Microsoft Kinect sensor", "[43] Tran Duc Chung and MKA Ahamed Khan. Watershed-based real-time image processing for multi-potholes detection on asphalt road. In 2019 IEEE 9th International Conference on System Engineering and Technology (ICSET), pages 268–272. IEEE, 2019.": "Watershed-based real-time image processing for multi-potholes detection on asphalt road", "[89] Lim Kuoy Suong and Jangwoo Kwon. Detection of potholes using a deep convolutional neural network. J. Univers. Comput. Sci., 24(9):1244–1257, 2018.": "Detection of potholes using a deep convolutional neural network", "[29] G. M. Jog et al. Pothole properties measurement through visual 2d recognition and 3d reconstruction. In Computing in Civil Engineering (2012), pages 553–560. American Society of Civil Engineers (ASCE), 2012.": "Pothole properties measurement through visual 2d recognition and 3d reconstruction", "[40] Vytautas Jakštys et al. Detection of the road pothole contour in raster images. Information Technology and Control, 45(3):300–307, 2016.": "Detection of the road pothole contour in raster images", "[55] Yaqi Li et al. Road pothole detection system based on stereo vision. In NAECON 2018-IEEE National Aerospace and Electronics Conference, pages 292–297. IEEE, 2018.": "Road pothole detection system based on stereo vision", "[61] Nhat-Duc Hoang. An artificial intelligence method for asphalt pavement pothole detection using least squares support vector machine and neural network with steerable filter-based feature extraction. Advances in Civil Engineering, 2018, 2018.": "An artificial intelligence method for asphalt pavement pothole detection using least squares support vector machine and neural network with steerable filter-based feature extraction", "[90] Wenzhe Wang et al. Road damage detection and classification with faster r-cnn. In 2018 IEEE international conference on big data (Big data), pages 5220–5223. IEEE, 2018.": "Road damage detection and classification with faster r-cnn", "[75] J Javier Yebes et al. Learning to automatically catch potholes in worldwide road scene images. IEEE Intelligent Transportation Systems Magazine, 13(3):192–205, 2020.": "Learning to automatically catch potholes in worldwide road scene images", "[66] Wanli Ye et al. Convolutional neural network for pothole detection in asphalt pavement. Road materials and pavement design, 22(1):42–58, 2021.": "Convolutional Neural Network for Pothole Detection in Asphalt Pavement", "[115] Amita Dhiman and Reinhard Klette. Pothole detection using computer vision and learning. IEEE Transactions on Intelligent Transportation Systems, 21(8):3536–3550, 2019.": "Pothole detection using computer vision and learning", "[111] Deon Joubert et al. Pothole tagging system. th Robotics and Mechatronics Conference of South Africa, CSIR International Conference Centre, Pretoria, pages 23–25, 2011.": "Pothole tagging system", "[93] Ji-Won Baek and Kyungyong Chung. Pothole classification model using edge detection in road image. Applied Sciences, 10(19):6662, 2020.": "Pothole classification model using edge detection in road image", "[59] Nasir Ahmed et al. Discrete cosine transform. IEEE transactions on Computers, 100(1):90–93, 1974.": "Discrete cosine transform", "[113] Muhammad Haroon Yousaf et al. Visual analysis of asphalt pavement for detection and localization of potholes. Advanced Engineering Informatics, 38:527–537, 2018.": "Visual analysis of asphalt pavement for detection and localization of potholes", "[63] Mingxing Gao et al. Detection and segmentation of cement concrete pavement pothole based on image processing technology. Mathematical Problems in Engineering, 2020, 2020.": "Detection and Segmentation of Cement Concrete Pavement Pothole Based on Image Processing Technology", "[38] Seung-Ki Ryu et al. Feature-based pothole detection in two-dimensional images. Transportation Research Record, 2528(1):9–17, 2015.": "Feature-based pothole detection in two-dimensional images", "[16] Jin Lin and Yayu Liu. Potholes detection based on svm in the pavement distress image. In 2010 Ninth International Symposium on Distributed Computing and Applications to Business, Engineering and Science, pages 544–547. IEEE, 2010.": "Potholes detection based on SVM in the pavement distress image", "[65] Kwang Eun An et al. Detecting a pothole using deep convolutional neural network models for an adaptive shock observing in a vehicle driving. In 2018 IEEE International Conference on Consumer Electronics (ICCE), pages 1–2. IEEE, 2018.": "Detecting a pothole using deep convolutional neural network models for an adaptive shock observing in a vehicle driving", "[99] Shaik Masihullah et al. Attention based coupled framework for road and pothole segmentation. In 2020 25th International Conference on Pattern Recognition (ICPR), pages 5812–5819. IEEE, 2021.": "Attention based coupled framework for road and pothole segmentation", "[98] Chanjun Chun and Seung-Ki Ryu. Road surface damage detection using fully convolutional neural networks and semi-supervised learning. Sensors, 19(24):5501, 2019.": "Road surface damage detection using fully convolutional neural networks and semi-supervised learning", "[34] Zhen Zhang. Advanced stereo vision disparity calculation and obstacle analysis for intelligent vehicles. PhD thesis, University of Bristol, 2013.": "Advanced stereo vision disparity calculation and obstacle analysis for intelligent vehicles", "[100] Jiahe Fan et al. Multi-scale feature fusion: Learning better semantic segmentation for road pothole detection. In 2021 IEEE International Conference on Autonomous Systems (ICAS). IEEE, 2021.": "Multi-scale feature fusion: Learning better semantic segmentation for road pothole detection", "[42] Penghui Wang et al. Asphalt pavement pothole detection and segmentation based on wavelet energy field. Mathematical Problems in Engineering, 2017, 2017.": "Asphalt pavement pothole detection and segmentation based on wavelet energy field", "[91] Ernin Niswatul Ukhwah et al. Asphalt pavement pothole detection using deep learning method based on yolo neural network. In 2019 International Seminar on Intelligent Technology and Its Applications (ISITIA), pages 35–40. IEEE, 2019.": "Asphalt pavement pothole detection using deep learning method based on yolo neural network", "[57] Akhila Daniel and V. Preeja. Automatic road distress detection and analysis. International Journal of Computer Applications, 101(10), 2014.": "Automatic Road Distress Detection and Analysis", "[37] Emir Buza et al. Pothole detection with image processing and spectral clustering. In Proceedings of the 2nd International Conference on Information Technology and Computer Networks, volume 810, page 4853, 2013.": "Pothole detection with image processing and spectral clustering", "[88] Saksham Gupta et al. Detection and localization of potholes in thermal images using deep neural networks. Multimedia Tools and Applications, 79(35):26265–26284, 2020.": "Detection and localization of potholes in thermal images using deep neural networks", "[114] Sukhad Anand et al. Crack-pot: Autonomous road crack and pothole detection. In 2018 Digital Image Computing: Techniques and Applications (DICTA), pages 1–6. IEEE, 2018.": "Crack-pot: Autonomous road crack and pothole detection", "[92] J. Dharneeshkar et al. Deep learning based detection of potholes in indian roads using yolo. In 2020 International Conference on Inventive Computation Technologies (ICICT), pages 381–385. IEEE, 2020.": "Deep learning based detection of potholes in Indian roads using YOLO", "[6] Rui Fan and Ming Liu. Road damage detection based on unsupervised disparity map segmentation. IEEE Transactions on Intelligent Transportation Systems, 21(11):4906–4911, 2019.": "Road damage detection based on unsupervised disparity map segmentation", "[11] Rui Fan et al. We learn better road pothole detection: from attention aggregation to adversarial domain adaptation. In European Conference on Computer Vision Workshops (ECCVW), pages 285–300. Springer, 2020.": "We learn better road pothole detection: from attention aggregation to adversarial domain adaptation", "[62] Yifan Pan et al. Detection of asphalt pavement potholes and cracks based on the unmanned aerial vehicle multispectral imagery. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 11(10):3701–3712, 2018.": "Detection of asphalt pavement potholes and cracks based on the unmanned aerial vehicle multispectral imagery", "[116] Hangbin Wu et al. Road pothole extraction and safety evaluation by integration of point cloud and images derived from mobile mapping sensors. Advanced Engineering Informatics, 42:100936, 2019.": "Road pothole extraction and safety evaluation by integration of point cloud and images derived from mobile mapping sensors", "[95] Aaquib Javed et al. Pothole detection system using region-based convolutional neural network. In 2021 IEEE 4th International Conference on Computer and Communication Engineering Technology (CCET), pages 6–11. IEEE, 2021.": "Pothole detection system using region-based convolutional neural network", "[44] Rui Fan et al. Graph attention layer evolves semantic segmentation for road pothole detection: A benchmark and algorithms. IEEE transactions on image processing, 30:8144–8154, 2021.": "Graph Attention Layer Evolves Semantic Segmentation for Road Pothole Detection: A Benchmark and Algorithms", "[14] Christian Koch and Ioannis Brilakis. Pothole detection in asphalt pavement images. Advanced Engineering Informatics, 25(3):507–515, 2011.": "Pothole detection in asphalt pavement images", "[97] Vosco Pereira et al. Semantic segmentation of paved road and pothole image using u-net architecture. In 2019 International Conference of Advanced Informatics: Concepts, Theory and Applications (ICAICTA), pages 1–4. IEEE, 2019.": "Semantic Segmentation of Paved Road and Pothole Image Using U-Net Architecture", "[41] Amila Akagic et al. Pothole detection: An efficient vision based method using rgb color space image segmentation. In 2017 40th International Convention on Information and Communication Technology, Electronics and Microelectronics (MIPRO), pages 1104–1109. IEEE, 2017.": "Pothole detection: An efficient vision based method using rgb color space image segmentation", "[58] Georgios M Hadjidemetriou et al. Automated detection of pavement patches utilizing support vector machine classification. In 2016 18th Mediterranean Electrotechnical Conference (MELECON), pages 1–5. IEEE, 2016.": "Automated detection of pavement patches utilizing support vector machine classification", "[22] Mohammad R. Jahanshahi et al. Unsupervised approach for autonomous pavement-defect detection and quantification using an inexpensive depth sensor. Journal of Computing in Civil Engineering, 27(6):743–754, 2013.": "Unsupervised approach for autonomous pavement-defect detection and quantification using an inexpensive depth sensor", "[39] Ionut Schiopu et al. Pothole detection and tracking in car video sequence. In 2016 39th International Conference on Telecommunications and Signal Processing (TSP), pages 701–706. IEEE, 2016.": "Pothole detection and tracking in car video sequence", "[5] Rui Fan et al. Rethinking road surface 3-d reconstruction and pothole detection: From perspective transformation to disparity map segmentation. IEEE Transactions on Cybernetics, DOI:10.1109/TCYB.2021.3060461, 2021.": "Rethinking road surface 3-d reconstruction and pothole detection: From perspective transformation to disparity map segmentation", "[67] Yukti Bhatia et al. Convolutional neural networks based potholes detection using thermal imaging. Journal of King Saud University-Computer and Information Sciences, 2019.": "Convolutional Neural Networks Based Potholes Detection Using Thermal Imaging", "[64] Vosco Pereira et al. A deep learning-based approach for road pothole detection in timor leste. In 2018 IEEE International Conference on Service Operations and Logistics, and Informatics (SOLI), pages 279–284. IEEE, 2018.": "A deep learning-based approach for road pothole detection in Timor Leste"}, "source_title_to_arxiv_id": {"Road Damage Detection Using Deep Neural Networks with Images Captured Through a Smartphone": "1801.09454"}}