{"title": "Adaptive GLCM sampling for transformer-based COVID-19 detection on CT", "abstract": "The world has suffered from COVID-19 (SARS-CoV-2) for the last two years,\ncausing much damage and change in people's daily lives. Thus, automated\ndetection of COVID-19 utilizing deep learning on chest computed tomography (CT)\nscans became promising, which helps correct diagnosis efficiently. Recently,\ntransformer-based COVID-19 detection method on CT is proposed to utilize 3D\ninformation in CT volume. However, its sampling method for selecting slices is\nnot optimal. To leverage rich 3D information in CT volume, we propose a\ntransformer-based COVID-19 detection using a novel data curation and adaptive\nsampling method using gray level co-occurrence matrices (GLCM). To train the\nmodel which consists of CNN layer, followed by transformer architecture, we\nfirst executed data curation based on lung segmentation and utilized the\nentropy of GLCM value of every slice in CT volumes to select important slices\nfor the prediction. The experimental results show that the proposed method\nimprove the detection performance with large margin without much difficult\nmodification to the model.", "authors": ["Okchul Jung", "Dong Un Kang", "Gwanghyun Kim", "Se Young Chun"], "published_date": "2022_07_04", "pdf_url": "http://arxiv.org/pdf/2207.01520v1", "list_table_and_caption": [{"table": "<p>Sampling methodMacro F1SensitivitySpecificityCenter focused (no data curation)84.5783.6467.46Center focused89.0581.1396.28GLCM (s=17)87.6087.7488.10GLCM (s=9)87.8087.2689.22GLCM (s=3)89.4989.1589.59</p>", "caption": "Table 1: Comparison of validation performance among the COVID-19 detection methods. The results are in %. Center focused sampling is the method used in original CCAT work [3]. s represents the window size used in Savitzky-Golay filter.", "list_citation_info": ["[3] Hsu, C.C., Chen, G.L., Wu, M.H.: Visual transformer with statistical test for covid-19 classification. arXiv preprint arXiv:2107.05334 (2021)"]}], "citation_info_to_title": {"[3] Hsu, C.C., Chen, G.L., Wu, M.H.: Visual transformer with statistical test for covid-19 classification. arXiv preprint arXiv:2107.05334 (2021)": "Visual Transformer with Statistical Test for COVID-19 Classification"}, "source_title_to_arxiv_id": {"Visual Transformer with Statistical Test for COVID-19 Classification": "2107.05334"}}