{"title": "Federated Learning for Medical Applications: A Taxonomy, Current Trends, Challenges, and Future Research Directions", "abstract": "With the advent of the IoT, AI, and ML/DL algorithms, the data-driven medical\napplication has emerged as a promising tool for designing reliable and scalable\ndiagnostic and prognostic models from medical data. This has attracted a great\ndeal of attention from academia to industry in recent years. This has\nundoubtedly improved the quality of healthcare delivery. However, these\nAI-based medical applications still have poor adoption due to their\ndifficulties in satisfying strict security, privacy, and quality of service\nstandards (such as low latency). Moreover, medical data are usually fragmented\nand private, making it challenging to generate robust results across\npopulations. Recent developments in federated learning (FL) have made it\npossible to train complex machine-learned models in a distributed manner. Thus,\nFL has become an active research domain, particularly processing the medical\ndata at the edge of the network in a decentralized way to preserve privacy and\nsecurity concerns. To this end, this survey paper highlights the current and\nfuture of FL technology in medical applications where data sharing is a\nsignificant burden. It also review and discuss the current research trends and\ntheir outcomes for designing reliable and scalable FL models. We outline the\ngeneral FL's statistical problems, device challenges, security, privacy\nconcerns, and its potential in the medical domain. Moreover, our study is also\nfocused on medical applications where we highlight the burden of global cancer\nand the efficient use of FL for the development of computer-aided diagnosis\ntools for addressing them. We hope that this review serves as a checkpoint that\nsets forth the existing state-of-the-art works in a thorough manner and offers\nopen problems and future research directions for this field.", "authors": ["Ashish Rauniyar", "Desta Haileselassie Hagos", "Debesh Jha", "Jan Erik Håkegård", "Ulas Bagci", "Danda B. Rawat", "Vladimir Vlassov"], "published_date": "2022_08_05", "pdf_url": "http://arxiv.org/pdf/2208.03392v3", "list_table_and_caption": [{"table": "<table><thead><tr><th>Publications</th><th>Main Research Focus and Scope</th></tr></thead><tbody><tr><th>This Survey</th><td>  •  Presents a comprehensive survey on the use of FL in the medical domain.</td></tr><tr><th></th><td>  •  Provides a holistic taxonomy on the use of several technologies in conjugation with FL, especially for medical applications.</td></tr><tr><th></th><td>  •  Covers the state-of-the-art works targeting the most commonly caused cancer both in terms of incidence and mortality and the</td></tr><tr><th></th><td>     application of FL in developing computer-aided diagnosis tools.</td></tr><tr><th></th><td>  •  Discusses the main challenges, open research problems, and future research directions of FL in the context of the medical domain.</td></tr><tr><th>Ref [24]</th><td>  •  Focuses on comparing different ML-based deployment architectures for FL.</td></tr><tr><th></th><td>  •  Covers privacy and security, and resource management.</td></tr><tr><th>Ref [25]</th><td>  •  Focuses on FL enabling technologies, protocols, and applications.</td></tr><tr><th></th><td>  •  Provides a summary of the relevant FL protocols, platforms, and some real-life use-cases for FL.</td></tr><tr><th>Ref [26]</th><td>  •  Focuses on exploring learning algorithms to improve the federated averaging algorithm.</td></tr><tr><th></th><td>  •  Reviews model fusion methods for FL.</td></tr><tr><th>Ref [27]</th><td>  •  Summarizes the development prospects of FL in industrial field.</td></tr><tr><th>Ref [28]</th><td>  •  Explores the definition of FL systems and analyzed the FL system components.</td></tr><tr><th></th><td>  •  Categorizes FL systems according to data distribution, ML model, privacy mechanism, communication architecture,</td></tr><tr><th></th><td>    scale of federation and motivation of federation.</td></tr><tr><th>Ref [29]</th><td>  •  Surveys the applications of FL for mobile edge computing network optimization.</td></tr><tr><th>Ref [30]</th><td>  •  Investigates industrial application trends of FL, essential factors affecting the quality of FL models, and compares FL and</td></tr><tr><th></th><td>    non-FL algorithms in terms of learning quality.</td></tr><tr><th>Ref [31]</th><td>  •  Investigates FL as a potential solution for the future of digital health and highlights the challenges of FL on digital health.</td></tr><tr><th>Ref [32]</th><td>  •  Discusses the application of FL for various fields in smart cities, including communication security and privacy issues.</td></tr><tr><th>Ref [33]</th><td>  •  Provides a systematic literature review on the FL and its applicability for confidential healthcare datasets.</td></tr><tr><th>Ref [34, 35]</th><td>  •  Describes the role of FL in Internet of Medical Things (IoMT) networks for privacy preservation.</td></tr><tr><th>Ref [36]</th><td>  •  Presents a systematic literature review on current research about FL in the context of EHR data.</td></tr><tr><th></th><td>  •  Discusses a general architecture for FL based on the primary findings from the literature analysis.</td></tr></tbody></table>", "caption": "TABLE II: Comparison and overview of recent surveys in FL.", "list_citation_info": ["[27] L. Li, Y. Fan, M. Tse, and K.-Y. Lin, “A review of applications in federated learning,” Computers & Industrial Engineering, vol. 149, p. 106854, 2020.", "[25] M. Aledhari, R. Razzak, R. M. Parizi, and F. Saeed, “Federated learning: A survey on enabling technologies, protocols, and applications,” IEEE Access, vol. 8, pp. 140 699–140 725, 2020.", "[34] J. Xu, B. S. Glicksberg, C. Su, P. Walker, J. Bian, and F. Wang, “Federated learning for healthcare informatics,” Journal of Healthcare Informatics Research, vol. 5, no. 1, pp. 1–19, 2021.", "[29] W. Y. B. Lim, N. C. Luong, D. T. Hoang, Y. Jiao, Y.-C. Liang, Q. Yang, D. Niyato, and C. Miao, “Federated learning in mobile edge networks: A comprehensive survey,” IEEE Communications Surveys & Tutorials, vol. 22, no. 3, pp. 2031–2063, 2020.", "[31] N. Rieke, J. Hancox, W. Li, F. Milletari, H. R. Roth, S. Albarqouni, S. Bakas, M. N. Galtier, B. A. Landman, K. Maier-Hein, et al., “The future of digital health with federated learning,” NPJ digital medicine, vol. 3, no. 1, pp. 1–7, 2020.", "[28] Q. Li, Z. Wen, Z. Wu, S. Hu, N. Wang, Y. Li, X. Liu, and B. He, “A survey on federated learning systems: vision, hype and reality for data privacy and protection,” IEEE Transactions on Knowledge and Data Engineering, 2021.", "[24] S. AbdulRahman, H. Tout, H. Ould-Slimane, A. Mourad, C. Talhi, and M. Guizani, “A survey on federated learning: The journey from centralized to distributed on-site learning and beyond,” IEEE Internet of Things Journal, vol. 8, no. 7, pp. 5476–5497, 2020.", "[30] Y. Liu, L. Zhang, N. Ge, and G. Li, “A systematic literature review on federated learning: From a model quality perspective,” 2020.", "[32] Z. Zheng, Y. Zhou, Y. Sun, Z. Wang, B. Liu, and K. Li, “Applications of federated learning in smart cities: recent advances, taxonomy, and open challenges,” Connection Science, vol. 34, no. 1, pp. 1–28, 2022.", "[33] B. Pfitzner, N. Steckhan, and B. Arnrich, “Federated learning in a medical context: A systematic literature review,” ACM Transactions on Internet Technology (TOIT), vol. 21, no. 2, pp. 1–31, 2021.", "[26] S. Ji, T. Saravirta, S. Pan, G. Long, and A. Walid, “Emerging trends in federated learning: From model fusion to federated x learning,” arXiv preprint arXiv:2102.12920, 2021.", "[36] R. S. Antunes, C. A. da Costa, A. Küderle, I. A. Yari, and B. Eskofier, “Federated learning for healthcare: Systematic review and architecture proposal,” ACM Transactions on Intelligent Systems and Technology (TIST), 2022."]}, {"table": "<table><thead><tr><th>Reference</th><th>Key idea</th><th>Category</th></tr></thead><tbody><tr><td><p>Ref [46]</p></td><td><p>Introduced local-statistic batch normalization layers to <abbr>DL</abbr> architectures, resulting in a unique FL strategy that produced a cooperatively trained yet center-specific model.</p></td><td><p>FL Data Heterogeneity, Federated Transfer Learning, Medical Image Analysis</p></td></tr><tr><td><p>Ref [47]</p></td><td><p>Genomics data divided across two virtual centers were used to train a supervised model for the prediction of the occurrence of breast cancer, while differential privacy was used to preserve data privacy.</p></td><td><p>Privacy Algorithm, Cancer Prediction</p></td></tr><tr><td><p>Ref [48]</p></td><td><p>Federated Uncertainty-Aware Learning Algorithm (FUALA), a novel FL model that enhances Federated Averaging (FedAvg) in the context of EHR, has been proposed.</p></td><td><p>FL Algorithm, FL on EHR Data</p></td></tr><tr><td><p>Ref [49]</p></td><td><p>Provided a decentralized FL framework for producing estimations of mean arterial pressure and continuous data on arterial blood pressure using a single optical sensor.</p></td><td><p>FL Framework, Blood Pressure Estimation</p></td></tr><tr><td><p>Ref [50]</p></td><td><p>Applied privacy-preserving FL on biomedical informatics data collected with wearable IoT devices.</p></td><td><p>FL in Bio-medical IoT, Stress Level Monitoring</p></td></tr><tr><td><p>Ref [51]</p></td><td><p>Introduced a novel technique that enables each client to perform stochastic gradient algorithms independently of the others, making it appropriate for clients with intermittent connectivity.</p></td><td><p>Bio-medical Data, Data Heterogeneity in FL, Convergence</p></td></tr><tr><td><p>Ref [52]</p></td><td><p>To solve the issue of data disparity, the Federated Opportunistic Computing for Ubiquitous System (FOCUS) was proposed. A minimal number of benchmark samples are kept on the server by FOCUS. The label quality of a client’s dataset is computed using a unique mutual cross-entropy-based credibility score that does not require access to the raw data.</p></td><td><p>Data Heterogeneity in FL, Bio-medical Datasets</p></td></tr><tr><td><p>Ref [53]</p></td><td><p>Introduced an FL-based differential privacy framework that allows distributed health data stored locally at several sites with two degrees of privacy protection that can be used to develop a global model.</p></td><td><p>Differential Privacy Framework, Health Data</p></td></tr><tr><td><p>Ref [54]</p></td><td><p>Proposed Federated <abbr>ML</abbr> with anonymous random hybridization (FeARH), which is a distributed <abbr>ML</abbr> training method that aims to deal with untrustworthy parties in federated <abbr>ML</abbr> by implementing a hybrid algorithm by adding randomization into parameter sets shared among various parties.</p></td><td><p>Security, FL in EHR Data</p></td></tr><tr><td><p>Ref [55]</p></td><td><p>Cooperated on a healthcare FL project to develop the “EXAM” (EMR CXR AI Model) model, which used inputs from vital signs, laboratory data, and chest x-rays to predict future oxygen requirements for SARS-COV-2 patients.</p></td><td><p>FL in Pandemic Scenario</p></td></tr><tr><td><p>Ref [56]</p></td><td><p>Using a modular system based on multiparty homomorphic encryption, a Federated Analytics-based Multiparty Homomorphic Encryption (FAMHE) is proposed that enables privacy-preserving execution of federated analytics workflows yielding precise results without leaking any intermediate information.</p></td><td><p>Security &amp; Privacy of FL, Bio-medical Data</p></td></tr><tr><td><p>Ref [57]</p></td><td><p>Proposed an FL-based strategy for medical named entity recognition (NER) that protects patient privacy and uses labeled data from multiple platforms to speed up NER model training without requiring platforms to exchange raw data.</p></td><td><p>Medical Data Labelling, Privacy</p></td></tr><tr><td><p>Ref [58]</p></td><td><p>Proposed multi-diseases classification from chest-X-ray using Federated <abbr>DL</abbr> (FDL)</p></td><td><p>Fl-based Disease Classification, Federated Transfer Learning</p></td></tr><tr><td><p>Ref [59]</p></td><td><p>A <abbr>FL</abbr> system is suggested that enables peer-to-peer learning of prediction models without the sharing of raw EHR data.</p></td><td><p>FL on EHR Data, Prediction of Heart-related Hospitalizations</p></td></tr></tbody></table>", "caption": "TABLE III: Summary of recent studies on FL in Healthcare.", "list_citation_info": ["[48] S. Boughorbel, F. Jarray, N. Venugopal, S. Moosa, H. Elhadi, and M. Makhlouf, “Federated uncertainty-aware learning for distributed hospital ehr data,” arXiv preprint arXiv:1910.12191, 2019.", "[50] Y. S. Can and C. Ersoy, “Privacy-preserving federated deep learning for wearable iot-based biomedical monitoring,” ACM Transactions on Internet Technology (TOIT), vol. 21, no. 1, pp. 1–17, 2021.", "[46] M. Andreux, J. O. d. Terrail, C. Beguier, and E. W. Tramel, “Siloed federated learning for multi-centric histopathology datasets,” in Domain Adaptation and Representation Transfer, and Distributed and Collaborative Learning, 2020, pp. 129–139.", "[54] J. Cui, H. Zhu, H. Deng, Z. Chen, and D. Liu, “Fearh: Federated machine learning with anonymous random hybridization on electronic medical records,” Journal of Biomedical Informatics, vol. 117, p. 103735, 2021.", "[52] Y. Chen, X. Yang, X. Qin, H. Yu, B. Chen, and Z. Shen, “Focus: Dealing with label quality disparity in federated learning,” arXiv preprint arXiv:2001.11359, 2020.", "[56] D. Froelicher, J. R. Troncoso-Pastoriza, J. L. Raisaro, M. A. Cuendet, J. S. Sousa, H. Cho, B. Berger, J. Fellay, and J.-P. Hubaux, “Truly privacy-preserving federated analytics for precision medicine with multiparty homomorphic encryption,” Nature communications, vol. 12, no. 1, pp. 1–10, 2021.", "[57] S. Ge, F. Wu, C. Wu, T. Qi, Y. Huang, and X. Xie, “Fedner: Privacy-preserving medical named entity recognition with federated learning,” arXiv preprint arXiv:2003.09288, 2020.", "[58] S. Banerjee, R. Misra, M. Prasad, E. Elmroth, and M. H. Bhuyan, “Multi-diseases classification from chest-x-ray: A federated deep learning approach,” in Proceedings of the Australasian Joint Conference on Artificial Intelligence, 2020, pp. 3–15.", "[47] C. Beguier, J. O. d. Terrail, I. Meah, M. Andreux, and E. W. Tramel, “Differentially private federated learning for cancer prediction,” arXiv preprint arXiv:2101.02997, 2021.", "[55] M. Flores, I. Dayan, H. Roth, A. Zhong, A. Harouni, A. Gentili, A. Abidin, A. Liu, A. Costa, B. Wood, et al., “Federated learning used for predicting outcomes in sars-cov-2 patients,” Research Square, 2021.", "[53] O. Choudhury, A. Gkoulalas-Divanis, T. Salonidis, I. Sylla, Y. Park, G. Hsu, and A. Das, “Differential privacy-enabled federated learning for sensitive health data,” arXiv preprint arXiv:1910.02578, 2019.", "[59] T. S. Brisimi, R. Chen, T. Mela, A. Olshevsky, I. C. Paschalidis, and W. Shi, “Federated learning of predictive models from federated electronic health records,” International journal of medical informatics, vol. 112, pp. 59–67, 2018.", "[51] T. Chen, X. Jin, Y. Sun, and W. Yin, “Vafl: a method of vertical asynchronous federated learning,” arXiv preprint arXiv:2007.06081, 2020.", "[49] E. Brophy, M. De Vos, G. Boylan, and T. Ward, “Estimation of continuous blood pressure from ppg via a federated learning approach,” Sensors, vol. 21, no. 18, p. 6311, 2021."]}, {"table": "<table><thead><tr><th>Reference</th><th>Key idea</th><th>Category</th></tr></thead><tbody><tr><td><p>Ref [60]</p></td><td><p>Reviewed the methods used for multi-institutional applications to distributed FL learning, handle data heterogeneity, and protect patient privacy.</p></td><td><p>Privacy, Multi-institutional Patient Data</p></td></tr><tr><td><p>Ref [61]</p></td><td><p>Used a non-interactive key generation technique to propose a privacy-preserving FL framework that is compatible with irrelevant updates using a communication-efficient secure aggregation protocol.</p></td><td><p>Privacy, FL on EHR Data</p></td></tr><tr><td><p>Ref [62]</p></td><td><p>Proposed a method for calculating cohort statistics in a federated manner while protecting patient privacy and determining the number of patients with hypertension.</p></td><td><p>Privacy Framework, Hypertension</p></td></tr><tr><td><p>Ref [63, 64]</p></td><td><p>Introduced an FL system that uses distributed health data stored locally at different sites to train a global model.</p></td><td><p>FL Algorithm, FL on EHR Data</p></td></tr><tr><td><p>Ref [65]</p></td><td><p>Reported the results of pilot research using FL to create a model of in-hospital mortality. Empirically, it demonstrated that FL achieved a comparable level of performance to that of centralized training, with the added benefit of preventing the exchange of datasets between hospitals.</p></td><td><p>Federated Transfer Learning, In-Hospital Mortality Prediction, FL Algorithms</p></td></tr><tr><td><p>Ref [66]</p></td><td><p>Proposed a Personal Health Train (PHT) that connects FAIR (Findable, Accessible, Interoperable, Reusable) data sources, enables distributed data analysis, and uses <abbr>ML</abbr> techniques.</p></td><td><p>Privacy Framework, FL on Lung Cancer Patient-Specific Database</p></td></tr><tr><td><p>Ref [67, 68]</p></td><td><p>Proposed and suggested creating an open-access federated dataset repository for sharing and preservation.</p></td><td><p>Privacy of FL, Epidemiology</p></td></tr><tr><td><p>Ref [69]</p></td><td><p>Implemented and assessed several aggregation techniques for healthcare data in FL. They also demonstrated how these techniques might be used during training to identify and eliminate bad or malicious local clients.</p></td><td><p>FL Algorithm, Medical Diagnosis Classification Task</p></td></tr><tr><td><p>Ref [70]</p></td><td><p>Presented an adaptive ensemble CNN as the primary classifier for a federated <abbr>ML</abbr> model of skin disease.</p></td><td><p>Medical Imaging, Skin Disease Detection</p></td></tr><tr><td><p>Ref [71]</p></td><td><p>Proposed an adaptive boosting method named LoAdaBoost and investigated the performance of learning in IID and non-IID data distribution scenarios.</p></td><td><p>Data Heterogeneity in FL, Intensive Care Dataset</p></td></tr><tr><td><p>Ref [72]</p></td><td><p>Outlined and predicted stroke risk and implemented the FL model on cloud servers while protecting user privacy. The federated prediction model system asynchronously enables numerous client connections and arbitrary local gradient iterations in each communication round.</p></td><td><p>Privacy Framework for FL, Stroke Prediction</p></td></tr><tr><td><p>Ref [73]</p></td><td><p>Proposed the Distributed Net (DNet) method to handle the privacy concerns of distributed datasets, which poses its own set of difficulties due to high communication latency, performance, and efficiency.</p></td><td><p>FL Algorithm, Bio-medical Datasets</p></td></tr><tr><td><p>Ref [74]</p></td><td><p>Used three benchmark datasets, including a clinical benchmark dataset, to assess the performance and reliability of FL.</p></td><td><p>FL Data Distributions, FL Bio-medical Datasets</p></td></tr><tr><td><p>Ref [75]</p></td><td><p>Proposed a new technique called Federated-Autonomous Deep Learning (FADL), which trains some components of the model utilizing data from several sources in a distributed fashion.</p></td><td><p>FL Training, FL on EHR Data</p></td></tr><tr><td><p>Ref [76, 77]</p></td><td><p>Focused on increasing the effectiveness of communication for completely decentralized <abbr>FL</abbr> across a graph, where the algorithm first conducts local updates over a number of iterations before enabling communications between the nodes.</p></td><td><p>FL Communication, FL on EHR Data</p></td></tr><tr><td><p>Ref [78]</p></td><td><p>Designed a secure <abbr>FL</abbr> method with different keys to prevent data island-level</p></td><td><p>Security and Privacy Framework for FL,</p></td></tr></tbody></table>", "caption": "TABLE IV: Summary of recent studies on FL in Healthcare, continued.", "list_citation_info": ["[66] T. M. Deist, F. J. Dankers, P. Ojha, M. S. Marshall, T. Janssen, C. Faivre-Finn, C. Masciocchi, V. Valentini, J. Wang, J. Chen, et al., “Distributed learning on 20 000+ lung cancer patients–the personal health train,” Radiotherapy and Oncology, vol. 144, pp. 189–200, 2020.", "[71] L. Huang, Y. Yin, Z. Fu, S. Zhang, H. Deng, and D. Liu, “Loadaboost: Loss-based adaboost federated machine learning with reduced computational complexity on iid and non-iid intensive care data,” Plos one, vol. 15, no. 4, p. e0230706, 2020.", "[72] C. Ju, R. Zhao, J. Sun, X. Wei, B. Zhao, Y. Liu, H. Li, T. Chen, X. Zhang, D. Gao, et al., “Privacy-preserving technology to help millions of people: Federated prediction model for stroke prevention,” arXiv preprint arXiv:2006.10517, 2020.", "[65] T. K. Dang, K. C. Tan, M. Choo, N. Lim, J. Weng, and M. Feng, “Building icu in-hospital mortality prediction model with federated learning,” in Federated Learning, 2020, pp. 255–268.", "[70] M. A. Hashmani, S. M. Jameel, S. S. H. Rizvi, and S. Shukla, “An adaptive federated machine learning-based intelligent system for skin disease detection: A step toward an intelligent dermoscopy device,” Applied Sciences, vol. 11, no. 5, p. 2145, 2021.", "[73] P. P. Kulkarni, H. Kasyap, and S. Tripathy, “Dnet: An efficient privacy-preserving distributed learning framework for healthcare systems,” in Proceedings of the International Conference on Distributed Computing and Internet Technology, 2021, pp. 145–159.", "[60] K. Chang, P. Singh, P. Vepakomma, M. G. Poirot, R. Raskar, D. L. Rubin, and J. Kalpathy-Cramer, “Privacy-preserving collaborative deep learning methods for multiinstitutional training without sharing patient data,” in Artificial Intelligence in Medicine, 2021, pp. 101–112.", "[76] S. Lu, Y. Zhang, Y. Wang, and C. Mack, “Learn electronic health records by fully decentralized federated learning,” arXiv preprint arXiv:1912.01792, 2019.", "[78] Z. Ma, J. Ma, Y. Miao, X. Liu, K.-K. R. Choo, and R. Deng, “Pocket diagnosis: Secure federated learning against poisoning attack in the cloud,” IEEE Transactions on Services Computing, 2021.", "[74] G. H. Lee and S.-Y. Shin, “Federated learning on clinical benchmark data: Performance assessment,” J Med Internet Res, vol. 22, no. 10, p. e20891, 2020.", "[63] O. Choudhury, Y. Park, T. Salonidis, A. Gkoulalas-Divanis, I. Sylla, et al., “Predicting adverse drug reactions on distributed health data using federated learning,” in Proceedings of the AMIA Annual symposium proceedings, vol. 2019, 2019, p. 313.", "[75] D. Liu, T. Miller, R. Sayeed, and K. D. Mandl, “Fadl: Federated-autonomous deep learning for distributed electronic health record,” arXiv preprint arXiv:1811.11400, 2018.", "[61] H. Chen, H. Li, G. Xu, Y. Zhang, and X. Luo, “Achieving privacy-preserving federated learning with irrelevant updates over e-health applications,” in Proceedings of the ICC 2020-2020 International Conference on Communications (ICC), 2020, pp. 1–6.", "[69] M. Grama, M. Musat, L. Muñoz-González, J. Passerat-Palmbach, D. Rueckert, and A. Alansary, “Robust aggregation for adaptive privacy preserving federated learning in healthcare,” arXiv preprint arXiv:2009.08294, 2020.", "[67] J. Favela, L. A. Castro, and L. Michan, “Towards a federated repository of mobile sensing datasets for pervasive healthcare,” in Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare, 2016, pp. 304–307.", "[62] A. Choudhury, J. v. Soest, S. Nayak, and A. Dekker, “Personal health train on fhir: A privacy preserving federated approach for analyzing fair data in healthcare,” in Proceedings of the International Conference on Machine Learning, Image Processing, Network Security and Data Sciences, 2020, pp. 85–95."]}, {"table": "<table><thead><tr><th>Reference</th><th>Key idea</th><th>Category</th></tr></thead><tbody><tr><td></td><td><p>poisoning attacks on patient data for medical diagnosis.</p></td><td><p>FL-based Medical Diagnosis</p></td></tr><tr><td><p>Ref [79]</p></td><td><p>Discussed how FL may be used to support flexible AI models trained on biopharma and clinical unstructured data, with an emphasis on extracting useful information using Natural Language Processing (NLP).</p></td><td><p>FL Training, FL Dataset</p></td></tr><tr><td><p>Ref [80]</p></td><td><p>Used a federated healthcare cloud broker architecture, which combines independent health service providers to create a large healthcare federation, satisfies user needs by sharing resources at various locations at reasonable costs, and offers Quality of Service (QoS) to all users. In the suggested federated healthcare cloud broker architecture, a variety of trust mechanisms, including reputation-based trust, SLA verification trust, and policy-based trust, are calculated to guarantee the security and privacy of users who access the services.</p></td><td><p>Security and Privacy Framework, Healthcare-based FL Architecture</p></td></tr><tr><td><p>Ref [81]</p></td><td><p>Proposed a pseudonymization protocol built on a (t,n)-threshold secret sharing system and public-key cryptography for health records in federated services.</p></td><td><p>Security Framework, FL on EHR Data</p></td></tr><tr><td><p>Ref [82]</p></td><td><p>Developed disease prediction models using FL on harmonized cohort data stored in private cloud databases using a computational process that deploys data curation and ontology matching to curate and aligns heterogeneous data structures.</p></td><td><p>Data Heterogeneity in FL, Disease Prediction Model</p></td></tr><tr><td><p>Ref [83]</p></td><td><p>Developed a training scheme for collaborative Fuzzy Cognitive Maps (FCM) learning that delivers data privacy compliance and introduced a novel approach for distributed learning of particle swarm optimization-based FCM in a manner that protects privacy.</p></td><td><p>FL Training, FL Optimization, Cancer Prediction</p></td></tr><tr><td><p>Ref [84]</p></td><td><p>A stochastic channel-based <abbr>FL</abbr> (SCBFL) method that enables users to train a high-performance model jointly and in a distributed way was developed to address security and privacy challenges.</p></td><td><p>FL Algorithm, FL Training, Bio-medical Data</p></td></tr><tr><td><p>Ref [85]</p></td><td><p>To structure iterations of development and facilitate knowledge sharing between two health network development teams coordination to support and manage shared phases, a spiral model for implementation and assessment was utilized.</p></td><td><p>Federated Data Sharing Architectures, FL on EHR Data</p></td></tr><tr><td><p>Ref [86]</p></td><td><p>To predict heart rate using an autoregression with an exogenous variable (ARX) model, Bayesian inference FL has been presented.</p></td><td><p>FL Algorithm, Heart Rate Prediction</p></td></tr><tr><td><p>Ref [87]</p></td><td><p>Suggested a personalized deep learning-based FL-trained and FL-managed clinical decision support system to aid healthcare practitioners in diagnosis</p></td><td><p>FL Algorithm, Security and Privacy Framework, Bio-medical Datasets</p></td></tr><tr><td><p>Ref [88]</p></td><td><p>Presented consensus federated modeling, which enables collaboration between a small health system and a larger system to create a model specific to the smaller system without sharing any data instances.</p></td><td><p>Federated Transfer Learning, Healthcare Systems</p></td></tr><tr><td><p>Ref [89]</p></td><td><p>A FL model that integrates mobile-edge computing (MEC) and software-defined networking has been proposed to take advantage of the computation and storage resources available among edge nodes when deploying a double deep Q-network (DDQN) in order to produce a stable and sequential clinical treatment policy.</p></td><td><p>Decentralized FL Framework, Security Algorithms, Clinical Decision Support Systems, FL on EHR Data</p></td></tr><tr><td><p>Ref [90]</p></td><td><p>For patient-reported outcomes measurements (PROM) data, a FL method that ensures privacy is proposed.</p></td><td><p>FL Algorithm, Privacy Framework, FL on EHR Data</p></td></tr></tbody></table>", "caption": "TABLE V: Summary of recent studies on FL in Healthcare, continued.", "list_citation_info": ["[87] C. M. Thwal, K. Thar, Y. L. Tun, and C. S. Hong, “Attention on personalized clinical decision support system: Federated learning approach,” in Proceedings of the International Conference on Big Data and Smart Computing (BigComp), 2021, pp. 141–147.", "[86] L. Fang, X. Liu, X. Su, J. Ye, S. Dobson, P. Hui, and S. Tarkoma, “Bayesian inference federated learning for heart rate prediction,” in Proceedings of the International Conference on Wireless Mobile Communication and Healthcare, 2020, pp. 116–130.", "[83] J. L. Salmeron and I. Arévalo, “A privacy-preserving, distributed and cooperative fcm-based learning approach for cancer research,” in Proceedings of the International Joint Conference on Rough Sets, 2020, pp. 477–487.", "[84] R. Shao, H. He, Z. Chen, H. Liu, D. Liu, et al., “Stochastic channel-based federated learning with neural network pruning for medical data privacy preservation: model development and experimental validation,” JMIR Formative Research, vol. 4, no. 12, p. e17265, 2020.", "[90] S. Jordan and R. Hendricks-Sturrup, “Patient-reported outcomes: A privacy-centric and federated approach to machine learning,” in Proceedings of the International Conference on Machine Learning, 2020.", "[81] M. Pedrosa, A. Zúquete, and C. Costa, “Pseudonymisation with break-the-glass compatibility for health records in federated services,” in Proceedings of the International Conference on Bioinformatics and Bioengineering (BIBE), 2019, pp. 274–277.", "[85] K. A. Stephens, N. Anderson, C.-P. Lin, and H. Estiri, “Implementing partnership-driven clinical federated electronic health record data sharing networks,” Proceedings of the International journal of medical informatics, vol. 93, pp. 26–33, 2016.", "[80] K. Mohan and M. Aramudhan, “Broker based trust architecture for federated healthcare cloud system,” Intelligent Automation & Soft Computing, vol. 23, no. 3, pp. 477–483, 2017.", "[79] A. Mitra, A. Rahman, and F. Rahman, “Federated learning approach to support biopharma and healthcare collaboration to accelerate crisis response,” in Proceedings of the Future Technologies Conference, 2020, pp. 64–77.", "[89] Z. Xue, P. Zhou, Z. Xu, X. Wang, Y. Xie, X. Ding, and S. Wen, “A resource-constrained and privacy-preserving edge-computing-enabled clinical decision system: A federated reinforcement learning approach,” IEEE Internet of Things Journal, vol. 8, no. 11, pp. 9122–9138, 2021.", "[88] R. Tourani, D. H. Murphree, Y. Zhu, A. Sheka, G. B. Melton, D. J. Kor, and G. J. Simon, “Consensus modeling: A transfer learning approach for small health systems,” in Proceedings of the International Conference on Artificial Intelligence in Medicine, 2020, pp. 181–191.", "[82] V. C. Pezoulas, F. Kalatzis, T. P. Exarchos, A. Goules, S. Gandolfo, E. Zampeli, F. Skopouli, S. D. Vita, A. G. Tzioufas, and D. I. Fotiadis, “Dealing with open issues and unmet needs in healthcare through ontology matching and federated learning,” in Proceedings of the European Medical and Biological Engineering Conference, 2020, pp. 306–313."]}], "citation_info_to_title": {"[80] K. Mohan and M. Aramudhan, “Broker based trust architecture for federated healthcare cloud system,” Intelligent Automation & Soft Computing, vol. 23, no. 3, pp. 477–483, 2017.": "Broker based trust architecture for federated healthcare cloud system", "[87] C. M. Thwal, K. Thar, Y. L. Tun, and C. S. Hong, “Attention on personalized clinical decision support system: Federated learning approach,” in Proceedings of the International Conference on Big Data and Smart Computing (BigComp), 2021, pp. 141–147.": "Attention on personalized clinical decision support system: Federated learning approach", "[47] C. Beguier, J. O. d. Terrail, I. Meah, M. Andreux, and E. W. Tramel, “Differentially private federated learning for cancer prediction,” arXiv preprint arXiv:2101.02997, 2021.": "Differentially private federated learning for cancer prediction", "[31] N. Rieke, J. Hancox, W. Li, F. Milletari, H. R. Roth, S. Albarqouni, S. Bakas, M. N. Galtier, B. A. Landman, K. Maier-Hein, et al., “The future of digital health with federated learning,” NPJ digital medicine, vol. 3, no. 1, pp. 1–7, 2020.": "The future of digital health with federated learning", "[74] G. H. Lee and S.-Y. Shin, “Federated learning on clinical benchmark data: Performance assessment,” J Med Internet Res, vol. 22, no. 10, p. e20891, 2020.": "Federated learning on clinical benchmark data: Performance assessment", "[90] S. Jordan and R. Hendricks-Sturrup, “Patient-reported outcomes: A privacy-centric and federated approach to machine learning,” in Proceedings of the International Conference on Machine Learning, 2020.": "Patient-reported outcomes: A privacy-centric and federated approach to machine learning", "[70] M. A. Hashmani, S. M. Jameel, S. S. H. Rizvi, and S. Shukla, “An adaptive federated machine learning-based intelligent system for skin disease detection: A step toward an intelligent dermoscopy device,” Applied Sciences, vol. 11, no. 5, p. 2145, 2021.": "An adaptive federated machine learning-based intelligent system for skin disease detection: A step toward an intelligent dermoscopy device", "[25] M. Aledhari, R. Razzak, R. M. Parizi, and F. Saeed, “Federated learning: A survey on enabling technologies, protocols, and applications,” IEEE Access, vol. 8, pp. 140 699–140 725, 2020.": "Federated learning: A survey on enabling technologies, protocols, and applications", "[83] J. L. Salmeron and I. Arévalo, “A privacy-preserving, distributed and cooperative fcm-based learning approach for cancer research,” in Proceedings of the International Joint Conference on Rough Sets, 2020, pp. 477–487.": "A privacy-preserving, distributed and cooperative fcm-based learning approach for cancer research", "[75] D. Liu, T. Miller, R. Sayeed, and K. D. Mandl, “Fadl: Federated-autonomous deep learning for distributed electronic health record,” arXiv preprint arXiv:1811.11400, 2018.": "Fadl: Federated-autonomous deep learning for distributed electronic health record", "[57] S. Ge, F. Wu, C. Wu, T. Qi, Y. Huang, and X. Xie, “Fedner: Privacy-preserving medical named entity recognition with federated learning,” arXiv preprint arXiv:2003.09288, 2020.": "Fedner: Privacy-preserving medical named entity recognition with federated learning", "[55] M. Flores, I. Dayan, H. Roth, A. Zhong, A. Harouni, A. Gentili, A. Abidin, A. Liu, A. Costa, B. Wood, et al., “Federated learning used for predicting outcomes in sars-cov-2 patients,” Research Square, 2021.": "Federated learning used for predicting outcomes in SARS-CoV-2 patients", "[32] Z. Zheng, Y. Zhou, Y. Sun, Z. Wang, B. Liu, and K. Li, “Applications of federated learning in smart cities: recent advances, taxonomy, and open challenges,” Connection Science, vol. 34, no. 1, pp. 1–28, 2022.": "Applications of federated learning in smart cities: recent advances, taxonomy, and open challenges", "[49] E. Brophy, M. De Vos, G. Boylan, and T. Ward, “Estimation of continuous blood pressure from ppg via a federated learning approach,” Sensors, vol. 21, no. 18, p. 6311, 2021.": "Estimation of continuous blood pressure from PPG via a federated learning approach", "[33] B. Pfitzner, N. Steckhan, and B. Arnrich, “Federated learning in a medical context: A systematic literature review,” ACM Transactions on Internet Technology (TOIT), vol. 21, no. 2, pp. 1–31, 2021.": "Federated learning in a medical context: A systematic literature review", "[71] L. Huang, Y. Yin, Z. Fu, S. Zhang, H. Deng, and D. Liu, “Loadaboost: Loss-based adaboost federated machine learning with reduced computational complexity on iid and non-iid intensive care data,” Plos one, vol. 15, no. 4, p. e0230706, 2020.": "Loadaboost: Loss-based adaboost federated machine learning with reduced computational complexity on iid and non-iid intensive care data", "[24] S. AbdulRahman, H. Tout, H. Ould-Slimane, A. Mourad, C. Talhi, and M. Guizani, “A survey on federated learning: The journey from centralized to distributed on-site learning and beyond,” IEEE Internet of Things Journal, vol. 8, no. 7, pp. 5476–5497, 2020.": "A survey on federated learning: The journey from centralized to distributed on-site learning and beyond", "[51] T. Chen, X. Jin, Y. Sun, and W. Yin, “Vafl: a method of vertical asynchronous federated learning,” arXiv preprint arXiv:2007.06081, 2020.": "Vafl: a method of vertical asynchronous federated learning", "[34] J. Xu, B. S. Glicksberg, C. Su, P. Walker, J. Bian, and F. Wang, “Federated learning for healthcare informatics,” Journal of Healthcare Informatics Research, vol. 5, no. 1, pp. 1–19, 2021.": "Federated learning for healthcare informatics", "[50] Y. S. Can and C. Ersoy, “Privacy-preserving federated deep learning for wearable iot-based biomedical monitoring,” ACM Transactions on Internet Technology (TOIT), vol. 21, no. 1, pp. 1–17, 2021.": "Privacy-Preserving Federated Deep Learning for Wearable IoT-Based Biomedical Monitoring", "[82] V. C. Pezoulas, F. Kalatzis, T. P. Exarchos, A. Goules, S. Gandolfo, E. Zampeli, F. Skopouli, S. D. Vita, A. G. Tzioufas, and D. I. Fotiadis, “Dealing with open issues and unmet needs in healthcare through ontology matching and federated learning,” in Proceedings of the European Medical and Biological Engineering Conference, 2020, pp. 306–313.": "Dealing with open issues and unmet needs in healthcare through ontology matching and federated learning", "[76] S. Lu, Y. Zhang, Y. Wang, and C. Mack, “Learn electronic health records by fully decentralized federated learning,” arXiv preprint arXiv:1912.01792, 2019.": "Learn electronic health records by fully decentralized federated learning", "[27] L. Li, Y. Fan, M. Tse, and K.-Y. Lin, “A review of applications in federated learning,” Computers & Industrial Engineering, vol. 149, p. 106854, 2020.": "A review of applications in federated learning", "[52] Y. Chen, X. Yang, X. Qin, H. Yu, B. Chen, and Z. Shen, “Focus: Dealing with label quality disparity in federated learning,” arXiv preprint arXiv:2001.11359, 2020.": "Focus: Dealing with label quality disparity in federated learning", "[61] H. Chen, H. Li, G. Xu, Y. Zhang, and X. Luo, “Achieving privacy-preserving federated learning with irrelevant updates over e-health applications,” in Proceedings of the ICC 2020-2020 International Conference on Communications (ICC), 2020, pp. 1–6.": "Achieving privacy-preserving federated learning with irrelevant updates over e-health applications", "[86] L. Fang, X. Liu, X. Su, J. Ye, S. Dobson, P. Hui, and S. Tarkoma, “Bayesian inference federated learning for heart rate prediction,” in Proceedings of the International Conference on Wireless Mobile Communication and Healthcare, 2020, pp. 116–130.": "Bayesian Inference Federated Learning for Heart Rate Prediction", "[63] O. Choudhury, Y. Park, T. Salonidis, A. Gkoulalas-Divanis, I. Sylla, et al., “Predicting adverse drug reactions on distributed health data using federated learning,” in Proceedings of the AMIA Annual symposium proceedings, vol. 2019, 2019, p. 313.": "Predicting adverse drug reactions on distributed health data using federated learning", "[48] S. Boughorbel, F. Jarray, N. Venugopal, S. Moosa, H. Elhadi, and M. Makhlouf, “Federated uncertainty-aware learning for distributed hospital ehr data,” arXiv preprint arXiv:1910.12191, 2019.": "Federated uncertainty-aware learning for distributed hospital EHR data", "[54] J. Cui, H. Zhu, H. Deng, Z. Chen, and D. Liu, “Fearh: Federated machine learning with anonymous random hybridization on electronic medical records,” Journal of Biomedical Informatics, vol. 117, p. 103735, 2021.": "Fearh: Federated machine learning with anonymous random hybridization on electronic medical records", "[81] M. Pedrosa, A. Zúquete, and C. Costa, “Pseudonymisation with break-the-glass compatibility for health records in federated services,” in Proceedings of the International Conference on Bioinformatics and Bioengineering (BIBE), 2019, pp. 274–277.": "Pseudonymisation with break-the-glass compatibility for health records in federated services", "[65] T. K. Dang, K. C. Tan, M. Choo, N. Lim, J. Weng, and M. Feng, “Building icu in-hospital mortality prediction model with federated learning,” in Federated Learning, 2020, pp. 255–268.": "Building ICU In-Hospital Mortality Prediction Model with Federated Learning", "[62] A. Choudhury, J. v. Soest, S. Nayak, and A. Dekker, “Personal health train on fhir: A privacy preserving federated approach for analyzing fair data in healthcare,” in Proceedings of the International Conference on Machine Learning, Image Processing, Network Security and Data Sciences, 2020, pp. 85–95.": "Personal Health Train on FHIR: A Privacy Preserving Federated Approach for Analyzing Fair Data in Healthcare", "[28] Q. Li, Z. Wen, Z. Wu, S. Hu, N. Wang, Y. Li, X. Liu, and B. He, “A survey on federated learning systems: vision, hype and reality for data privacy and protection,” IEEE Transactions on Knowledge and Data Engineering, 2021.": "A survey on federated learning systems: vision, hype and reality for data privacy and protection", "[60] K. Chang, P. Singh, P. Vepakomma, M. G. Poirot, R. Raskar, D. L. Rubin, and J. Kalpathy-Cramer, “Privacy-preserving collaborative deep learning methods for multiinstitutional training without sharing patient data,” in Artificial Intelligence in Medicine, 2021, pp. 101–112.": "Privacy-preserving collaborative deep learning methods for multiinstitutional training without sharing patient data", "[59] T. S. Brisimi, R. Chen, T. Mela, A. Olshevsky, I. C. Paschalidis, and W. Shi, “Federated learning of predictive models from federated electronic health records,” International journal of medical informatics, vol. 112, pp. 59–67, 2018.": "Federated learning of predictive models from federated electronic health records", "[56] D. Froelicher, J. R. Troncoso-Pastoriza, J. L. Raisaro, M. A. Cuendet, J. S. Sousa, H. Cho, B. Berger, J. Fellay, and J.-P. Hubaux, “Truly privacy-preserving federated analytics for precision medicine with multiparty homomorphic encryption,” Nature communications, vol. 12, no. 1, pp. 1–10, 2021.": "Truly privacy-preserving federated analytics for precision medicine with multiparty homomorphic encryption", "[58] S. Banerjee, R. Misra, M. Prasad, E. Elmroth, and M. H. Bhuyan, “Multi-diseases classification from chest-x-ray: A federated deep learning approach,” in Proceedings of the Australasian Joint Conference on Artificial Intelligence, 2020, pp. 3–15.": "Multi-diseases classification from chest-x-ray: A federated deep learning approach", "[30] Y. Liu, L. Zhang, N. Ge, and G. Li, “A systematic literature review on federated learning: From a model quality perspective,” 2020.": "A systematic literature review on federated learning: From a model quality perspective", "[85] K. A. Stephens, N. Anderson, C.-P. Lin, and H. Estiri, “Implementing partnership-driven clinical federated electronic health record data sharing networks,” Proceedings of the International journal of medical informatics, vol. 93, pp. 26–33, 2016.": "Implementing partnership-driven clinical federated electronic health record data sharing networks", "[67] J. Favela, L. A. Castro, and L. Michan, “Towards a federated repository of mobile sensing datasets for pervasive healthcare,” in Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare, 2016, pp. 304–307.": "Towards a federated repository of mobile sensing datasets for pervasive healthcare", "[72] C. Ju, R. Zhao, J. Sun, X. Wei, B. Zhao, Y. Liu, H. Li, T. Chen, X. Zhang, D. Gao, et al., “Privacy-preserving technology to help millions of people: Federated prediction model for stroke prevention,” arXiv preprint arXiv:2006.10517, 2020.": "Privacy-Preserving Technology to Help Millions of People: Federated Prediction Model for Stroke Prevention", "[89] Z. Xue, P. Zhou, Z. Xu, X. Wang, Y. Xie, X. Ding, and S. Wen, “A resource-constrained and privacy-preserving edge-computing-enabled clinical decision system: A federated reinforcement learning approach,” IEEE Internet of Things Journal, vol. 8, no. 11, pp. 9122–9138, 2021.": "A resource-constrained and privacy-preserving edge-computing-enabled clinical decision system: A federated reinforcement learning approach", "[26] S. Ji, T. Saravirta, S. Pan, G. Long, and A. Walid, “Emerging trends in federated learning: From model fusion to federated x learning,” arXiv preprint arXiv:2102.12920, 2021.": "Emerging trends in federated learning: From model fusion to federated x learning", "[84] R. Shao, H. He, Z. Chen, H. Liu, D. Liu, et al., “Stochastic channel-based federated learning with neural network pruning for medical data privacy preservation: model development and experimental validation,” JMIR Formative Research, vol. 4, no. 12, p. e17265, 2020.": "Stochastic channel-based federated learning with neural network pruning for medical data privacy preservation: model development and experimental validation", "[69] M. Grama, M. Musat, L. Muñoz-González, J. Passerat-Palmbach, D. Rueckert, and A. Alansary, “Robust aggregation for adaptive privacy preserving federated learning in healthcare,” arXiv preprint arXiv:2009.08294, 2020.": "Robust aggregation for adaptive privacy preserving federated learning in healthcare", "[46] M. Andreux, J. O. d. Terrail, C. Beguier, and E. W. Tramel, “Siloed federated learning for multi-centric histopathology datasets,” in Domain Adaptation and Representation Transfer, and Distributed and Collaborative Learning, 2020, pp. 129–139.": "Siloed federated learning for multi-centric histopathology datasets", "[73] P. P. Kulkarni, H. Kasyap, and S. Tripathy, “Dnet: An efficient privacy-preserving distributed learning framework for healthcare systems,” in Proceedings of the International Conference on Distributed Computing and Internet Technology, 2021, pp. 145–159.": "Dnet: An efficient privacy-preserving distributed learning framework for healthcare systems", "[78] Z. Ma, J. Ma, Y. Miao, X. Liu, K.-K. R. Choo, and R. Deng, “Pocket diagnosis: Secure federated learning against poisoning attack in the cloud,” IEEE Transactions on Services Computing, 2021.": "Pocket diagnosis: Secure federated learning against poisoning attack in the cloud", "[79] A. Mitra, A. Rahman, and F. Rahman, “Federated learning approach to support biopharma and healthcare collaboration to accelerate crisis response,” in Proceedings of the Future Technologies Conference, 2020, pp. 64–77.": "Federated learning approach to support biopharma and healthcare collaboration to accelerate crisis response", "[29] W. Y. B. Lim, N. C. Luong, D. T. Hoang, Y. Jiao, Y.-C. Liang, Q. Yang, D. Niyato, and C. Miao, “Federated learning in mobile edge networks: A comprehensive survey,” IEEE Communications Surveys & Tutorials, vol. 22, no. 3, pp. 2031–2063, 2020.": "Federated learning in mobile edge networks: A comprehensive survey", "[88] R. Tourani, D. H. Murphree, Y. Zhu, A. Sheka, G. B. Melton, D. J. Kor, and G. J. Simon, “Consensus modeling: A transfer learning approach for small health systems,” in Proceedings of the International Conference on Artificial Intelligence in Medicine, 2020, pp. 181–191.": "Consensus modeling: A transfer learning approach for small health systems", "[36] R. S. Antunes, C. A. da Costa, A. Küderle, I. A. Yari, and B. Eskofier, “Federated learning for healthcare: Systematic review and architecture proposal,” ACM Transactions on Intelligent Systems and Technology (TIST), 2022.": "Federated learning for healthcare: Systematic review and architecture proposal", "[66] T. M. Deist, F. J. Dankers, P. Ojha, M. S. Marshall, T. Janssen, C. Faivre-Finn, C. Masciocchi, V. Valentini, J. Wang, J. Chen, et al., “Distributed learning on 20 000+ lung cancer patients–the personal health train,” Radiotherapy and Oncology, vol. 144, pp. 189–200, 2020.": "Distributed learning on 20 000+ lung cancer patients–the personal health train", "[53] O. Choudhury, A. Gkoulalas-Divanis, T. Salonidis, I. Sylla, Y. Park, G. Hsu, and A. Das, “Differential privacy-enabled federated learning for sensitive health data,” arXiv preprint arXiv:1910.02578, 2019.": "Differential privacy-enabled federated learning for sensitive health data"}, "source_title_to_arxiv_id": {"Federated learning on clinical benchmark data: Performance assessment": "2005.11756", "A review of applications in federated learning": "2304.07310", "Emerging trends in federated learning: From model fusion to federated x learning": "2102.12920"}}