{"title": "On the use of learning-based forecasting methods for ameliorating fashion business processes: A position paper", "abstract": "The fashion industry is one of the most active and competitive markets in the\nworld, manufacturing millions of products and reaching large audiences every\nyear. A plethora of business processes are involved in this large-scale\nindustry, but due to the generally short life-cycle of clothing items,\nsupply-chain management and retailing strategies are crucial for good market\nperformance. Correctly understanding the wants and needs of clients, managing\nlogistic issues and marketing the correct products are high-level problems with\na lot of uncertainty associated to them given the number of influencing\nfactors, but most importantly due to the unpredictability often associated with\nthe future. It is therefore straightforward that forecasting methods, which\ngenerate predictions of the future, are indispensable in order to ameliorate\nall the various business processes that deal with the true purpose and meaning\nof fashion: having a lot of people wear a particular product or style,\nrendering these items, people and consequently brands fashionable. In this\npaper, we provide an overview of three concrete forecasting tasks that any\nfashion company can apply in order to improve their industrial and market\nimpact. We underline advances and issues in all three tasks and argue about\ntheir importance and the impact they can have at an industrial level. Finally,\nwe highlight issues and directions of future work, reflecting on how\nlearning-based forecasting methods can further aid the fashion industry.", "authors": ["Geri Skenderi", "Christian Joppi", "Matteo Denitto", "Marco Cristani"], "published_date": "2022_11_09", "pdf_url": "http://arxiv.org/pdf/2211.04798v1", "list_table_and_caption": [{"table": "<table><thead><tr><th>Method</th><th>Input</th><th>WAPE</th><th>MAE</th></tr></thead><tbody><tr><td>Attribute KNN [16] 2020</td><td>[T]</td><td>59,8</td><td>32,7</td></tr><tr><td>Image KNN [16] 2020</td><td>[I]</td><td>62,2</td><td>34,0</td></tr><tr><td>Attr+Image KNN [16] 2020</td><td>[T+I]</td><td>61,3</td><td>33,5</td></tr><tr><td>GBoosting [22] 2001</td><td>[T+I+G]</td><td>63,5</td><td>34,7</td></tr><tr><td>Cat-MM-RNN [16] 2020</td><td>[T+I+G]</td><td>65,9</td><td>35,8</td></tr><tr><td>CrossAttnRNN [16] 2020</td><td>[T+I+G]</td><td>59,0</td><td>32,1</td></tr><tr><td>MuQAR [21]</td><td>[T+I+G+A+C]</td><td>52,6</td><td>28,8</td></tr><tr><td>GTM-Transformer [19]</td><td>[T+I+G]</td><td>55,2</td><td>30,2</td></tr><tr><td>GTM-Transformer [20]</td><td>[T+I+POP]</td><td>52,4</td><td>28,6</td></tr></tbody></table>", "caption": "TABLE I: New Product Demand Forecasting results on Visuelle in terms of Weighted Mean Absolute Percentage Error (WAPE) and Mean Absolute Error (MAE). The lower the better for both metrics.", "list_citation_info": ["[19] G. Skenderi, C. Joppi, M. Denitto, and M. Cristani, “Well googled is half done: Multimodal forecasting of new fashion product sales with image-based google trends,” arXiv preprint arXiv:2109.09824, 2021.", "[22] J. H. Friedman, “Greedy function approximation: A gradient boosting machine.” The Annals of Statistics, vol. 29, no. 5, pp. 1189 – 1232, 2001. [Online]. Available: https://doi.org/10.1214/aos/1013203451", "[21] S. I. Papadopoulos, C. Koutlis, S. Papadopoulos, and I. Kompatsiaris, “Multimodal quasi-autoregression: Forecasting the visual popularity of new fashion products,” arXiv preprint arXiv:2204.04014, 2022.", "[20] C. Joppi, G. Skenderi, and M. Cristani, “Pop: Mining potential performance of new fashion products via webly cross-modal query expansion,” arXiv preprint arXiv:2207.11001, 2022.", "[16] V. Ekambaram, K. Manglik, S. Mukherjee, S. S. K. Sajja, S. Dwivedi, and V. Raykar, “Attention based multi-modal new product sales time-series forecasting,” in Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, 2020, pp. 3110–3118."]}], "citation_info_to_title": {"[20] C. Joppi, G. Skenderi, and M. Cristani, “Pop: Mining potential performance of new fashion products via webly cross-modal query expansion,” arXiv preprint arXiv:2207.11001, 2022.": "Pop: Mining potential performance of new fashion products via webly cross-modal query expansion", "[21] S. I. Papadopoulos, C. Koutlis, S. Papadopoulos, and I. Kompatsiaris, “Multimodal quasi-autoregression: Forecasting the visual popularity of new fashion products,” arXiv preprint arXiv:2204.04014, 2022.": "Multimodal quasi-autoregression: Forecasting the visual popularity of new fashion products", "[19] G. Skenderi, C. Joppi, M. Denitto, and M. Cristani, “Well googled is half done: Multimodal forecasting of new fashion product sales with image-based google trends,” arXiv preprint arXiv:2109.09824, 2021.": "Well googled is half done: Multimodal forecasting of new fashion product sales with image-based google trends", "[16] V. Ekambaram, K. Manglik, S. Mukherjee, S. S. K. Sajja, S. Dwivedi, and V. Raykar, “Attention based multi-modal new product sales time-series forecasting,” in Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining, 2020, pp. 3110–3118.": "Attention based multi-modal new product sales time-series forecasting", "[22] J. H. Friedman, “Greedy function approximation: A gradient boosting machine.” The Annals of Statistics, vol. 29, no. 5, pp. 1189 – 1232, 2001. [Online]. Available: https://doi.org/10.1214/aos/1013203451": "Greedy function approximation: A gradient boosting machine"}, "source_title_to_arxiv_id": {"Pop: Mining potential performance of new fashion products via webly cross-modal query expansion": "2207.11001"}}