{"title": "MVRackLay: Monocular Multi-View Layout Estimation for Warehouse Racks and Shelves", "abstract": "In this paper, we propose and showcase, for the first time, monocular\nmulti-view layout estimation for warehouse racks and shelves. Unlike typical\nlayout estimation methods, MVRackLay estimates multi-layered layouts, wherein\neach layer corresponds to the layout of a shelf within a rack. Given a sequence\nof images of a warehouse scene, a dual-headed Convolutional-LSTM architecture\noutputs segmented racks, the front and the top view layout of each shelf within\na rack. With minimal effort, such an output is transformed into a 3D rendering\nof all racks, shelves and objects on the shelves, giving an accurate 3D\ndepiction of the entire warehouse scene in terms of racks, shelves and the\nnumber of objects on each shelf. MVRackLay generalizes to a diverse set of\nwarehouse scenes with varying number of objects on each shelf, number of\nshelves and in the presence of other such racks in the background. Further,\nMVRackLay shows superior performance vis-a-vis its single view counterpart,\nRackLay, in layout accuracy, quantized in terms of the mean IoU and mAP\nmetrics. We also showcase a multi-view stitching of the 3D layouts resulting in\na representation of the warehouse scene with respect to a global reference\nframe akin to a rendering of the scene from a SLAM pipeline. To the best of our\nknowledge, this is the first such work to portray a 3D rendering of a warehouse\nscene in terms of its semantic components - Racks, Shelves and Objects - all\nfrom a single monocular camera.", "authors": ["Pranjali Pathre", "Anurag Sahu", "Ashwin Rao", "Avinash Prabhu", "Meher Shashwat Nigam", "Tanvi Karandikar", "Harit Pandya", "K. Madhava Krishna"], "published_date": "2022_11_30", "pdf_url": "http://arxiv.org/pdf/2211.16882v1", "list_table_and_caption": [{"table": "<p>Top ViewFront ViewRackBoxRackBoxMethodmIoUmAPmIoUmAPmIoUmAPmIoUmAPMVRackLay-Disc-4 (ours)96.4498.0186.8992.7094.9897.1488.0293.49MVRackLay-Disc-8 (ours)95.8498.1285.9888.35{93.78}{96.98}86.4988.76MVRackLay-4 (ours){95.94}97.94{86.66}{89.31}93.7396.58{86.72}{89.16}RackLay-D-disc{93.44}{94.98}{82.80}{85.47}{91.75}{93.10}83.2885.49PseudoLidar-PointRCNN[7]73.2877.4055.7781.26--63.0589.45MaskRCNN-GTdepth[5]--35.5747.44--76.4882.48</p>", "caption": "Table I: Quantitative results:We benchmark the 3 different versions of our network - MVRackLay-Disc-4, MVRackLay-Disc-8 and MVRackLay-4, along with three baselines- RackLay-D-disc[1] PseudoLidar-PointRCNN[10, 7] and MaskRCNN-GTdepth[5] (as described in Sec. V-B).", "list_citation_info": ["[10] Y. Wang, W.-L. Chao, et al., “Pseudo-lidar from visual depth estimation: Bridging the gap in 3d object detection for autonomous driving,” in CVPR, 2019.", "[5] K. He, G. Gkioxari, P. Dollár, and R. Girshick, “Maskrcnn,” in Proceedings of the IEEE international conference on computer vision, 2017, pp. 2961–2969.", "[1] M. S. Nigam, A. Prabhu, et al., Monocular Multi-Layer Layout Estimation for Warehouse Racks. New York, NY, USA: Association for Computing Machinery, 2021. [Online]. Available: https://doi.org/10.1145/3490035.3490263", "[7] S. Shi, X. Wang, and H. Li, “Pointrcnn: 3d object proposal generation and detection from point cloud,” in CVPR, 2019."]}], "citation_info_to_title": {"[10] Y. Wang, W.-L. Chao, et al., “Pseudo-lidar from visual depth estimation: Bridging the gap in 3d object detection for autonomous driving,” in CVPR, 2019.": "Pseudo-lidar from visual depth estimation: Bridging the gap in 3d object detection for autonomous driving", "[5] K. He, G. Gkioxari, P. Dollár, and R. Girshick, “Maskrcnn,” in Proceedings of the IEEE international conference on computer vision, 2017, pp. 2961–2969.": "Maskrcnn", "[7] S. Shi, X. Wang, and H. Li, “Pointrcnn: 3d object proposal generation and detection from point cloud,” in CVPR, 2019.": "Pointrcnn: 3D Object Proposal Generation and Detection from Point Cloud", "[1] M. S. Nigam, A. Prabhu, et al., Monocular Multi-Layer Layout Estimation for Warehouse Racks. New York, NY, USA: Association for Computing Machinery, 2021. [Online]. Available: https://doi.org/10.1145/3490035.3490263": "Monocular Multi-Layer Layout Estimation for Warehouse Racks"}, "source_title_to_arxiv_id": {"Monocular Multi-Layer Layout Estimation for Warehouse Racks": "2103.09174"}}