{"title": "Deep learning for table detection and structure recognition: A survey", "abstract": "Tables are everywhere, from scientific journals, papers, websites, and\nnewspapers all the way to items we buy at the supermarket. Detecting them is\nthus of utmost importance to automatically understanding the content of a\ndocument. The performance of table detection has substantially increased thanks\nto the rapid development of deep learning networks. The goals of this survey\nare to provide a profound comprehension of the major developments in the field\nof Table Detection, offer insight into the different methodologies, and provide\na systematic taxonomy of the different approaches. Furthermore, we provide an\nanalysis of both classic and new applications in the field. Lastly, the\ndatasets and source code of the existing models are organized to provide the\nreader with a compass on this vast literature. Finally, we go over the\narchitecture of utilizing various object detection and table structure\nrecognition methods to create an effective and efficient system, as well as a\nset of development trends to keep up with state-of-the-art algorithms and\nfuture research. We have also set up a public GitHub repository where we will\nbe updating the most recent publications, open data, and source code. The\nGitHub repository is available at\nhttps://github.com/abdoelsayed2016/table-detection-structure-recognition.", "authors": ["Mahmoud Kasem", "Abdelrahman Abdallah", "Alexander Berendeyev", "Ebrahem Elkady", "Mahmoud Abdalla", "Mohamed Mahmoud", "Mohamed Hamada", "Daniyar Nurseitov", "Islam Taj-Eddin"], "published_date": "2022_11_15", "pdf_url": "http://arxiv.org/pdf/2211.08469v1", "list_table_and_caption": [{"table": "<p>LiteratureMethodBenefitsDrawbacksA Gilanigilani2017table  Faster R-CNN  1) On scanned document pictures, this is thefirst deep learning-based table detection method.2) The object detection technique is made easierby converting RGB pixels to distance measures.  There are additional phasesin the pre-processing process. S Schreiberschreiber2017deepdesrt  transfer learning methods+ Faster R-CNN  end-to-end strategy for detecting tables andtable structures that is straightforwardand efficient  When compared to otherstate-of-the-art techniques,it is less accurate. SA Siddiqui siddiqui2018decnt  Deformable CNN +Faster R-CNN  Deformable convolutional neural networks’dynamic receptive field aids in the reconfigurationof multiple tabular boundries.  When compared to standardconvolutions, deformableconvolutions are computationallydemanding. SS Paliwal paliwal2019tablenet  Networks with fullyconvolutions  1) First attempt at combining a single solutionto handle both the problem of table detection andstructure recognition. 2) A comprehensive methodfor structure recognition and detection in documentpictures.  This approach only functions oncolumn detection when used fortable structure extraction. P Riba riba2019table  OCR-based Graph NN thatmakes use of textualcharacteristics  The suggested technique makes use of more datathan only spatial attributes.  1) No comparisons to other state-of-the-art strategies. 2) Additionalannotations are needed using thisstrategy in addition to the tabulardata. N Sun sun2019faster  Faster R-CNN +Locate corners  1) Better outcomes are obtained using a noveltechnique. 2) Faster R-CNN is used to identify notjust tables, but also the corners of tabular borders  1) It is necessary to do postprocessingoperations such as corner refining.2) Because of the additional detections,the computation is more involved. I Kavasidis kavasidis2019saliency  combination of deep CNNs,graphical models, andsaliency  1) Dilated convolutions rather than conventionalconvolutions are used. 2) Using this technique,saliency detection is performed in place of tabledetection.  To provide equivalent results, manyprocessing stages are necessary. M Holeček holevcek2019table  Graph NN + line itemidentification Method  This approach yields encouraging outcomes whenused to layout-intensive documents like invoicesand PDFs.  1) Limited baseline approach withoutcomparisons to other state-of-the-arttechniques 2) No publicly accessibletable datasets are used for theevaluation of the approach. Y Huang huang2019yolo  YOLO  In comparison, a quicker and more effectivestrategy  The suggested methodology relies ondata-driven post-processing methods. Y Li li2019gan  Generative Adversarial Networks(GAN)  For ruling and less ruled tables, the GAN-basedstrategy drives the network to extract comparablecharacteristics.  In document images with differenttabular layouts, the generator-basedmodel is susceptible. M Li li2020tablebank  Faster R-CNN  This method demonstrates how a basic FasterR-CNN can yield excellent results when usedwith a huge dataset like TableBank.  Just a simple Faster-RCNNimplementation D Prasad prasad2020cascadetabnet  Cascade mask Region-basedCNN High-ResolutionNetwork-based model  The study shows how iterative transfer learningmay be used to transform pictures, which canlessen the need on huge datasets.  The same asgilani2017table , There are additionalphases in the pre-processing process. Á Casado-García casado2020benefits  Liken fine-tuning +Mask R-CNN, RetinaNet, SSD and YOLO  Describe the advantages of using object detectionnetworks in conjunction with domain-specificfine-tuning techniques for table detection.  Closed domain fine-tuning is stillinsufficient to get state-of-the-artsolutions. M Agarwal agarwal2021cdec  multistage extension ofMask R-CNN with a dualbackbone  1) A comprehensive object detection-based frame-work utilizing a composite backbone to deliver state-of-the-art outcomes 2) Extensive tests on benchmarkdatasets for table detection that are openly accessible.  The technique is computationallyexpensive since it uses a compositebackbone in addition to deformableconvolutions. X Zheng zheng2021global  Global Table Extractor(GTE) which is generalmethod for object detection  1) The problem of table detection is benefited by theextra piece-wise constraint loss introduced. 2) acomplete method that is compatible with all objectdetection frameworks.  Annotations for cellular borders arenecessary since the process of tabledetection depends on cell detection. </p>", "caption": "Table 2: A comparison of the benefits and drawbacks of several deep learning-based table detection methods", "list_citation_info": ["(22) A. Gilani, S. R. Qasim, I. Malik, F. Shafait, Table detection using deep learning, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 771–776.", "(101) M. Holeček, A. Hoskovec, P. Baudiš, P. Klinger, Table understanding in structured documents, in: 2019 International Conference on Document Analysis and Recognition Workshops (ICDARW), Vol. 5, IEEE, 2019, pp. 158–164.", "(98) S. A. Siddiqui, M. I. Malik, S. Agne, A. Dengel, S. Ahmed, Decnt: Deep deformable cnn for table detection, IEEE access 6 (2018) 74151–74161.", "(104) Y. Li, L. Gao, Z. Tang, Q. Yan, Y. Huang, A gan-based feature generator for table detection, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 763–768.", "(61) M. Li, L. Cui, S. Huang, F. Wei, M. Zhou, Z. Li, Tablebank: Table benchmark for image-based table detection and recognition, in: Proceedings of the 12th Language Resources and Evaluation Conference, 2020, pp. 1918–1925.", "(54) P. Riba, A. Dutta, L. Goldmann, A. Fornés, O. Ramos, J. Lladós, Table detection in invoice documents by graph neural networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 122–127.", "(102) Á. Casado-García, C. Domínguez, J. Heras, E. Mata, V. Pascual, The benefits of close-domain fine-tuning for table detection in document images, in: International workshop on document analysis systems, Springer, 2020, pp. 199–215.", "(96) S. S. Paliwal, D. Vishwanath, R. Rahul, M. Sharma, L. Vig, Tablenet: Deep learning model for end-to-end table detection and tabular data extraction from scanned document images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 128–133.", "(100) I. Kavasidis, C. Pino, S. Palazzo, F. Rundo, D. Giordano, P. Messina, C. Spampinato, A saliency-based convolutional neural network for table and chart detection in digitized documents, in: International conference on image analysis and processing, Springer, 2019, pp. 292–302.", "(103) X. Zheng, D. Burdick, L. Popa, X. Zhong, N. X. R. Wang, Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context, in: Proceedings of the IEEE/CVF winter conference on applications of computer vision, 2021, pp. 697–706.", "(99) N. Sun, Y. Zhu, X. Hu, Faster r-cnn based table detection combining corner locating, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1314–1319.", "(97) Y. Huang, Q. Yan, Y. Li, Y. Chen, X. Wang, L. Gao, Z. Tang, A yolo-based table detection method, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 813–818.", "(20) S. Schreiber, S. Agne, I. Wolf, A. Dengel, S. Ahmed, Deepdesrt: Deep learning for detection and structure recognition of tables in document images, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 1162–1167.", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.", "(92) M. Agarwal, A. Mondal, C. Jawahar, Cdec-net: Composite deformable cascade network for table detection in document images, in: 2020 25th International Conference on Pattern Recognition (ICPR), IEEE, 2021, pp. 9491–9498."]}, {"table": "<p>LiteratureMethodBenefitsDrawbacksSF Rashid rashid2017table  Uses the geometric pos-ition of words + A neu-ral network model(autoMLP)  No reliance on complex layout analysisMechanism. Can be used on the diverse setof documents with different layouts  limitation is in marking columnsboundaries due to variations inthe number of words in eachcolumn E Koci koci2018table  Encoding of spatial inter-relations between theseregions using a graph rep-resentation, as well asrules and heuristics  1) Recognition for single-table and multi-table spreadsheets. 2) No reliance on anyassumptions with what regards the arran-gement of tables  Tables with few columns andempty cells are not handledwell. SA Siddiqui siddiqui2019deeptabstr  deformable CNN+ Faster R-CNN  1) The use of deformable convolution canhandle various tabular structures. 2) rel-eased a new dataset that contained tablestructure data.  The tables in the proposedapproach won’t operate co-rrectly if they have a row a-nd column span. SA Siddiqui siddiqui2019rethinking  Fully CNNs  The complexity of the task of identifying t-able structures is reduced by the proposedprediction tiling approach.  1) Additional post-processing p-rocesses are necessary when ro-ws or columns are excessivelyfragmented. 2) The technique isbased on the tabular structures’consistency assumption. SR Qasim qasim2019rethinking  Graph NN + CNN  1) This paper also presents a unique, memory-efficient training strategy based on Monte Ca-rlo. 2) The suggested approach makes use ofboth textual and spatial characteristics.  The publicly accessible tabledatasets are not used to testthe system. W Xue xue2019res2tim  Graph NN + weightsdepending on distance  For the cell relationship network, the classimbalance issue is solved using the distance-based weighting method.  When dealing with sparse tab-les, the approach is insecure. C Tensmeyer tensmeyer2019deep  Dilated Convolutions+ Fully CNN  The technique is effective with both scannedand PDF document images.  The post-processing heuristicsdetermine how the merging p-ortion of the method works. SA Khan khan2019table  RNN  The reduced receptive field of CNNs is solvedby the bi-directional GRU.  Pre-processing procedures includingbinarization, noise reduction, andmorphological modification are ne-cessary. P Riba riba2019table  Graph Neural Networksapproach  1) It is not constrained to rigid tabular lay-outs in terms of single rows, columns or pr-esence of rule lines. 2) The model is langua-ge independent  1) The method may have problemswhen dealing with border cond-itions. 2) There is a small amountof training data in the RVL-CDIPdataset and F1, Precision and Re-call metrics are lower than othermethods. Y Deng deng2019challenges  Encoder decoder net  1) In the work that is given, issues with end-to-end table recognition are examined. 2) Mad-e a contribution with yet another sizable data-set in the area of table comprehension.  The other publicly accessibletable recognition datasets are notused to assess the suggested base-line technique. E Koci koci2019genetic  Graph model + Appl-ication of genetic-basedapproaches  Requires little to no involvement of domainexperts  The accuracy of GE depends onthe number of edges. Specifica-lly, we determined that GE ach-ieves an accuracy of only 19%for multi-table graphs D Prasad prasad2020cascadetabnet  Cascade mask Reg-ionbased CNN High-Resolution Network-based model  Direct regression occurs at cellular bound-aries using an end-to-end method.  Tables with/out ruling lin-es must undergo furtherpost-processing. S Raja raja2020table  Mask R-CNN +ResNet-101 basedNet  1) An additional alignment loss is sugges-ted for precise cell detection. 2) A train-able top-down for cell identification andbottom-up for structure recognition coll-ection is proposed.  When cells are empty, thestrategy is weak. </p>", "caption": "Table 3: A comparison of the benefits and drawbacks of several deep learning-based table Structure recognition methods", "list_citation_info": ["(112) S. A. Siddiqui, P. I. Khan, A. Dengel, S. Ahmed, Rethinking semantic segmentation for table structure recognition in documents, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1397–1402.", "(114) S. F. Rashid, A. Akmal, M. Adnan, A. A. Aslam, A. Dengel, Table recognition in heterogeneous documents using machine learning, in: 2017 14th IAPR International conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 777–782.", "(54) P. Riba, A. Dutta, L. Goldmann, A. Fornés, O. Ramos, J. Lladós, Table detection in invoice documents by graph neural networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 122–127.", "(120) C. Tensmeyer, V. I. Morariu, B. Price, S. Cohen, T. Martinez, Deep splitting and merging for table structure decomposition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 114–121.", "(119) W. Xue, Q. Li, D. Tao, Res2tim: Reconstruct syntactic structures from table images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 749–755.", "(113) S. A. Khan, S. M. D. Khalid, M. A. Shahzad, F. Shafait, Table structure extraction with bi-directional gated recurrent unit networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1366–1371.", "(51) S. A. Siddiqui, I. A. Fateh, S. T. R. Rizvi, A. Dengel, S. Ahmed, Deeptabstr: deep learning based table structure recognition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1403–1409.", "(52) Y. Deng, D. Rosenberg, G. Mann, Challenges in end-to-end neural scientific table recognition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 894–901.", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.", "(111) E. Koci, M. Thiele, O. Romero, W. Lehner, A genetic-based search for adaptive table recognition in spreadsheets, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1274–1279.", "(115) S. R. Qasim, H. Mahmood, F. Shafait, Rethinking table recognition using graph neural networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 142–147.", "(116) S. Raja, A. Mondal, C. Jawahar, Table structure recognition using top-down and bottom-up cues, in: European Conference on Computer Vision, Springer, 2020, pp. 70–86.", "(110) E. Koci, M. Thiele, W. Lehner, O. Romero, Table recognition in spreadsheets via a graph representation, in: 2018 13th IAPR International Workshop on Document Analysis Systems (DAS), IEEE, 2018, pp. 139–144."]}, {"table": "<p>LiteratureMethodBenefitsDrawbacksB Xiao xiao2022table  cells’ bounding boxes+ conditional attentionnetwork  Only utilizes visual features without any meta-data  1) Assumes that the coordinatesof cells in the table are known.2) Difficulties with tables with-out borders Y Zou zou2020deep  Fully CNNs  1) Using linked component analysis enhancesthe outcomes. 2) In a table, cells are segmen-ted in addition to the rows and columns.  To provide comparison findings,a small number of post-process-ing procedures utilizing specificalgorithms are necessary. X Zhong zhong2020image  Dual decoder withattention-based enc-oding  1) To assess table recognition techniques, themethodology offers a unique evaluation metriccalled TEDS. 2) released a huge table dataset.  The technique cannot be readilycompared to other state-of-the-art techniques. KA Hashmi hashmi2021guided  Utilizing an optimi-zation technique foranchors+ Mask R-CNN  Networks of region proposals converge mo-re quickly and effectively thanks to optim-ized anchoring.  This study relies on the preliminary pre-processing phaseof clustering the ground truthto find appropriate anchors. A Zucker zucker2021clusti  Character Region Awarenessfor Text Detection (CRAFT)and Density-Based SpatialClustering of Applicationswith Noise (DBSCAN)  A bottom-up method, which emphasizes thatthe table structure is formed by relative pos-itions of text cells, and not by inherent bou-ndaries  Cannot handle spreading rowsor columns well X Zheng zheng2021global  Method for objectdetecting generally  An additional innovative cluster-based technique combined with a hierarchical networkto detect tabular forms.  Accurately classifying a tableis a prerequisite for final cellstructure identification. Z Zhang zhang2022split  A combination of fully convo-lutional network (FCN)+ RoI-Align + the pretrained BERTmodel + Gated Recurrent Unit(GRU) decoder  Directly operates on table images with nodependency on meta-information, can pro-cess simple and complex tables  Oversegments tables when spacebetween cells is large, doesn’thandle merged cells well M Namysl namysl2022flexible  Rule-based algorithms +graph-based table inter-pretation method  1) Approach allows processing images anddigital documents. 2) Processing steps canbe adapted separately  1) Support the most frequent ta-ble formats only. Reliance on thepresence of predefined keywords.2) Prone to the errors propagatedfrom the upstream componentsof system. 3) Focus on the ta-bles with rulings A Nassar nassar2022tableformer  End-to-end neural network+ CNN Backbone + tran-sformer based layers  1) Handles different languages without beingtrained on them. 2) Predicts tables structureand bounding boxes for the table content  Work with PDF documents A Jain jain2022tsr  spatial associations + dyna-mic programming techniques  Recognizing complex table structures havingmulti-span rows/columns and missing cells  Uses OCR to read words fromimages Not language agnostic S Raja raja2022visual  object detection  Better detection of empty cells  Fails for very sparse tables wh-ere most of the cells are empty </p>", "caption": "Table 4: A comparison of the benefits and drawbacks of several deep learning-based table Structure recognition methods (continue Table 3)", "list_citation_info": ["(121) S. Raja, A. Mondal, C. Jawahar, Visual understanding of complex table structures from document images, in: Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision, 2022, pp. 2299–2308.", "(109) M. Namysl, A. M. Esser, S. Behnke, J. Köhler, Flexible table recognition and semantic interpretation system., in: VISIGRAPP (4: VISAPP), 2022, pp. 27–37.", "(118) K. A. Hashmi, D. Stricker, M. Liwicki, M. N. Afzal, M. Z. Afzal, Guided table structure recognition through anchor optimization, IEEE Access 9 (2021) 113521–113534.", "(125) A. Jain, S. Paliwal, M. Sharma, L. Vig, Tsr-dsaw: Table structure recognition via deep spatial association of words, arXiv preprint arXiv:2203.06873 (2022).", "(103) X. Zheng, D. Burdick, L. Popa, X. Zhong, N. X. R. Wang, Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context, in: Proceedings of the IEEE/CVF winter conference on applications of computer vision, 2021, pp. 697–706.", "(107) A. Zucker, Y. Belkada, H. Vu, V. N. Nguyen, Clusti: Clustering method for table structure recognition in scanned images, Mobile Networks and Applications 26 (4) (2021) 1765–1776.", "(108) Z. Zhang, J. Zhang, J. Du, F. Wang, Split, embed and merge: An accurate table structure recognizer, Pattern Recognition 126 (2022) 108565.", "(66) X. Zhong, E. ShafieiBavani, A. Jimeno Yepes, Image-based table recognition: data, model, and evaluation, in: European Conference on Computer Vision, Springer, 2020, pp. 564–580.", "(117) Y. Zou, J. Ma, A deep semantic segmentation model for image-based table structure recognition, in: 2020 15th IEEE International Conference on Signal Processing (ICSP), Vol. 1, IEEE, 2020, pp. 274–280.", "(68) A. Nassar, N. Livathinos, M. Lysak, P. Staar, Tableformer: Table structure understanding with transformers, in: Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2022, pp. 4614–4623.", "(124) B. Xiao, M. Simsek, B. Kantarci, A. A. Alkheir, Table structure recognition with conditional attention, arXiv preprint arXiv:2203.03819 (2022)."]}, {"table": "<p>ApproachDatasetMethodIoUYear50%55%60%65%70%75%80%85%90%95%50%:95%Tesseract shafait2010table UNLVTab-stop DetectionPrecision--------86.00--2010Recall--------79.00--F1-Score--------82.35--A Gilanigilani2017table UNLVFaster R-CNNPrecision--------82.30--2017Recall--------90.67--F1-Score--------86.29--SA Siddiquisiddiqui2018decnt UNLV Deformable CNN+ Faster R-CNN Precision78.6----------2018Recall74.9----------F1-Score76.7----------Á Casado-Garcíacasado2020benefits UNLVYOLOPrecision--93.0-92.0-83.0-48.0--2020Recall--95.0-94.0-85.0-49.0--F1-Score--94.0-93.0-84.0-49.0--M Agarwal agarwal2021cdec UNLV  Cascade maskR-CNN  Precision96.0-94.4-91.5-82.6-61.8--2018Recall77.0-75.8-73.4-66.3-49.6--F1-Score86.5-85.1-82.5-74.4-55.7--S Schreiberschreiber2017deepdesrt ICDAR2013Mask R-CNNPrecision97.40----------2017Recall96.15----------F1-Score96.77----------SA Siddiquisiddiqui2019deeptabstr ICDAR2013 Deformable CNN Precision99.6----------2018Recall99.6----------F1-Score99.6----------I Kavasidiskavasidis2019saliency ICDAR2013 Semantic ImageSegmentation Precision97.5----------2019Recall98.1----------F1-Score97.8----------Y Huanghuang2019yolo ICDAR2013 YOLO Precision100-98.6---89.2----2019Recall94.9-93.6---84.6----F1-Score97.3-96.1---86.8----SS Paliwalpaliwal2019tablenet ICDAR2013 fully convolutions Precision96.97----------2019Recall96.28----------F1-Score96.62----------Á Casado-Garcíacasado2020benefits ICDAR2013Mask R-CNNPrecision--70.0-70.0-70.0-47.0--2020Recall--97.0-97.0-97.0-65.0--F1-Score--81.0-81.0-81.0-54.0--D Prasadprasad2020cascadetabnet ICDAR2013  Cascade maskR-CNN HRNet  Precision100----------2020Recall100----------F1-Score100----------M Lili2020tablebank ICDAR2013 Faster R-CNN Precision96.58----------2020Recall95.94----------F1-Score96.25----------M Agarwal agarwal2021cdec ICDAR2013  Cascade maskR-CNN  Precision100.0-100.0-98.7-94.2-66.0--2021Recall100.0-100.0-98.7-94.2-66.0--F1-Score100.0-100.0-98.7-94.2-66.0--X Zhengzheng2021global ICDAR2013  object detectionnetworks  Precision98.97----------2021Recall99.77----------F1-Score99.31----------SA Siddiquisiddiqui2019deeptabstr ICDAR2017 Deformable CNN Precision--96.5---96.7----2018Recall--97.1---93.7----F1-Score--96.8---95.2----Y Huanghuang2019yolo ICDAR2017 YOLO Precision--97.8---97.5----2019Recall--97.2---96.8----F1-Score--97.5---97.1----</p>", "caption": "Table 16: Table detection", "list_citation_info": ["(102) Á. Casado-García, C. Domínguez, J. Heras, E. Mata, V. Pascual, The benefits of close-domain fine-tuning for table detection in document images, in: International workshop on document analysis systems, Springer, 2020, pp. 199–215.", "(22) A. Gilani, S. R. Qasim, I. Malik, F. Shafait, Table detection using deep learning, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 771–776.", "(98) S. A. Siddiqui, M. I. Malik, S. Agne, A. Dengel, S. Ahmed, Decnt: Deep deformable cnn for table detection, IEEE access 6 (2018) 74151–74161.", "(61) M. Li, L. Cui, S. Huang, F. Wei, M. Zhou, Z. Li, Tablebank: Table benchmark for image-based table detection and recognition, in: Proceedings of the 12th Language Resources and Evaluation Conference, 2020, pp. 1918–1925.", "(100) I. Kavasidis, C. Pino, S. Palazzo, F. Rundo, D. Giordano, P. Messina, C. Spampinato, A saliency-based convolutional neural network for table and chart detection in digitized documents, in: International conference on image analysis and processing, Springer, 2019, pp. 292–302.", "(96) S. S. Paliwal, D. Vishwanath, R. Rahul, M. Sharma, L. Vig, Tablenet: Deep learning model for end-to-end table detection and tabular data extraction from scanned document images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 128–133.", "(103) X. Zheng, D. Burdick, L. Popa, X. Zhong, N. X. R. Wang, Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context, in: Proceedings of the IEEE/CVF winter conference on applications of computer vision, 2021, pp. 697–706.", "(51) S. A. Siddiqui, I. A. Fateh, S. T. R. Rizvi, A. Dengel, S. Ahmed, Deeptabstr: deep learning based table structure recognition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1403–1409.", "(97) Y. Huang, Q. Yan, Y. Li, Y. Chen, X. Wang, L. Gao, Z. Tang, A yolo-based table detection method, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 813–818.", "(20) S. Schreiber, S. Agne, I. Wolf, A. Dengel, S. Ahmed, Deepdesrt: Deep learning for detection and structure recognition of tables in document images, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 1162–1167.", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.", "(88) F. Shafait, R. Smith, Table detection in heterogeneous documents, in: Proceedings of the 9th IAPR International Workshop on Document Analysis Systems, 2010, pp. 65–72.", "(92) M. Agarwal, A. Mondal, C. Jawahar, Cdec-net: Composite deformable cascade network for table detection in document images, in: 2020 25th International Conference on Pattern Recognition (ICPR), IEEE, 2021, pp. 9491–9498."]}, {"table": "<p>ApproachDatasetMethodIoUYear50%55%60%65%70%75%80%85%90%95%50%:95%Y Lili2019gan ICDAR2017  Generative AdversarialNetworks(GAN)  Precision--94.4---90.3----2019Recall--94.4---90.3----F1-Score--94.4---90.3----N Sun sun2019faster ICDAR2017Faster R-CNNPrecision------94.3----2019Recall------95.6----F1-Score------94.9----Á Casado-Garcíacasado2020benefits ICDAR2017RetinaNetPrecision--92.0-92.0-89.0-79.0--2020Recall--87.0-87.0-84.0-75.0--F1-Score--89.0-89.0-86.0-77.0--M Agarwal agarwal2021cdec ICDAR2017  Cascade maskR-CNN  Precision--96.9--------2021Recall--89.9--------F1-Score--93.4--------D Prasadprasad2020cascadetabnet ICDAR2019  Cascade maskR-CNN HRNet  Precision-----------2020Recall-----------F1-Score--94.3-93.4-92.5-90.1--M Agarwal agarwal2021cdec ICDAR2019  Cascade maskR-CNN  Precision98.7-98.0-97.7-97.1-93.4--2021Recall94.6-93.9-93.6-93.0-89.5--F1-Score96.6-95.9-95.6-95.0-91.5--X Zhengzheng2021global ICDAR2019  object detectionnetworks  Precision------96.0-90.0--2021Recall------95.0-89.0--F1-Score------95.5-95.5--SA Siddiquisiddiqui2018decnt Mormot Deformable CNN Precision84.9----------2018Recall94.6----------F1-Score89.5----------M Agarwal agarwal2021cdec TableBank  Cascade maskR-CNN  Precision93.4-99.5--------2021Recall92.4-97.8--------F1-Score92.9-98.6--------P Riba riba2019table RVL-CDIPGraph NNPrecision15.2----------2019Recall36.5----------F1-Score21.5----------</p>", "caption": "Table 17: Table detection (Continue Table 16)", "list_citation_info": ["(102) Á. Casado-García, C. Domínguez, J. Heras, E. Mata, V. Pascual, The benefits of close-domain fine-tuning for table detection in document images, in: International workshop on document analysis systems, Springer, 2020, pp. 199–215.", "(104) Y. Li, L. Gao, Z. Tang, Q. Yan, Y. Huang, A gan-based feature generator for table detection, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 763–768.", "(98) S. A. Siddiqui, M. I. Malik, S. Agne, A. Dengel, S. Ahmed, Decnt: Deep deformable cnn for table detection, IEEE access 6 (2018) 74151–74161.", "(54) P. Riba, A. Dutta, L. Goldmann, A. Fornés, O. Ramos, J. Lladós, Table detection in invoice documents by graph neural networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 122–127.", "(103) X. Zheng, D. Burdick, L. Popa, X. Zhong, N. X. R. Wang, Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context, in: Proceedings of the IEEE/CVF winter conference on applications of computer vision, 2021, pp. 697–706.", "(99) N. Sun, Y. Zhu, X. Hu, Faster r-cnn based table detection combining corner locating, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1314–1319.", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.", "(92) M. Agarwal, A. Mondal, C. Jawahar, Cdec-net: Composite deformable cascade network for table detection in document images, in: 2020 25th International Conference on Pattern Recognition (ICPR), IEEE, 2021, pp. 9491–9498."]}, {"table": "<p>ApproachDatasetMethodIoUYear50%55%60%65%70%75%80%85%90%95%50%:95%S Schreiberschreiber2017deepdesrt ICDAR2013Fully CNNPrecision95.93----------2017Recall87.36----------F1-Score91.44----------SA Siddiquisiddiqui2019deeptabstr ICDAR2013Deformable CNNPrecision93.19----------2019Recall93.08----------F1-Score92.98----------W Xuexue2019res2tim ICDAR2013 Graph NN + weightsdepending on distance Precision92.6----------2019Recall44.7----------F1-Score60.3----------SS Paliwalpaliwal2019tablenet ICDAR2013 fully CNN Precision92.15----------2019Recall89.87----------F1-Score90.98----------SA Khankhan2019table ICDAR2013 Bi-directional RNN Precision96.92----------2019Recall90.12----------F1-Score93.39----------C Tensmeyertensmeyer2019deep ICDAR2013 Dilated Convolutions+ Fully CNN Precision95.8----------2019Recall94.6----------F1-Score95.2----------Z Chichi2019complicated ICDAR2013 Fully CNN Precision88.5----------2019Recall86.0----------F1-Score87.2----------Á Casado-Garcíacasado2020benefits ICDAR2013Mask R-CNNPrecision--70.0-70.0-70.0-47.0--2020Recall--97.0-97.0-97.0-65.0--F1-Score--81.0-81.0-81.0-54.0--S Rajaraja2020table ICDAR2013 Object Detection Methods Precision92.7----------2020Recall91.1----------F1-Score91.9----------KA Hashmihashmi2021guided ICDAR2013 Object Detection Methods Precision95.37----------2021Recall95.56----------F1-Score95.46----------D Prasadprasad2020cascadetabnet ICDAR2019 Object Detection Methods Precision-----------2020Recall-----------F1-Score--43.8-35.4-19.0-3.6--Y Zouzou2020deep ICDAR2019 Fully CNN Precision--18.79---1.71----2021Recall--10.07---0.92----F1-Score--13.11---1.19----X Zhengzheng2021global ICDAR2019 Object Detection Methods Precision-----------2021Recall-----------F1-Score54.8-38.5--------</p>", "caption": "Table 18: Table Structure Recognition", "list_citation_info": ["(102) Á. Casado-García, C. Domínguez, J. Heras, E. Mata, V. Pascual, The benefits of close-domain fine-tuning for table detection in document images, in: International workshop on document analysis systems, Springer, 2020, pp. 199–215.", "(118) K. A. Hashmi, D. Stricker, M. Liwicki, M. N. Afzal, M. Z. Afzal, Guided table structure recognition through anchor optimization, IEEE Access 9 (2021) 113521–113534.", "(96) S. S. Paliwal, D. Vishwanath, R. Rahul, M. Sharma, L. Vig, Tablenet: Deep learning model for end-to-end table detection and tabular data extraction from scanned document images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 128–133.", "(120) C. Tensmeyer, V. I. Morariu, B. Price, S. Cohen, T. Martinez, Deep splitting and merging for table structure decomposition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 114–121.", "(117) Y. Zou, J. Ma, A deep semantic segmentation model for image-based table structure recognition, in: 2020 15th IEEE International Conference on Signal Processing (ICSP), Vol. 1, IEEE, 2020, pp. 274–280.", "(103) X. Zheng, D. Burdick, L. Popa, X. Zhong, N. X. R. Wang, Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context, in: Proceedings of the IEEE/CVF winter conference on applications of computer vision, 2021, pp. 697–706.", "(113) S. A. Khan, S. M. D. Khalid, M. A. Shahzad, F. Shafait, Table structure extraction with bi-directional gated recurrent unit networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1366–1371.", "(51) S. A. Siddiqui, I. A. Fateh, S. T. R. Rizvi, A. Dengel, S. Ahmed, Deeptabstr: deep learning based table structure recognition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1403–1409.", "(20) S. Schreiber, S. Agne, I. Wolf, A. Dengel, S. Ahmed, Deepdesrt: Deep learning for detection and structure recognition of tables in document images, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 1162–1167.", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.", "(119) W. Xue, Q. Li, D. Tao, Res2tim: Reconstruct syntactic structures from table images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 749–755.", "(116) S. Raja, A. Mondal, C. Jawahar, Table structure recognition using top-down and bottom-up cues, in: European Conference on Computer Vision, Springer, 2020, pp. 70–86.", "(64) Z. Chi, H. Huang, H.-D. Xu, H. Yu, W. Yin, X.-L. Mao, Complicated table structure recognition, arXiv preprint arXiv:1908.04729 (2019)."]}, {"table": "<p>ArticleModelYearFrameworkLinkZ Chi chi2019complicated SciTSR2019Pytorchhttps://github.com/Academic-Hammer/SciTSRD Prasad prasad2020cascadetabnet CascadeTabNet2020Pytorchhttps://github.com/DevashishPrasad/CascadeTabNetÁ Casado-García casado2020benefits -2020mxnethttps://github.com/holms-ur/fine-tuningM Li prasad2020cascadetabnet TableBank2020Pytorch, Detectron2https://github.com/doc-analysis/TableBankS Raja S Raja raja2020table TabStructNet2020tensorflowhttps://github.com/sachinraja13/TabStructNet.gitX Zhong zhong2020image PubTabNet2020-https://github.com/ibm-aur-nlp/PubTabNetM Agarwal agarwal2021cdec CDeC-Net2021PyTorchhttps://github.com/mdv3101/CDeCNet</p>", "caption": "Table 19:  Open source code for most of the studies articles in Table Detection ", "list_citation_info": ["(102) Á. Casado-García, C. Domínguez, J. Heras, E. Mata, V. Pascual, The benefits of close-domain fine-tuning for table detection in document images, in: International workshop on document analysis systems, Springer, 2020, pp. 199–215.", "(66) X. Zhong, E. ShafieiBavani, A. Jimeno Yepes, Image-based table recognition: data, model, and evaluation, in: European Conference on Computer Vision, Springer, 2020, pp. 564–580.", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.", "(116) S. Raja, A. Mondal, C. Jawahar, Table structure recognition using top-down and bottom-up cues, in: European Conference on Computer Vision, Springer, 2020, pp. 70–86.", "(64) Z. Chi, H. Huang, H.-D. Xu, H. Yu, W. Yin, X.-L. Mao, Complicated table structure recognition, arXiv preprint arXiv:1908.04729 (2019).", "(92) M. Agarwal, A. Mondal, C. Jawahar, Cdec-net: Composite deformable cascade network for table detection in document images, in: 2020 25th International Conference on Pattern Recognition (ICPR), IEEE, 2021, pp. 9491–9498."]}], "citation_info_to_title": {"(64) Z. Chi, H. Huang, H.-D. Xu, H. Yu, W. Yin, X.-L. Mao, Complicated table structure recognition, arXiv preprint arXiv:1908.04729 (2019).": "Complicated table structure recognition", "(121) S. Raja, A. Mondal, C. Jawahar, Visual understanding of complex table structures from document images, in: Proceedings of the IEEE/CVF Winter Conference on Applications of Computer Vision, 2022, pp. 2299–2308.": "Visual understanding of complex table structures from document images", "(98) S. A. Siddiqui, M. I. Malik, S. Agne, A. Dengel, S. Ahmed, Decnt: Deep deformable cnn for table detection, IEEE access 6 (2018) 74151–74161.": "Decnt: Deep Deformable CNN for Table Detection", "(102) Á. Casado-García, C. Domínguez, J. Heras, E. Mata, V. Pascual, The benefits of close-domain fine-tuning for table detection in document images, in: International workshop on document analysis systems, Springer, 2020, pp. 199–215.": "The benefits of close-domain fine-tuning for table detection in document images", "(113) S. A. Khan, S. M. D. Khalid, M. A. Shahzad, F. Shafait, Table structure extraction with bi-directional gated recurrent unit networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1366–1371.": "Table structure extraction with bi-directional gated recurrent unit networks", "(52) Y. Deng, D. Rosenberg, G. Mann, Challenges in end-to-end neural scientific table recognition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 894–901.": "Challenges in end-to-end neural scientific table recognition", "(95) D. Prasad, A. Gadpal, K. Kapadni, M. Visave, K. Sultanpure, Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents, in: Proceedings of the IEEE/CVF conference on computer vision and pattern recognition workshops, 2020, pp. 572–573.": "Cascadetabnet: An approach for end to end table detection and structure recognition from image-based documents", "(117) Y. Zou, J. Ma, A deep semantic segmentation model for image-based table structure recognition, in: 2020 15th IEEE International Conference on Signal Processing (ICSP), Vol. 1, IEEE, 2020, pp. 274–280.": "A deep semantic segmentation model for image-based table structure recognition", "(104) Y. Li, L. Gao, Z. Tang, Q. Yan, Y. Huang, A gan-based feature generator for table detection, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 763–768.": "A gan-based feature generator for table detection", "(101) M. Holeček, A. Hoskovec, P. Baudiš, P. Klinger, Table understanding in structured documents, in: 2019 International Conference on Document Analysis and Recognition Workshops (ICDARW), Vol. 5, IEEE, 2019, pp. 158–164.": "Table Understanding in Structured Documents", "(109) M. Namysl, A. M. Esser, S. Behnke, J. Köhler, Flexible table recognition and semantic interpretation system., in: VISIGRAPP (4: VISAPP), 2022, pp. 27–37.": "Flexible table recognition and semantic interpretation system", "(103) X. Zheng, D. Burdick, L. Popa, X. Zhong, N. X. R. Wang, Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context, in: Proceedings of the IEEE/CVF winter conference on applications of computer vision, 2021, pp. 697–706.": "Global table extractor (gte): A framework for joint table identification and cell structure recognition using visual context", "(107) A. Zucker, Y. Belkada, H. Vu, V. N. Nguyen, Clusti: Clustering method for table structure recognition in scanned images, Mobile Networks and Applications 26 (4) (2021) 1765–1776.": "Clusti: Clustering method for table structure recognition in scanned images", "(100) I. Kavasidis, C. Pino, S. Palazzo, F. Rundo, D. Giordano, P. Messina, C. Spampinato, A saliency-based convolutional neural network for table and chart detection in digitized documents, in: International conference on image analysis and processing, Springer, 2019, pp. 292–302.": "A saliency-based convolutional neural network for table and chart detection in digitized documents", "(97) Y. Huang, Q. Yan, Y. Li, Y. Chen, X. Wang, L. Gao, Z. Tang, A yolo-based table detection method, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 813–818.": "A yolo-based table detection method", "(125) A. Jain, S. Paliwal, M. Sharma, L. Vig, Tsr-dsaw: Table structure recognition via deep spatial association of words, arXiv preprint arXiv:2203.06873 (2022).": "Tsr-dsaw: Table structure recognition via deep spatial association of words", "(110) E. Koci, M. Thiele, W. Lehner, O. Romero, Table recognition in spreadsheets via a graph representation, in: 2018 13th IAPR International Workshop on Document Analysis Systems (DAS), IEEE, 2018, pp. 139–144.": "Table recognition in spreadsheets via a graph representation", "(114) S. F. Rashid, A. Akmal, M. Adnan, A. A. Aslam, A. Dengel, Table recognition in heterogeneous documents using machine learning, in: 2017 14th IAPR International conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 777–782.": "Table recognition in heterogeneous documents using machine learning", "(112) S. A. Siddiqui, P. I. Khan, A. Dengel, S. Ahmed, Rethinking semantic segmentation for table structure recognition in documents, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1397–1402.": "Rethinking semantic segmentation for table structure recognition in documents", "(99) N. Sun, Y. Zhu, X. Hu, Faster r-cnn based table detection combining corner locating, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1314–1319.": "Faster r-cnn based table detection combining corner locating", "(66) X. Zhong, E. ShafieiBavani, A. Jimeno Yepes, Image-based table recognition: data, model, and evaluation, in: European Conference on Computer Vision, Springer, 2020, pp. 564–580.": "Image-based table recognition: data, model, and evaluation", "(108) Z. Zhang, J. Zhang, J. Du, F. Wang, Split, embed and merge: An accurate table structure recognizer, Pattern Recognition 126 (2022) 108565.": "Split, embed and merge: An accurate table structure recognizer", "(51) S. A. Siddiqui, I. A. Fateh, S. T. R. Rizvi, A. Dengel, S. Ahmed, Deeptabstr: deep learning based table structure recognition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1403–1409.": "Deep Learning Based Table Structure Recognition", "(115) S. R. Qasim, H. Mahmood, F. Shafait, Rethinking table recognition using graph neural networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 142–147.": "Rethinking table recognition using graph neural networks", "(22) A. Gilani, S. R. Qasim, I. Malik, F. Shafait, Table detection using deep learning, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 771–776.": "Table Detection Using Deep Learning", "(92) M. Agarwal, A. Mondal, C. Jawahar, Cdec-net: Composite deformable cascade network for table detection in document images, in: 2020 25th International Conference on Pattern Recognition (ICPR), IEEE, 2021, pp. 9491–9498.": "Cdec-net: Composite Deformable Cascade Network for Table Detection in Document Images", "(54) P. Riba, A. Dutta, L. Goldmann, A. Fornés, O. Ramos, J. Lladós, Table detection in invoice documents by graph neural networks, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 122–127.": "Table detection in invoice documents by graph neural networks", "(120) C. Tensmeyer, V. I. Morariu, B. Price, S. Cohen, T. Martinez, Deep splitting and merging for table structure decomposition, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 114–121.": "Deep splitting and merging for table structure decomposition", "(96) S. S. Paliwal, D. Vishwanath, R. Rahul, M. Sharma, L. Vig, Tablenet: Deep learning model for end-to-end table detection and tabular data extraction from scanned document images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 128–133.": "Tablenet: Deep learning model for end-to-end table detection and tabular data extraction from scanned document images", "(116) S. Raja, A. Mondal, C. Jawahar, Table structure recognition using top-down and bottom-up cues, in: European Conference on Computer Vision, Springer, 2020, pp. 70–86.": "Table Structure Recognition Using Top-Down and Bottom-Up Cues", "(124) B. Xiao, M. Simsek, B. Kantarci, A. A. Alkheir, Table structure recognition with conditional attention, arXiv preprint arXiv:2203.03819 (2022).": "Table Structure Recognition with Conditional Attention", "(88) F. Shafait, R. Smith, Table detection in heterogeneous documents, in: Proceedings of the 9th IAPR International Workshop on Document Analysis Systems, 2010, pp. 65–72.": "Table Detection in Heterogeneous Documents", "(119) W. Xue, Q. Li, D. Tao, Res2tim: Reconstruct syntactic structures from table images, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 749–755.": "Res2tim: Reconstruct Syntactic Structures from Table Images", "(111) E. Koci, M. Thiele, O. Romero, W. Lehner, A genetic-based search for adaptive table recognition in spreadsheets, in: 2019 International Conference on Document Analysis and Recognition (ICDAR), IEEE, 2019, pp. 1274–1279.": "A genetic-based search for adaptive table recognition in spreadsheets", "(118) K. A. Hashmi, D. Stricker, M. Liwicki, M. N. Afzal, M. Z. Afzal, Guided table structure recognition through anchor optimization, IEEE Access 9 (2021) 113521–113534.": "Guided Table Structure Recognition Through Anchor Optimization", "(20) S. Schreiber, S. Agne, I. Wolf, A. Dengel, S. Ahmed, Deepdesrt: Deep learning for detection and structure recognition of tables in document images, in: 2017 14th IAPR international conference on document analysis and recognition (ICDAR), Vol. 1, IEEE, 2017, pp. 1162–1167.": "Deepdesrt: Deep learning for detection and structure recognition of tables in document images", "(68) A. Nassar, N. Livathinos, M. Lysak, P. Staar, Tableformer: Table structure understanding with transformers, in: Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, 2022, pp. 4614–4623.": "Tableformer: Table structure understanding with transformers", "(61) M. Li, L. Cui, S. Huang, F. Wei, M. Zhou, Z. Li, Tablebank: Table benchmark for image-based table detection and recognition, in: Proceedings of the 12th Language Resources and Evaluation Conference, 2020, pp. 1918–1925.": "Tablebank: Table benchmark for image-based table detection and recognition"}, "source_title_to_arxiv_id": {"Visual understanding of complex table structures from document images": "2111.07129", "Split, embed and merge: An accurate table structure recognizer": "2107.05214", "Cdec-net: Composite Deformable Cascade Network for Table Detection in Document Images": "2008.10831", "Table Structure Recognition Using Top-Down and Bottom-Up Cues": "2010.04565", "Guided Table Structure Recognition Through Anchor Optimization": "2104.10538"}}