{"title": "Explainable, Domain-Adaptive, and Federated Artificial Intelligence in Medicine", "abstract": "Artificial intelligence (AI) continues to transform data analysis in many\ndomains. Progress in each domain is driven by a growing body of annotated data,\nincreased computational resources, and technological innovations. In medicine,\nthe sensitivity of the data, the complexity of the tasks, the potentially high\nstakes, and a requirement of accountability give rise to a particular set of\nchallenges. In this review, we focus on three key methodological approaches\nthat address some of the particular challenges in AI-driven medical decision\nmaking. (1) Explainable AI aims to produce a human-interpretable justification\nfor each output. Such models increase confidence if the results appear\nplausible and match the clinicians expectations. However, the absence of a\nplausible explanation does not imply an inaccurate model. Especially in highly\nnon-linear, complex models that are tuned to maximize accuracy, such\ninterpretable representations only reflect a small portion of the\njustification. (2) Domain adaptation and transfer learning enable AI models to\nbe trained and applied across multiple domains. For example, a classification\ntask based on images acquired on different acquisition hardware. (3) Federated\nlearning enables learning large-scale models without exposing sensitive\npersonal health information. Unlike centralized AI learning, where the\ncentralized learning machine has access to the entire training data, the\nfederated learning process iteratively updates models across multiple sites by\nexchanging only parameter updates, not personal health data. This narrative\nreview covers the basic concepts, highlights relevant corner-stone and\nstate-of-the-art research in the field, and discusses perspectives.", "authors": ["Ahmad Chaddad", "Qizong lu", "Jiali Li", "Yousef Katib", "Reem Kateb", "Camel Tanougast", "Ahmed Bouridane", "Ahmed Abdulkadir"], "published_date": "2022_11_17", "pdf_url": "http://arxiv.org/pdf/2211.09317v1", "list_table_and_caption": [{"table": "<table><tr><td>Application</td><td>XAI / Explainability level</td><td>Prediction model</td><td>Reference</td></tr><tr><td>Preclinical relevance assessment</td><td>Model combination / G</td><td>GNN, FNN</td><td>[94]</td></tr><tr><td>Detection and prediction for Alzheimer’s disease</td><td>SHAP / L &amp; G</td><td>RF</td><td>[95]</td></tr><tr><td>Deterioration risk prediction of hepatitis</td><td>SHAP, LIME, PDP / L &amp; G</td><td>RF</td><td>[96]</td></tr><tr><td>Non-communicable diseases prediction</td><td>DeepSHAP / L &amp; G</td><td>DNN</td><td>[97]</td></tr><tr><td>Spinal posture classification</td><td>LIME / L</td><td>SVM</td><td>[98]</td></tr><tr><td>Classification of estrogen receptor status</td><td>SmoothGrad / L</td><td>DCNN</td><td>[99]</td></tr><tr><td>Differential diagnosis of COVID-19</td><td>Grad-CAM / G</td><td>CNN</td><td>[100]</td></tr><tr><td>Prediction of mortality</td><td>Shapley additive / L</td><td>RNN</td><td>[101]</td></tr><tr><td>Medical image segmentation</td><td>Combination / L &amp; G</td><td>CNN, Attention Mechanism</td><td>[102]</td></tr><tr><td>Early detection of Parkinson’s disease</td><td>LIME / L</td><td>VGG-16</td><td>[103]</td></tr><tr><td>COVID-19 diagnosis</td><td>Grad-CAM ++, LRP / L</td><td>DNN</td><td>[104]</td></tr><tr><td>Evaluation of cancer in Barrett’s esophagus</td><td>5 XAI methods / L</td><td>AlexNet, SqueezeNet, ResNet50, VGG16</td><td>[105]</td></tr><tr><td>Heart anomaly detection</td><td>SHAP and Occlusion maps / L</td><td>CNN, MLP</td><td>[106]</td></tr><tr><td>Distinguish VTE patients</td><td>DeepLIFT / L</td><td>ANN</td><td>[107]</td></tr><tr><td>Detection of ductal carcinoma in situ</td><td>LRP / L</td><td>Resnet-50 CNN</td><td>[108]</td></tr><tr><td>Lesion prediction</td><td>Activation Maps, Saliency Maps / L</td><td>U-net</td><td>[109]</td></tr><tr><td>Early detection of COVID-19</td><td>Saliency Maps / L</td><td>Fuzzy-enhanced CNN</td><td>[110]</td></tr><tr><td>EEG emotion recognition</td><td>SmoothGrad, saliency maps / L</td><td>CNN</td><td>[111]</td></tr><tr><td>Cerebral hemorrhage detection and localization</td><td>Grad-CAM / L</td><td>ResNet</td><td>[112]</td></tr><tr><td>Macular disease classification</td><td>t-SNE, model simplification / L</td><td>CNN</td><td>[113]</td></tr><tr><td>Automated diagnosis and grading of ulcerative colitis</td><td>Grad-CAM / L</td><td>CNN</td><td>[114]</td></tr><tr><td>Diagnostic for breast cancer</td><td>Causal-TabNet / G</td><td>GNN</td><td>[115]</td></tr><tr><td>Prediction of depressive symptoms</td><td>LIME / L</td><td>RNN</td><td>[116]</td></tr><tr><td>Early prediction of antimicrobial multidrug resistance</td><td>SHAP / L &amp; G</td><td>LSTM</td><td>[117]</td></tr><tr><td>Predictions of clinical time series</td><td>CAM / Local</td><td>FCN</td><td>[118]</td></tr></table><p>L: Local; G:Global; ANN: Artificial Neural Network; GNN: Graph Neural Networks; FNN: Fuzzy Neural Network; DNN: Deep Neural Networks; RNN: Recurrent Neural Network; FCN: Fully Convolutional Network; DCNN: Deep Convolutional Neural Network; VGG-16: GG-Very-Deep-16 CNN; VGG-19: GG-Very-Deep-19 CNN; Fuzzy-enhanced CNN: Fuzzy-enhanced Convolutional Neural Network; RF: Random forest; SVM: Support Vector Machine; MLP: Muti-Layer Perceptron; LSTM: Long Short-Term Memory network; PDP: Partial Dependence Plot; t-SNE: t-distributed Stochastic Neighbor Embedding. Seven Network: SqueezeNet, Inception, ResNet, ResNeXt, Xception, ShuffleNet, DenseNet; Five XAI methods: Saliency, guided backpropagation, integrated gradients, input gradients, and DeepLIFT;</p>", "caption": "TABLE I: Summary of the XAI models used for clinical applications.", "list_citation_info": ["[101] Hans-Christian Thorsen-Meyer, Annelaura B Nielsen, Anna P Nielsen, Benjamin Skov Kaas-Hansen, Palle Toft, Jens Schierbeck, Thomas Strøm, Piotr J Chmura, Marc Heimann, Lars Dybdahl, et al. Dynamic and explainable machine learning prediction of mortality in patients in the intensive care unit: a retrospective study of high-frequency data in electronic patient records. The Lancet Digital Health, 2(4):e179–e191, 2020.", "[104] Md Rezaul Karim, Till Döhmen, Michael Cochez, Oya Beyan, Dietrich Rebholz-Schuhmann, and Stefan Decker. Deepcovidexplainer: explainable covid-19 diagnosis from chest x-ray images. In 2020 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pages 1034–1037. IEEE, 2020.", "[102] Ran Gu, Guotai Wang, Tao Song, Rui Huang, Michael Aertsen, Jan Deprest, Sébastien Ourselin, Tom Vercauteren, and Shaoting Zhang. Ca-net: Comprehensive attention convolutional neural networks for explainable medical image segmentation. IEEE transactions on medical imaging, 40(2):699–711, 2020.", "[98] Carlo Dindorf, Jurgen Konradi, Claudia Wolf, Bertram Taetz, Gabriele Bleser, Janine Huthwelker, Friederike Werthmann, Eva Bartaguiz, Johanna Kniepert, Philipp Drees, et al. Classification and automated interpretation of spinal posture data using a pathology-independent classifier and explainable artificial intelligence (xai). Sensors, 21(18):6323, 2021.", "[105] Luis A de Souza Jr, Robert Mendel, Sophia Strasser, Alanna Ebigbo, Andreas Probst, Helmut Messmann, João P Papa, and Christoph Palm. Convolutional neural networks for the evaluation of cancer in barrett’s esophagus: Explainable ai to lighten up the black-box. Computers in Biology and Medicine, 135:104578, 2021.", "[117] Sergio Martínez-Agüero, Cristina Soguero-Ruiz, Jose M Alonso-Moral, Inmaculada Mora-Jiménez, Joaquín Álvarez-Rodríguez, and Antonio G Marques. Interpretable clinical time-series modeling with intelligent feature selection for early prediction of antimicrobial multidrug resistance. Future Generation Computer Systems, 2022.", "[118] Kristoffer Wickstrøm, Karl Øyvind Mikalsen, Michael Kampffmeyer, Arthur Revhaug, and Robert Jenssen. Uncertainty-aware deep ensembles for reliable and explainable predictions of clinical time series. IEEE Journal of Biomedical and Health Informatics, 25(7):2435–2444, 2020.", "[110] Cosimo Ieracitano, Nadia Mammone, Mario Versaci, Giuseppe Varone, Abder-Rahman Ali, Antonio Armentano, Grazia Calabrese, Anna Ferrarelli, Lorena Turano, Carmela Tebala, et al. A fuzzy-enhanced deep learning approach for early detection of covid-19 pneumonia from portable chest x-ray images. Neurocomputing, 2022.", "[106] Theekshana Dissanayake, Tharindu Fernando, Simon Denman, Sridha Sridharan, Houman Ghaemmaghami, and Clinton Fookes. A robust interpretable deep learning classifier for heart anomaly detection without segmentation. IEEE Journal of Biomedical and Health Informatics, 25(6):2162–2171, 2020.", "[97] Khishigsuren Davagdorj, Jang-Whan Bae, Van-Huy Pham, Nipon Theera-Umpon, and Keun Ho Ryu. Explainable artificial intelligence based framework for non-communicable diseases prediction. IEEE Access, 9:123672–123688, 2021.", "[103] Pavan Rajkumar Magesh, Richard Delwin Myloth, and Rijo Jackson Tom. An explainable machine learning model for early detection of parkinson’s disease using lime on datscan imagery. Computers in Biology and Medicine, 126:104041, 2020.", "[113] Raisul Arefin, Manar D Samad, Furkan A Akyelken, and Arash Davanian. Non-transfer deep learning of optical coherence tomography for post-hoc explanation of macular disease classification. In 2021 IEEE 9th International Conference on Healthcare Informatics (ICHI), pages 48–52. IEEE, 2021.", "[100] Rajeev Kumar Singh, Rohan Pandey, and Rishie Nandhan Babu. Covidscreen: explainable deep learning framework for differential diagnosis of covid-19 using chest x-rays. Neural Computing and Applications, 33(14):8871–8892, 2021.", "[96] Junfeng Peng, Kaiqiang Zou, Mi Zhou, Yi Teng, Xiongyong Zhu, Feifei Zhang, and Jun Xu. An explainable artificial intelligence framework for the deterioration risk prediction of hepatitis patients. Journal of Medical Systems, 45(5):1–9, 2021.", "[111] Juan Manuel Mayor-Torres, Sara Medina-DeVilliers, Tessa Clarkson, Matthew D Lerner, and Giuseppe Riccardi. Evaluation of interpretability for deep learning algorithms in eeg emotion recognition: A case study in autism. arXiv preprint arXiv:2111.13208, 2021.", "[94] José Jiménez-Luna, Miha Skalic, Nils Weskamp, and Gisbert Schneider. Coloring molecules with explainable artificial intelligence for preclinical relevance assessment. Journal of Chemical Information and Modeling, 61(3):1083–1094, 2021.", "[99] Zachary Papanastasopoulos, Ravi K Samala, Heang-Ping Chan, Lubomir Hadjiiski, Chintana Paramagul, Mark A Helvie, and Colleen H Neal. Explainable ai for medical imaging: deep-learning cnn ensemble for classification of estrogen receptor status from breast mri. In Medical imaging 2020: Computer-aided diagnosis, volume 11314, page 113140Z. International Society for Optics and Photonics, 2020.", "[108] Michele La Ferla, Matthew Montebello, and Dylan Seychell. An xai approach to deep learning models in the detection of ductal carcinoma in situ. arXiv preprint arXiv:2106.14186, 2021.", "[109] Christina Gillmann, Lucas Peter, Carlo Schmidt, Dorothee Saur, and Gerik Scheuermann. Visualizing multimodal deep learning for lesion prediction. IEEE Computer Graphics and Applications, 41(5):90–98, 2021.", "[107] Misbah Razzaq, Louisa Goumidi, Maria-Jesus Iglesias, Gaëlle Munsch, Maria Bruzelius, Manal Ibrahim-Kosta, Lynn Butler, Jacob Odeberg, Pierre-Emmanuel Morange, and David Alexandre Tregouet. Explainable artificial neural network for recurrent venous thromboembolism based on plasma proteomics. In International Conference on Computational Methods in Systems Biology, pages 108–121. Springer, 2021.", "[114] Reed T Sutton, Osmar R Zaiane, Randolph Goebel, and Daniel C Baumgart. Artificial intelligence enabled automated diagnosis and grading of ulcerative colitis endoscopy images. Scientific Reports, 12(1):1–10, 2022.", "[112] Kwang Hyeon Kim, Hae-Won Koo, Byung-Jou Lee, Sang-Won Yoon, and Moon-Jun Sohn. Cerebral hemorrhage detection and localization with medical imaging for cerebrovascular disease diagnosis and treatment using explainable deep learning. Journal of the Korean Physical Society, 79(3):321–327, 2021.", "[116] Md Zia Uddin, Kim Kristoffer Dysthe, Asbjørn Følstad, and Petter Bae Brandtzaeg. Deep learning for prediction of depressive symptoms in a large textual dataset. Neural Computing and Applications, pages 1–24, 2021.", "[95] Shaker El-Sappagh, Jose M Alonso, SM Islam, Ahmad M Sultan, and Kyung Sup Kwak. A multilayer multimodal detection and prediction model based on explainable artificial intelligence for alzheimer’s disease. Scientific reports, 11(1):1–26, 2021.", "[115] Dehua Chen, Hongjin Zhao, Jianrong He, Qiao Pan, and Weiliang Zhao. An causal xai diagnostic model for breast cancer based on mammography reports. In 2021 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pages 3341–3349. IEEE, 2021."]}, {"table": "<table><tr><td>Application</td><td>Method</td><td>Cross-domain</td><td>Topics</td><td>Reference</td></tr><tr><td>Gastric epithelial tumor</td><td>GAN</td><td>N</td><td>Y</td><td>[130]</td></tr><tr><td>Multiple sclerosis lesions</td><td>CNN</td><td>N</td><td>N</td><td>[127]</td></tr><tr><td>Arrhythmia heartbeat</td><td>CNN</td><td>N</td><td>N</td><td>[131]</td></tr><tr><td>Bio-metric identification</td><td>CycleGAN</td><td>Y</td><td>S and N</td><td>[132]</td></tr><tr><td>Medical image</td><td>DDA-Net</td><td>Y</td><td>N</td><td>[133]</td></tr><tr><td>Cardiac</td><td>PnP-AdaNet</td><td>Y</td><td>N</td><td>[134]</td></tr><tr><td>Brain dementia identification</td><td>SVM</td><td>Y</td><td>Y</td><td>[135]</td></tr><tr><td>Brain dementia identification</td><td>AD2A</td><td>N</td><td>N</td><td>[136]</td></tr><tr><td>Autism spectrum disorder</td><td>MSDA/MVSR</td><td>N</td><td>Y</td><td>[137]</td></tr><tr><td>Cardiac</td><td>CycleGAN</td><td>Y</td><td>N</td><td>[138]</td></tr><tr><td>Lung</td><td>ADDA</td><td>N</td><td>N</td><td>[139]</td></tr><tr><td>Histopathological</td><td>HisNet-SSDA</td><td>Y</td><td>S</td><td>[140]</td></tr><tr><td>Breast cancer</td><td>DADA</td><td>N</td><td>Y</td><td>[141]</td></tr><tr><td>Pancreatic cancer</td><td>GCN</td><td>N</td><td>N</td><td>[142]</td></tr><tr><td>Atrial fibrillation</td><td>3DU-Net</td><td>N</td><td>Y</td><td>[143]</td></tr></table><p>Y: Yes; N: No; S: Semi-supervised; GAN: Generative Adversarial Network; CNN: Convolutional Neural Network; CycleGAN: Cycle-Consistent Generative Adversarial Networks; DDA-Net: Dual Domain Adaptation Network; DASC-Net: Domain Adaptation based Self-Correction model; PnP-AdaNet: Plug-and-Play Adversarial Domain Adaptation; SVM:Support Vector Machine; AD2A: Attention-guided Deep Domain Adaptation; MSDA: Multi-Source Domain Adaptation; MVSR: Multi-View Sparse Representation; ADDA: Adversarial Discriminative Domain Adaptation; HisNet-SSDA: a deep transferred semi-supervised domain adaptation; DADA: Depth-Aware Domain Adaptation; GCN: Graph Convolutional Networks;3D U-Net: three dimension U-net.</p>", "caption": "TABLE II: Summary of recent domain adaptation models used for clinical topics.", "list_citation_info": ["[139] Rui Xu, Zhen Cong, Xinchen Ye, Shoji Kido, and Noriyuki Tomiyama. Unsupervised content-preserved adaptation network for classification of pulmonary textures from different ct scanners. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1060–1064, 2020.", "[135] Hao Guan, Li Wang, and Mingxia Liu. Multi-source domain adaptation via optimal transport for brain dementia identification. In 2021 IEEE 18th International Symposium on Biomedical Imaging (ISBI), pages 1514–1517, 2021.", "[131] Guijin Wang, Ming Chen, Zijian Ding, Jiawei Li, Huazhong Yang, and Ping Zhang. Inter-patient ecg arrhythmia heartbeat classification based on unsupervised domain adaptation. Neurocomputing, 454:339–349, 2021.", "[141] Yan Wang, Yangqin Feng, Lei Zhang, Zizhou Wang, Qing Lv, and Zhang Yi. Deep adversarial domain adaptation for breast cancer screening from mammograms. Medical image analysis, 73:102147, 2021.", "[134] Qi Dou, Cheng Ouyang, Cheng Chen, Hao Chen, Ben Glocker, Xiahai Zhuang, and Pheng-Ann Heng. Pnp-adanet: Plug-and-play adversarial domain adaptation network at unpaired cross-modality cardiac segmentation. IEEE Access, 7:99065–99076, 2019.", "[132] Eugene Lee, Annie Ho, Yi-Ting Wang, Cheng-Han Huang, and Chen-Yi Lee. Cross-domain adaptation for biometric identification using photoplethysmogram. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1289–1293, 2020.", "[137] Jun Wang, Lichi Zhang, Qian Wang, Lei Chen, Jun Shi, Xiaobo Chen, Zuoyong Li, and Dinggang Shen. Multi-class asd classification based on functional connectivity and functional correlation tensor via multi-source domain adaptation and multi-view sparse representation. IEEE Transactions on Medical Imaging, 39(10):3137–3147, 2020.", "[140] Pin Wang, Pufei Li, Yongming Li, Jin Xu, and Mingfeng Jiang. Classification of histopathological whole slide images based on multiple weighted semi-supervised domain adaptation. Biomedical Signal Processing and Control, 73:103400, 2022.", "[138] Hengfei Cui, Chang Yuwen, Lei Jiang, Yong Xia, and Yanning Zhang. Bidirectional cross-modality unsupervised domain adaptation using generative adversarial networks for cardiac image segmentation. Computers in Biology and Medicine, 136:104726, 2021.", "[142] Jun Li, Chaolu Feng, Xiaozhu Lin, and Xiaohua Qian. Utilizing gcn and meta-learning strategy in unsupervised domain adaptation for pancreatic cancer segmentation. IEEE Journal of Biomedical and Health Informatics, 26(1):79–89, 2022.", "[136] Hao Guan, Yunbi Liu, Erkun Yang, Pew-Thian Yap, Dinggang Shen, and Mingxia Liu. Multi-site mri harmonization via attention-guided deep domain adaptation for brain disorder identification. Medical Image Analysis, 71:102076, 2021.", "[127] Antoine Ackaouy, Nicolas Courty, Emmanuel Vallée, Olivier Commowick, Christian Barillot, and Francesca Galassi. Unsupervised domain adaptation with optimal transport in multi-site segmentation of multiple sclerosis lesions from mri data. Frontiers in computational neuroscience, 14:19, 2020.", "[143] Marta Saiz-Vivó, Adrián Colomer, Carles Fonfría, Luis Martí-Bonmatí, and Valery Naranjo. Supervised domain adaptation for automated semantic segmentation of the atrial cavity. Entropy, 23(7):898, 2021.", "[133] Xuesheng Bian, Xiongbiao Luo, Cheng Wang, Weiquan Liu, and Xiuhong Lin. Dda-net: Unsupervised cross-modality medical image segmentation via dual domain adaptation. Computer Methods and Programs in Biomedicine, 213:106531, 2022.", "[130] Chunmei He, Shunmin Wang, Hongyu Kang, Lanqing Zheng, Taifeng Tan, and Xianjun Fan. Adversarial domain adaptation network for tumor image diagnosis. International Journal of Approximate Reasoning, 135:38–52, 2021."]}, {"table": "<table><tr><td>Application</td><td>Model / Learning / optimization</td><td>n</td><td>Performance (Local / Central / FL models)</td><td>Reference</td></tr><tr><td>Predicting clinical outcomes</td><td>EXAM / HFL / ——</td><td>20</td><td>AUC: 0.79/ - / 0.92</td><td>[144]</td></tr><tr><td>Precision medicine</td><td>RETAIN / HFL / FedAvg</td><td>42</td><td>AUC: - / 0.73 / 0.62</td><td>[145]</td></tr><tr><td>Spinal cord gray matter segmentation</td><td>DNN / HFL / FedAvg / FedPRox</td><td>4</td><td>Sensitivity: - / 0.76 / 0.78</td><td>[146]</td></tr><tr><td>Prostate cancer diagnosis</td><td>3D AH-Net / HFL / ——</td><td>3</td><td>Dice: 0.812–0.872/ - / 0.89</td><td>[147]</td></tr><tr><td>Detection diabetic retinopathy</td><td>AlexNet / FTL / FedAvg / FedProx</td><td>5</td><td>Acc: 0.81-0.92/ - / 0.65-0.90</td><td>[148]</td></tr><tr><td>Prediction in COVID-19 patients</td><td>LASSO, MLP / HFL / ——</td><td>5</td><td>AUC: - / 0.719-0.822 / 0.786-0.836</td><td>[149]</td></tr><tr><td>Image reconstruction</td><td>U-net / HFL / FedAvg</td><td>4</td><td>SSIM: 0.94/ - / 0.93</td><td>[150]</td></tr><tr><td>Computational pathology</td><td>CNN / HFL /</td><td>3</td><td>AUC: - / 0.985±0.004 / 0.976±0.007</td><td>[151]</td></tr><tr><td>Predicting outcomes in patients</td><td>ResNet-34 / HFL / FedAvg</td><td>20</td><td>AUC: 0.79 / - / 0.92</td><td>[152]</td></tr><tr><td>Multimodal melanoma detection</td><td>EfficientNet / HFL / FedAvg</td><td>5</td><td>Acc: - / 0.83 / 0.83</td><td>[153]</td></tr><tr><td>Arrhythmia detection of Non-IID ECG</td><td>—— / HFL / EWC</td><td>100</td><td>F1-score: - / — / 0.80</td><td>[154]</td></tr><tr><td>Joint training</td><td>—— / HFL / FedACS</td><td>3</td><td>Acc: - / — / 0.70</td><td>[155]</td></tr><tr><td>MultiView training</td><td>CNN / VFL/ ——</td><td>2</td><td>Acc: 0.62/ - / 0.71</td><td>[156]</td></tr><tr><td>Prognostic prediction</td><td>ELM / HFL / ——</td><td>4</td><td>Acc: - / 0.89 / 0.8899</td><td>[157]</td></tr><tr><td>Designing ECG monitoring healthcare system</td><td>CNN / FTL / ——</td><td>3</td><td>Acc: - / 0.94 / 0.92</td><td>[75]</td></tr><tr><td>Multi-center imaging diagnostics</td><td>3D-CNN, ResNet-18 / HFL / ——</td><td>4</td><td>AUC: - / 0.85 / 0.86</td><td>[158]</td></tr><tr><td>COVID-19 detection</td><td>ResNet / HFL / FedMoCo</td><td>3</td><td>Acc: - / 0.96 / 91.56</td><td>[159]</td></tr></table><p>Local model: training alone in client; Central model: use all client data for training; FL model: model under FL training methods; n: number of institutions; EXAM: Electronic Medical Record (EMR) chest X-ray AI model; HFL: Horizontally Federate Learning; VFL: Vertically Federated Learning; FTL: Federated Transfer Learning; DNN: Deep Neural Networks; CNN: Convolutional Neural Network; 3D-CNN: three-Dimensional Convolutional Neural Network; AlexNet, EfficientNetB7, ResNet, ResNet-34, ResNet-18, U-net: a class in CNN; AUC: Area Under Curve; Acc: Accuracy; 3D AH-Net: 3D Anisotropic Hybrid Network; LASSO: Least Absolute Shrinkage and Selection Operator; MLP: Multilayer Perceptron; Dice: Dice coefficient range; Kaapa score: is a measure of classification accuracy; SSIM: Structural Similarity Index Measure; PSNR: Peak-Signal-to-Noise Ratio; ELM: Extreme Learning Machine; RETAIN: has two parallel RNN branches merged at a final logistic layer; EWC: elastic weight consolidation; FedAvg: Federated Averaging; FedACS: FedAvg with adaptive client sampling; FedMoCo: a robust federated contrastive learning framework; FedProx: A optimal method to tackle heterogeneity in federated networks.</p>", "caption": "TABLE III: Summary of federate learning models used for clinical topics.", "list_citation_info": ["[159] Nanqing Dong and Irina Voiculescu. Federated contrastive learning for decentralized unlabeled medical images. In International Conference on Medical Image Computing and Computer-Assisted Intervention, pages 378–387. Springer, 2021.", "[145] Sabri Boughorbel, Fethi Jarray, Neethu Venugopal, Shabir Moosa, Haithum Elhadi, and Michel Makhlouf. Federated uncertainty-aware learning for distributed hospital ehr data. arXiv preprint arXiv:1910.12191, 2019.", "[156] Yan Kang, Yang Liu, and Tianjian Chen. Fedmvt: Semi-supervised vertical federated learning with multiview training. arXiv preprint arXiv:2008.10838, 2020.", "[75] Ali Raza, Kim Phuc Tran, Ludovic Koehl, and Shujun Li. Designing ecg monitoring healthcare system with federated transfer learning and explainable ai. Knowledge-Based Systems, 236:107763, 2022.", "[144] Ittai Dayan, Holger R Roth, Aoxiao Zhong, Ahmed Harouni, Amilcare Gentili, Anas Z Abidin, Andrew Liu, Anthony Beardsworth Costa, Bradford J Wood, Chien-Sung Tsai, et al. Federated learning for predicting clinical outcomes in patients with covid-19. Nature medicine, 27(10):1735–1743, 2021.", "[147] Karthik V Sarma, Stephanie Harmon, Thomas Sanford, Holger R Roth, Ziyue Xu, Jesse Tetreault, Daguang Xu, Mona G Flores, Alex G Raman, Rushikesh Kulkarni, et al. Federated learning improves site performance in multicenter deep learning without data sharing. Journal of the American Medical Informatics Association, 28(6):1259–1264, 2021.", "[155] Yunchao Gu, Quanquan Hu, Xinliang Wang, Zhong Zhou, and Sixu Lu. Fedacs: an efficient federated learning method among multiple medical institutions with adaptive client sampling. In 2021 14th International Congress on Image and Signal Processing, BioMedical Engineering and Informatics (CISP-BMEI), pages 1–6. IEEE, 2021.", "[146] Chris Xing Tian, Haoliang Li, Yufei Wang, and Shiqi Wang. Privacy-preserving constrained domain generalization for medical image classification. arXiv preprint arXiv:2105.08511, 2021.", "[154] Mufeng Zhang, Yining Wang, and Tao Luo. Federated learning for arrhythmia detection of non-iid ecg. In 2020 IEEE 6th International Conference on Computer and Communications (ICCC), pages 1176–1180. IEEE, 2020.", "[148] Mohammad Nasajpour, Mahmut Karakaya, Seyedamin Pouriyeh, and Reza M Parizi. Federated transfer learning for diabetic retinopathy detection using cnn architectures. In SoutheastCon 2022, pages 655–660. IEEE, 2022.", "[150] Pengfei Guo, Puyang Wang, Jinyuan Zhou, Shanshan Jiang, and Vishal M Patel. Multi-institutional collaborations for improving deep learning-based magnetic resonance image reconstruction using federated learning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 2423–2432, 2021.", "[149] Akhil Vaid, Suraj K Jaladanki, Jie Xu, Shelly Teng, Arvind Kumar, Samuel Lee, Sulaiman Somani, Ishan Paranjpe, Jessica K De Freitas, Tingyi Wanyan, et al. Federated learning of electronic health records to improve mortality prediction in hospitalized patients with covid-19: Machine learning approach. JMIR medical informatics, 9(1):e24207, 2021.", "[158] Akis Linardos, Kaisar Kushibar, Sean Walsh, Polyxeni Gkontra, and Karim Lekadir. Federated learning for multi-center imaging diagnostics: a simulation study in cardiovascular disease. Scientific Reports, 12(1):1–12, 2022.", "[157] Weihao Sun, Yiqiang Chen, Xiaodong Yang, Jiangbei Cao, and Yuxiang Song. Fedio: Bridge inner-and outer-hospital information for perioperative complications prognostic prediction via federated learning. In 2021 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pages 3215–3221. IEEE, 2021.", "[152] Mona Flores, Ittai Dayan, Holger Roth, Aoxiao Zhong, Ahmed Harouni, Amilcare Gentili, Anas Abidin, Andrew Liu, Anthony Costa, Bradford Wood, et al. Federated learning used for predicting outcomes in sars-cov-2 patients. Research Square, 2021.", "[153] Bless Lord Y Agbley, Jianping Li, Amin Ul Haq, Edem Kwedzo Bankas, Sultan Ahmad, Isaac Osei Agyemang, Delanyo Kulevome, Waldiodio David Ndiaye, Bernard Cobbinah, and Shoistamo Latipova. Multimodal melanoma detection with federated learning. In 2021 18th International Computer Conference on Wavelet Active Media Technology and Information Processing (ICCWAMTIP), pages 238–244. IEEE, 2021.", "[151] Ming Y Lu, Richard J Chen, Dehan Kong, Jana Lipkova, Rajendra Singh, Drew FK Williamson, Tiffany Y Chen, and Faisal Mahmood. Federated learning for computational pathology on gigapixel whole slide images. Medical image analysis, 76:102298, 2022."]}, {"table": "<table><tbody><tr><td>Technique</td><td>Strengths</td><td>Weaknesses</td><td>Code</td><td>Data</td><td>Reference</td></tr><tr><td colspan=\"2\">Explainable Artificial Intelligence</td><td></td><td></td><td></td><td></td></tr><tr><th> Gradient-weightedClass Activation Mapping </th><td><ul><li>-<p>Simple to use</p></li><li>-<p>No need to change the network structure</p></li><li>-<p>Efficient to compute</p></li><li>-<p>High degree of image explanation</p></li></ul></td><td><ul><li>-<p>The weight of saliency map depends on themodel and data set</p></li><li>-<p>Sometimes prominent areas cannot be correctly labeled</p></li><li>-<p>Poor robustness</p></li></ul></td><td>C1</td><td>D1,D2</td><td>[184, 114, 173, 72, 174]</td></tr><tr><th> Local ExplainableModel-agnostic Explanation </th><td><ul><li>-<p>Uses a simple model for local explanation</p></li></ul></td><td><ul><li>-<p>Poor robustness</p></li><li>-<p>Inefficient calculation</p></li></ul></td><td>C2</td><td>D3</td><td>[185, 98, 103, 116]</td></tr><tr><th> Graph LIME </th><td><ul><li>-<p>Simple to use</p></li><li>-<p>Trustworthy</p></li></ul></td><td><ul><li>-<p>Inefficient calculation</p></li><li>-<p>instable</p></li></ul></td><td>*C3</td><td>D4</td><td>[186, 96]</td></tr><tr><th> Shapley AdditiveExplanations </th><td><ul><li>-<p>Useful for interpretation</p></li><li>-<p>Repeatability</p></li></ul></td><td><ul><li>-<p>Inefficient computation</p></li></ul></td><td>C4</td><td>D5,D6</td><td>[187, 101]</td></tr><tr><td colspan=\"2\">Domain Adaptation</td><td></td><td></td><td></td><td></td></tr><tr><th> Deep Domain Confusion </th><td><ul><li>-<p>Reduce the distribution difference between the source and target domains</p></li></ul></td><td><ul><li>-<p>Only adapts to one layer of network</p></li><li>-<p>A single fixed kernel may not be the optimal kernel</p></li></ul></td><td>C5</td><td>D7</td><td>[188, 176]</td></tr><tr><th> Deep Adaptation Networks </th><td><ul><li>-<p>Reduce domain differences</p></li></ul></td><td><ul><li>-<p>Domain difference problem cannot be solved by semi-supervised learning</p></li></ul></td><td>C5</td><td>D7</td><td>[189, 190]</td></tr><tr><th> Deep SubdomainAdaptation Network </th><td><ul><li>-<p>The weight could be defined flexible</p></li></ul></td><td><ul><li>-<p>The weight value of network maybe could not be the best</p></li></ul></td><td>C5</td><td>D8</td><td>[191, 192]</td></tr><tr><th> Dynamic AdversarialAdaptation Networks </th><td><ul><li>-<p>Solve the dynamic distribution adaptation problem in adversarial networks</p></li></ul></td><td><ul><li>-<p>Can not handle regression problems</p></li></ul></td><td>C5</td><td>D7</td><td>[193, 194]</td></tr><tr><td colspan=\"2\">Federated Learning</td><td></td><td></td><td></td><td></td></tr><tr><th> EXAM / HFL </th><td><ul><li>-<p>Can use large, and heterogeneous data-sets</p></li><li>-<p>Robust and generalizable</p></li></ul></td><td><ul><li>-<p>Bias may occur due to limitations in data quality.</p></li></ul></td><td>C6</td><td>D9</td><td>[144]</td></tr><tr><th> AlexNet / FTL /FedAvg &amp; FedProx </th><td><ul><li>-<p>Prediction rate is high</p></li></ul></td><td><ul><li>-<p>Sub-optimal security</p></li><li>-<p>Data accuracy pitfalls</p></li></ul></td><td>-</td><td>D10-D12</td><td>[148]</td></tr><tr><th> CNN / HFL / FedDis </th><td><ul><li>-<p>Mitigate the statistical heterogeneity</p></li><li>-<p>Good generalizability with clinical applications</p></li><li>-<p>Flexibility</p></li></ul></td><td><ul><li>-<p>Privacy concerns</p></li></ul></td><td>C7</td><td>D13-D17</td><td>[182]</td></tr><tr><th> 3D-CNN / HFL / FedAvg </th><td><ul><li>-<p>High performance metrics</p></li><li>-<p>Provided visual explanations</p></li><li>-<p>Suitable for transfer learning</p></li></ul></td><td><ul><li>-<p>Weak federated training process for the unstable internet connection.</p></li><li>-<p>Inefficient computation</p></li></ul></td><td>C8</td><td>D18</td><td>[183]</td></tr></tbody></table><p>FedDis: Federated Disentred representation learning for unsupervisived brain operatory segmentation; EXAM: Electronic Medical Record (EMR) chest X-ray AI model, ”-” not available, “*” not official, C: code, D: data.</p><p>C1 https://github.com/zhoubolei/CAM,https://github.com/Cloud-CV/Grad-CAM<br/>C2 https://github.com/marcotcr/lime<br/>C3 https://github.com/WilliamCCHuang/GraphLIME<br/>C4 https://github.com/slundberg/shap<br/>C5 https://github.com/jindongwang/transferlearning/tree/master/code/DeepDA/ ,https://github.com/ting2696/Deep-Symmetric-Adaptation-Network.<br/>C6 https://ngc.nvidia.com/catalog/models/nvidia:med:clara_train_covid19_exam_ehr_xray<br/>C7 https://github.com/albarqounilab/<br/>C8 https://github.com/HUST-EIC-AI-LAB/UCADI<br/>D1 http://host.robots.ox.ac.uk/pascal/VOC/voc2007<br/>D2 ImageNet Object Localization Challenge [172]<br/>D3 https://github.com/marcotcr/lime-experiments<br/>D4 Datasets are from Cora and Pubmed.<br/>D5 [195]<br/>D6 http://yann.lecun.com/exdb/mnist<br/>D7 [196, 197, 198, 199, 200], ultrasoundcases.info<br/>D8 https://github.com/jindongwang/transferlearning/blob/master/data/dataset.md, [193]<br/>D9 https://www.kaggle.com/datasets/mariaherrerot/eyepacspreprocess<br/>D10 https://www.adcis.net/en/third-party/messidor<br/>D11 https://ieee-dataport.org/open-access/indian-diabetic-retinopathy-image-dataset-idrid<br/>D12 https://www.kaggle.com/datasets/mariaherrerot/aptos2019<br/>D13 https://www.oasis-brains.org<br/>D14 http://adni.loni.usc.edu/data-553samples/access-data/<br/>D15 http://lit.fe.uni-lj.si/tools.php?lang=eng<br/>D16 https://smart-stats-tools.org/lesion-challenge-5562015<br/>D17 https://www.med.upenn.edu/sbia/brats2018/data.html<br/>D18 https://www.nhsx.nhs.uk/covid-19-response/data-and-covid-19/national-covid-19-chest-imaging-database-nccid/<br/></p>", "caption": "TABLE IV: The strengthts and weaknesses of common XAI, DA, and FL techniques.", "list_citation_info": ["[189] Mingsheng Long, Yue Cao, Jianmin Wang, and Michael Jordan. Learning transferable features with deep adaptation networks. In International conference on machine learning, pages 97–105. PMLR, 2015.", "[183] Xiang Bai, Hanchen Wang, Liya Ma, Yongchao Xu, Jiefeng Gan, Ziwei Fan, Fan Yang, Ke Ma, Jiehua Yang, Song Bai, et al. Advancing covid-19 diagnosis with privacy-preserving collaboration in artificial intelligence. Nature Machine Intelligence, 3(12):1081–1089, 2021.", "[144] Ittai Dayan, Holger R Roth, Aoxiao Zhong, Ahmed Harouni, Amilcare Gentili, Anas Z Abidin, Andrew Liu, Anthony Beardsworth Costa, Bradford J Wood, Chien-Sung Tsai, et al. Federated learning for predicting clinical outcomes in patients with covid-19. Nature medicine, 27(10):1735–1743, 2021.", "[193] Jindong Wang, Yiqiang Chen, Wenjie Feng, Han Yu, Meiyu Huang, and Qiang Yang. Transfer learning with dynamic distribution adaptation. ACM Transactions on Intelligent Systems and Technology (TIST), 11(1):1–25, 2020.", "[185] Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. ” why should i trust you?” explaining the predictions of any classifier. In Proceedings of the 22nd ACM SIGKDD international conference on knowledge discovery and data mining, pages 1135–1144, 2016.", "[148] Mohammad Nasajpour, Mahmut Karakaya, Seyedamin Pouriyeh, and Reza M Parizi. Federated transfer learning for diabetic retinopathy detection using cnn architectures. In SoutheastCon 2022, pages 655–660. IEEE, 2022.", "[196] Kate Saenko, Brian Kulis, Mario Fritz, and Trevor Darrell. Adapting visual category models to new domains. In European conference on computer vision, pages 213–226. Springer, 2010.", "[172] Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. Imagenet: A large-scale hierarchical image database. In 2009 IEEE Conference on Computer Vision and Pattern Recognition, pages 248–255, 2009.", "[182] Cosmin I Bercea, Benedikt Wiestler, Daniel Rueckert, and Shadi Albarqouni. Federated disentangled representation learning for unsupervised brain anomaly detection. Nature Machine Intelligence, 4(8):685–695, 2022.", "[186] Qiang Huang, Makoto Yamada, Yuan Tian, Dinesh Singh, and Yi Chang. Graphlime: Local interpretable model explanations for graph neural networks. IEEE Transactions on Knowledge and Data Engineering, 2022.", "[191] Yongchun Zhu, Fuzhen Zhuang, Jindong Wang, Guolin Ke, Jingwu Chen, Jiang Bian, Hui Xiong, and Qing He. Deep subdomain adaptation network for image classification. IEEE transactions on neural networks and learning systems, 32(4):1713–1722, 2020.", "[195] Han Xiao, Kashif Rasul, and Roland Vollgraf. Fashion-mnist: a novel image dataset for benchmarking machine learning algorithms. arXiv preprint arXiv:1708.07747, 2017.", "[187] Scott M Lundberg and Su-In Lee. A unified approach to interpreting model predictions. Advances in neural information processing systems, 30, 2017.", "[184] Ramprasaath R Selvaraju, Michael Cogswell, Abhishek Das, Ramakrishna Vedantam, Devi Parikh, and Dhruv Batra. Grad-cam: Visual explanations from deep networks via gradient-based localization. In Proceedings of the IEEE international conference on computer vision, pages 618–626, 2017.", "[188] Eric Tzeng, Judy Hoffman, Ning Zhang, Kate Saenko, and Trevor Darrell. Deep domain confusion: Maximizing for domain invariance. arXiv preprint arXiv:1412.3474, 2014."]}], "citation_info_to_title": {"[191] Yongchun Zhu, Fuzhen Zhuang, Jindong Wang, Guolin Ke, Jingwu Chen, Jiang Bian, Hui Xiong, and Qing He. Deep subdomain adaptation network for image classification. IEEE transactions on neural networks and learning systems, 32(4):1713–1722, 2020.": "Deep subdomain adaptation network for image classification", "[109] Christina Gillmann, Lucas Peter, Carlo Schmidt, Dorothee Saur, and Gerik Scheuermann. Visualizing multimodal deep learning for lesion prediction. IEEE Computer Graphics and Applications, 41(5):90–98, 2021.": "Visualizing Multimodal Deep Learning for Lesion Prediction", "[105] Luis A de Souza Jr, Robert Mendel, Sophia Strasser, Alanna Ebigbo, Andreas Probst, Helmut Messmann, João P Papa, and Christoph Palm. Convolutional neural networks for the evaluation of cancer in barrett’s esophagus: Explainable ai to lighten up the black-box. Computers in Biology and Medicine, 135:104578, 2021.": "Convolutional Neural Networks for the Evaluation of Cancer in Barretts Esophagus: Explainable AI to Lighten up the Black-Box", "[135] Hao Guan, Li Wang, and Mingxia Liu. Multi-source domain adaptation via optimal transport for brain dementia identification. In 2021 IEEE 18th International Symposium on Biomedical Imaging (ISBI), pages 1514–1517, 2021.": "Multi-source domain adaptation via optimal transport for brain dementia identification", "[130] Chunmei He, Shunmin Wang, Hongyu Kang, Lanqing Zheng, Taifeng Tan, and Xianjun Fan. Adversarial domain adaptation network for tumor image diagnosis. International Journal of Approximate Reasoning, 135:38–52, 2021.": "Adversarial domain adaptation network for tumor image diagnosis", "[150] Pengfei Guo, Puyang Wang, Jinyuan Zhou, Shanshan Jiang, and Vishal M Patel. Multi-institutional collaborations for improving deep learning-based magnetic resonance image reconstruction using federated learning. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 2423–2432, 2021.": "Multi-institutional collaborations for improving deep learning-based magnetic resonance image reconstruction using federated learning", "[139] Rui Xu, Zhen Cong, Xinchen Ye, Shoji Kido, and Noriyuki Tomiyama. Unsupervised content-preserved adaptation network for classification of pulmonary textures from different ct scanners. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1060–1064, 2020.": "Unsupervised content-preserved adaptation network for classification of pulmonary textures from different ct scanners", "[157] Weihao Sun, Yiqiang Chen, Xiaodong Yang, Jiangbei Cao, and Yuxiang Song. Fedio: Bridge inner-and outer-hospital information for perioperative complications prognostic prediction via federated learning. In 2021 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pages 3215–3221. IEEE, 2021.": "Fedio: Bridge inner-and outer-hospital information for perioperative complications prognostic prediction via federated learning", "[115] Dehua Chen, Hongjin Zhao, Jianrong He, Qiao Pan, and Weiliang Zhao. An causal xai diagnostic model for breast cancer based on mammography reports. In 2021 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pages 3341–3349. IEEE, 2021.": "An causal xai diagnostic model for breast cancer based on mammography reports", "[96] Junfeng Peng, Kaiqiang Zou, Mi Zhou, Yi Teng, Xiongyong Zhu, Feifei Zhang, and Jun Xu. An explainable artificial intelligence framework for the deterioration risk prediction of hepatitis patients. Journal of Medical Systems, 45(5):1–9, 2021.": "An explainable artificial intelligence framework for the deterioration risk prediction of hepatitis patients", "[97] Khishigsuren Davagdorj, Jang-Whan Bae, Van-Huy Pham, Nipon Theera-Umpon, and Keun Ho Ryu. Explainable artificial intelligence based framework for non-communicable diseases prediction. IEEE Access, 9:123672–123688, 2021.": "Explainable Artificial Intelligence Based Framework for Non-Communicable Diseases Prediction", "[188] Eric Tzeng, Judy Hoffman, Ning Zhang, Kate Saenko, and Trevor Darrell. Deep domain confusion: Maximizing for domain invariance. arXiv preprint arXiv:1412.3474, 2014.": "Deep domain confusion: Maximizing for domain invariance", "[132] Eugene Lee, Annie Ho, Yi-Ting Wang, Cheng-Han Huang, and Chen-Yi Lee. Cross-domain adaptation for biometric identification using photoplethysmogram. In ICASSP 2020 - 2020 IEEE International Conference on Acoustics, Speech and Signal Processing (ICASSP), pages 1289–1293, 2020.": "Cross-domain adaptation for biometric identification using photoplethysmogram", "[141] Yan Wang, Yangqin Feng, Lei Zhang, Zizhou Wang, Qing Lv, and Zhang Yi. Deep adversarial domain adaptation for breast cancer screening from mammograms. Medical image analysis, 73:102147, 2021.": "Deep Adversarial Domain Adaptation for Breast Cancer Screening from Mammograms", "[159] Nanqing Dong and Irina Voiculescu. Federated contrastive learning for decentralized unlabeled medical images. In International Conference on Medical Image Computing and Computer-Assisted Intervention, pages 378–387. Springer, 2021.": "Federated contrastive learning for decentralized unlabeled medical images", "[156] Yan Kang, Yang Liu, and Tianjian Chen. Fedmvt: Semi-supervised vertical federated learning with multiview training. arXiv preprint arXiv:2008.10838, 2020.": "Fedmvt: Semi-supervised vertical federated learning with multiview training", "[111] Juan Manuel Mayor-Torres, Sara Medina-DeVilliers, Tessa Clarkson, Matthew D Lerner, and Giuseppe Riccardi. Evaluation of interpretability for deep learning algorithms in eeg emotion recognition: A case study in autism. arXiv preprint arXiv:2111.13208, 2021.": "Evaluation of Interpretability for Deep Learning Algorithms in EEG Emotion Recognition: A Case Study in Autism", "[131] Guijin Wang, Ming Chen, Zijian Ding, Jiawei Li, Huazhong Yang, and Ping Zhang. Inter-patient ecg arrhythmia heartbeat classification based on unsupervised domain adaptation. Neurocomputing, 454:339–349, 2021.": "Inter-patient ECG Arrhythmia Heartbeat Classification Based on Unsupervised Domain Adaptation", "[144] Ittai Dayan, Holger R Roth, Aoxiao Zhong, Ahmed Harouni, Amilcare Gentili, Anas Z Abidin, Andrew Liu, Anthony Beardsworth Costa, Bradford J Wood, Chien-Sung Tsai, et al. Federated learning for predicting clinical outcomes in patients with covid-19. Nature medicine, 27(10):1735–1743, 2021.": "Federated learning for predicting clinical outcomes in patients with covid-19", "[75] Ali Raza, Kim Phuc Tran, Ludovic Koehl, and Shujun Li. Designing ecg monitoring healthcare system with federated transfer learning and explainable ai. Knowledge-Based Systems, 236:107763, 2022.": "Designing ECG Monitoring Healthcare System with Federated Transfer Learning and Explainable AI", "[193] Jindong Wang, Yiqiang Chen, Wenjie Feng, Han Yu, Meiyu Huang, and Qiang Yang. Transfer learning with dynamic distribution adaptation. ACM Transactions on Intelligent Systems and Technology (TIST), 11(1):1–25, 2020.": "Transfer learning with dynamic distribution adaptation", "[107] Misbah Razzaq, Louisa Goumidi, Maria-Jesus Iglesias, Gaëlle Munsch, Maria Bruzelius, Manal Ibrahim-Kosta, Lynn Butler, Jacob Odeberg, Pierre-Emmanuel Morange, and David Alexandre Tregouet. Explainable artificial neural network for recurrent venous thromboembolism based on plasma proteomics. In International Conference on Computational Methods in Systems Biology, pages 108–121. Springer, 2021.": "Explainable artificial neural network for recurrent venous thromboembolism based on plasma proteomics", "[158] Akis Linardos, Kaisar Kushibar, Sean Walsh, Polyxeni Gkontra, and Karim Lekadir. Federated learning for multi-center imaging diagnostics: a simulation study in cardiovascular disease. Scientific Reports, 12(1):1–12, 2022.": "Federated learning for multi-center imaging diagnostics: a simulation study in cardiovascular disease", "[101] Hans-Christian Thorsen-Meyer, Annelaura B Nielsen, Anna P Nielsen, Benjamin Skov Kaas-Hansen, Palle Toft, Jens Schierbeck, Thomas Strøm, Piotr J Chmura, Marc Heimann, Lars Dybdahl, et al. Dynamic and explainable machine learning prediction of mortality in patients in the intensive care unit: a retrospective study of high-frequency data in electronic patient records. The Lancet Digital Health, 2(4):e179–e191, 2020.": "Dynamic and explainable machine learning prediction of mortality in patients in the intensive care unit: a retrospective study of high-frequency data in electronic patient records", "[110] Cosimo Ieracitano, Nadia Mammone, Mario Versaci, Giuseppe Varone, Abder-Rahman Ali, Antonio Armentano, Grazia Calabrese, Anna Ferrarelli, Lorena Turano, Carmela Tebala, et al. A fuzzy-enhanced deep learning approach for early detection of covid-19 pneumonia from portable chest x-ray images. Neurocomputing, 2022.": "A fuzzy-enhanced deep learning approach for early detection of covid-19 pneumonia from portable chest x-ray images", "[99] Zachary Papanastasopoulos, Ravi K Samala, Heang-Ping Chan, Lubomir Hadjiiski, Chintana Paramagul, Mark A Helvie, and Colleen H Neal. Explainable ai for medical imaging: deep-learning cnn ensemble for classification of estrogen receptor status from breast mri. In Medical imaging 2020: Computer-aided diagnosis, volume 11314, page 113140Z. International Society for Optics and Photonics, 2020.": "Explainable AI for Medical Imaging: Deep-Learning CNN Ensemble for Classification of Estrogen Receptor Status from Breast MRI", "[172] Jia Deng, Wei Dong, Richard Socher, Li-Jia Li, Kai Li, and Li Fei-Fei. Imagenet: A large-scale hierarchical image database. In 2009 IEEE Conference on Computer Vision and Pattern Recognition, pages 248–255, 2009.": "Imagenet: A large-scale hierarchical image database", "[155] Yunchao Gu, Quanquan Hu, Xinliang Wang, Zhong Zhou, and Sixu Lu. Fedacs: an efficient federated learning method among multiple medical institutions with adaptive client sampling. In 2021 14th International Congress on Image and Signal Processing, BioMedical Engineering and Informatics (CISP-BMEI), pages 1–6. IEEE, 2021.": "Fedacs: An Efficient Federated Learning Method Among Multiple Medical Institutions with Adaptive Client Sampling", "[117] Sergio Martínez-Agüero, Cristina Soguero-Ruiz, Jose M Alonso-Moral, Inmaculada Mora-Jiménez, Joaquín Álvarez-Rodríguez, and Antonio G Marques. Interpretable clinical time-series modeling with intelligent feature selection for early prediction of antimicrobial multidrug resistance. Future Generation Computer Systems, 2022.": "Interpretable clinical time-series modeling with intelligent feature selection for early prediction of antimicrobial multidrug resistance", "[148] Mohammad Nasajpour, Mahmut Karakaya, Seyedamin Pouriyeh, and Reza M Parizi. Federated transfer learning for diabetic retinopathy detection using cnn architectures. In SoutheastCon 2022, pages 655–660. IEEE, 2022.": "Federated Transfer Learning for Diabetic Retinopathy Detection Using CNN Architectures", "[113] Raisul Arefin, Manar D Samad, Furkan A Akyelken, and Arash Davanian. Non-transfer deep learning of optical coherence tomography for post-hoc explanation of macular disease classification. In 2021 IEEE 9th International Conference on Healthcare Informatics (ICHI), pages 48–52. IEEE, 2021.": "Non-transfer deep learning of optical coherence tomography for post-hoc explanation of macular disease classification", "[134] Qi Dou, Cheng Ouyang, Cheng Chen, Hao Chen, Ben Glocker, Xiahai Zhuang, and Pheng-Ann Heng. Pnp-adanet: Plug-and-play adversarial domain adaptation network at unpaired cross-modality cardiac segmentation. IEEE Access, 7:99065–99076, 2019.": "Pnp-adanet: Plug-and-play adversarial domain adaptation network at unpaired cross-modality cardiac segmentation", "[140] Pin Wang, Pufei Li, Yongming Li, Jin Xu, and Mingfeng Jiang. Classification of histopathological whole slide images based on multiple weighted semi-supervised domain adaptation. Biomedical Signal Processing and Control, 73:103400, 2022.": "Classification of Histopathological Whole Slide Images Based on Multiple Weighted Semi-Supervised Domain Adaptation", "[187] Scott M Lundberg and Su-In Lee. A unified approach to interpreting model predictions. Advances in neural information processing systems, 30, 2017.": "A unified approach to interpreting model predictions", "[108] Michele La Ferla, Matthew Montebello, and Dylan Seychell. An xai approach to deep learning models in the detection of ductal carcinoma in situ. arXiv preprint arXiv:2106.14186, 2021.": "An XAI Approach to Deep Learning Models in the Detection of Ductal Carcinoma in Situ", "[154] Mufeng Zhang, Yining Wang, and Tao Luo. Federated learning for arrhythmia detection of non-iid ecg. In 2020 IEEE 6th International Conference on Computer and Communications (ICCC), pages 1176–1180. IEEE, 2020.": "Federated learning for arrhythmia detection of non-iid ecg", "[142] Jun Li, Chaolu Feng, Xiaozhu Lin, and Xiaohua Qian. Utilizing gcn and meta-learning strategy in unsupervised domain adaptation for pancreatic cancer segmentation. IEEE Journal of Biomedical and Health Informatics, 26(1):79–89, 2022.": "Utilizing GCN and Meta-Learning Strategy in Unsupervised Domain Adaptation for Pancreatic Cancer Segmentation", "[153] Bless Lord Y Agbley, Jianping Li, Amin Ul Haq, Edem Kwedzo Bankas, Sultan Ahmad, Isaac Osei Agyemang, Delanyo Kulevome, Waldiodio David Ndiaye, Bernard Cobbinah, and Shoistamo Latipova. Multimodal melanoma detection with federated learning. In 2021 18th International Computer Conference on Wavelet Active Media Technology and Information Processing (ICCWAMTIP), pages 238–244. IEEE, 2021.": "Multimodal melanoma detection with federated learning", "[189] Mingsheng Long, Yue Cao, Jianmin Wang, and Michael Jordan. Learning transferable features with deep adaptation networks. In International conference on machine learning, pages 97–105. PMLR, 2015.": "Learning transferable features with deep adaptation networks", "[100] Rajeev Kumar Singh, Rohan Pandey, and Rishie Nandhan Babu. Covidscreen: explainable deep learning framework for differential diagnosis of covid-19 using chest x-rays. Neural Computing and Applications, 33(14):8871–8892, 2021.": "Covidscreen: explainable deep learning framework for differential diagnosis of covid-19 using chest x-rays", "[183] Xiang Bai, Hanchen Wang, Liya Ma, Yongchao Xu, Jiefeng Gan, Ziwei Fan, Fan Yang, Ke Ma, Jiehua Yang, Song Bai, et al. Advancing covid-19 diagnosis with privacy-preserving collaboration in artificial intelligence. Nature Machine Intelligence, 3(12):1081–1089, 2021.": "Advancing COVID-19 Diagnosis with Privacy-Preserving Collaboration in Artificial Intelligence", "[103] Pavan Rajkumar Magesh, Richard Delwin Myloth, and Rijo Jackson Tom. An explainable machine learning model for early detection of parkinson’s disease using lime on datscan imagery. Computers in Biology and Medicine, 126:104041, 2020.": "An explainable machine learning model for early detection of Parkinsons disease using LIME on DaTscan imagery", "[151] Ming Y Lu, Richard J Chen, Dehan Kong, Jana Lipkova, Rajendra Singh, Drew FK Williamson, Tiffany Y Chen, and Faisal Mahmood. Federated learning for computational pathology on gigapixel whole slide images. Medical image analysis, 76:102298, 2022.": "Federated learning for computational pathology on gigapixel whole slide images", "[116] Md Zia Uddin, Kim Kristoffer Dysthe, Asbjørn Følstad, and Petter Bae Brandtzaeg. Deep learning for prediction of depressive symptoms in a large textual dataset. Neural Computing and Applications, pages 1–24, 2021.": "Deep learning for prediction of depressive symptoms in a large textual dataset", "[136] Hao Guan, Yunbi Liu, Erkun Yang, Pew-Thian Yap, Dinggang Shen, and Mingxia Liu. Multi-site mri harmonization via attention-guided deep domain adaptation for brain disorder identification. Medical Image Analysis, 71:102076, 2021.": "Multi-site MRI Harmonization via Attention-Guided Deep Domain Adaptation for Brain Disorder Identification", "[127] Antoine Ackaouy, Nicolas Courty, Emmanuel Vallée, Olivier Commowick, Christian Barillot, and Francesca Galassi. Unsupervised domain adaptation with optimal transport in multi-site segmentation of multiple sclerosis lesions from mri data. Frontiers in computational neuroscience, 14:19, 2020.": "Unsupervised Domain Adaptation with Optimal Transport in Multi-Site Segmentation of Multiple Sclerosis Lesions from MRI Data", "[184] Ramprasaath R Selvaraju, Michael Cogswell, Abhishek Das, Ramakrishna Vedantam, Devi Parikh, and Dhruv Batra. Grad-cam: Visual explanations from deep networks via gradient-based localization. In Proceedings of the IEEE international conference on computer vision, pages 618–626, 2017.": "Grad-CAM: Visual Explanations from Deep Networks via Gradient-Based Localization", "[95] Shaker El-Sappagh, Jose M Alonso, SM Islam, Ahmad M Sultan, and Kyung Sup Kwak. A multilayer multimodal detection and prediction model based on explainable artificial intelligence for alzheimer’s disease. Scientific reports, 11(1):1–26, 2021.": "A multilayer multimodal detection and prediction model based on explainable artificial intelligence for Alzheimers disease", "[147] Karthik V Sarma, Stephanie Harmon, Thomas Sanford, Holger R Roth, Ziyue Xu, Jesse Tetreault, Daguang Xu, Mona G Flores, Alex G Raman, Rushikesh Kulkarni, et al. Federated learning improves site performance in multicenter deep learning without data sharing. Journal of the American Medical Informatics Association, 28(6):1259–1264, 2021.": "Federated learning improves site performance in multicenter deep learning without data sharing", "[152] Mona Flores, Ittai Dayan, Holger Roth, Aoxiao Zhong, Ahmed Harouni, Amilcare Gentili, Anas Abidin, Andrew Liu, Anthony Costa, Bradford Wood, et al. Federated learning used for predicting outcomes in sars-cov-2 patients. Research Square, 2021.": "Federated learning used for predicting outcomes in SARS-CoV-2 patients", "[185] Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. ” why should i trust you?” explaining the predictions of any classifier. In Proceedings of the 22nd ACM SIGKDD international conference on knowledge discovery and data mining, pages 1135–1144, 2016.": "Why Should I Trust You? Explaining the Predictions of Any Classifier", "[104] Md Rezaul Karim, Till Döhmen, Michael Cochez, Oya Beyan, Dietrich Rebholz-Schuhmann, and Stefan Decker. Deepcovidexplainer: explainable covid-19 diagnosis from chest x-ray images. In 2020 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), pages 1034–1037. IEEE, 2020.": "Deepcovidexplainer: Explainable COVID-19 Diagnosis from Chest X-ray Images", "[195] Han Xiao, Kashif Rasul, and Roland Vollgraf. Fashion-mnist: a novel image dataset for benchmarking machine learning algorithms. arXiv preprint arXiv:1708.07747, 2017.": "Fashion-mnist: a novel image dataset for benchmarking machine learning algorithms", "[149] Akhil Vaid, Suraj K Jaladanki, Jie Xu, Shelly Teng, Arvind Kumar, Samuel Lee, Sulaiman Somani, Ishan Paranjpe, Jessica K De Freitas, Tingyi Wanyan, et al. Federated learning of electronic health records to improve mortality prediction in hospitalized patients with covid-19: Machine learning approach. JMIR medical informatics, 9(1):e24207, 2021.": "Federated learning of electronic health records to improve mortality prediction in hospitalized patients with covid-19: Machine learning approach", "[94] José Jiménez-Luna, Miha Skalic, Nils Weskamp, and Gisbert Schneider. Coloring molecules with explainable artificial intelligence for preclinical relevance assessment. Journal of Chemical Information and Modeling, 61(3):1083–1094, 2021.": "Coloring Molecules with Explainable Artificial Intelligence for Preclinical Relevance Assessment", "[118] Kristoffer Wickstrøm, Karl Øyvind Mikalsen, Michael Kampffmeyer, Arthur Revhaug, and Robert Jenssen. Uncertainty-aware deep ensembles for reliable and explainable predictions of clinical time series. IEEE Journal of Biomedical and Health Informatics, 25(7):2435–2444, 2020.": "Uncertainty-aware deep ensembles for reliable and explainable predictions of clinical time series", "[137] Jun Wang, Lichi Zhang, Qian Wang, Lei Chen, Jun Shi, Xiaobo Chen, Zuoyong Li, and Dinggang Shen. Multi-class asd classification based on functional connectivity and functional correlation tensor via multi-source domain adaptation and multi-view sparse representation. IEEE Transactions on Medical Imaging, 39(10):3137–3147, 2020.": "Multi-class ASD Classification Based on Functional Connectivity and Functional Correlation Tensor via Multi-Source Domain Adaptation and Multi-View Sparse Representation", "[146] Chris Xing Tian, Haoliang Li, Yufei Wang, and Shiqi Wang. Privacy-preserving constrained domain generalization for medical image classification. arXiv preprint arXiv:2105.08511, 2021.": "Privacy-Preserving Constrained Domain Generalization for Medical Image Classification", "[138] Hengfei Cui, Chang Yuwen, Lei Jiang, Yong Xia, and Yanning Zhang. Bidirectional cross-modality unsupervised domain adaptation using generative adversarial networks for cardiac image segmentation. Computers in Biology and Medicine, 136:104726, 2021.": "Bidirectional Cross-Modality Unsupervised Domain Adaptation Using Generative Adversarial Networks for Cardiac Image Segmentation", "[196] Kate Saenko, Brian Kulis, Mario Fritz, and Trevor Darrell. Adapting visual category models to new domains. In European conference on computer vision, pages 213–226. Springer, 2010.": "Adapting visual category models to new domains", "[143] Marta Saiz-Vivó, Adrián Colomer, Carles Fonfría, Luis Martí-Bonmatí, and Valery Naranjo. Supervised domain adaptation for automated semantic segmentation of the atrial cavity. Entropy, 23(7):898, 2021.": "Supervised domain adaptation for automated semantic segmentation of the atrial cavity", "[106] Theekshana Dissanayake, Tharindu Fernando, Simon Denman, Sridha Sridharan, Houman Ghaemmaghami, and Clinton Fookes. A robust interpretable deep learning classifier for heart anomaly detection without segmentation. IEEE Journal of Biomedical and Health Informatics, 25(6):2162–2171, 2020.": "A robust interpretable deep learning classifier for heart anomaly detection without segmentation", "[98] Carlo Dindorf, Jurgen Konradi, Claudia Wolf, Bertram Taetz, Gabriele Bleser, Janine Huthwelker, Friederike Werthmann, Eva Bartaguiz, Johanna Kniepert, Philipp Drees, et al. Classification and automated interpretation of spinal posture data using a pathology-independent classifier and explainable artificial intelligence (xai). Sensors, 21(18):6323, 2021.": "Classification and automated interpretation of spinal posture data using a pathology-independent classifier and explainable artificial intelligence (XAI)", "[133] Xuesheng Bian, Xiongbiao Luo, Cheng Wang, Weiquan Liu, and Xiuhong Lin. Dda-net: Unsupervised cross-modality medical image segmentation via dual domain adaptation. Computer Methods and Programs in Biomedicine, 213:106531, 2022.": "Dda-net: Unsupervised Cross-Modality Medical Image Segmentation via Dual Domain Adaptation", "[186] Qiang Huang, Makoto Yamada, Yuan Tian, Dinesh Singh, and Yi Chang. Graphlime: Local interpretable model explanations for graph neural networks. IEEE Transactions on Knowledge and Data Engineering, 2022.": "Graphlime: Local Interpretable Model Explanations for Graph Neural Networks", "[102] Ran Gu, Guotai Wang, Tao Song, Rui Huang, Michael Aertsen, Jan Deprest, Sébastien Ourselin, Tom Vercauteren, and Shaoting Zhang. Ca-net: Comprehensive attention convolutional neural networks for explainable medical image segmentation. IEEE transactions on medical imaging, 40(2):699–711, 2020.": "Ca-net: Comprehensive attention convolutional neural networks for explainable medical image segmentation", "[114] Reed T Sutton, Osmar R Zaiane, Randolph Goebel, and Daniel C Baumgart. Artificial intelligence enabled automated diagnosis and grading of ulcerative colitis endoscopy images. Scientific Reports, 12(1):1–10, 2022.": "Artificial intelligence enabled automated diagnosis and grading of ulcerative colitis endoscopy images", "[112] Kwang Hyeon Kim, Hae-Won Koo, Byung-Jou Lee, Sang-Won Yoon, and Moon-Jun Sohn. Cerebral hemorrhage detection and localization with medical imaging for cerebrovascular disease diagnosis and treatment using explainable deep learning. Journal of the Korean Physical Society, 79(3):321–327, 2021.": "Cerebral hemorrhage detection and localization with medical imaging for cerebrovascular disease diagnosis and treatment using explainable deep learning", "[145] Sabri Boughorbel, Fethi Jarray, Neethu Venugopal, Shabir Moosa, Haithum Elhadi, and Michel Makhlouf. Federated uncertainty-aware learning for distributed hospital ehr data. arXiv preprint arXiv:1910.12191, 2019.": "Federated uncertainty-aware learning for distributed hospital ehr data", "[182] Cosmin I Bercea, Benedikt Wiestler, Daniel Rueckert, and Shadi Albarqouni. Federated disentangled representation learning for unsupervised brain anomaly detection. Nature Machine Intelligence, 4(8):685–695, 2022.": "Federated disentangled representation learning for unsupervised brain anomaly detection"}, "source_title_to_arxiv_id": {"Federated contrastive learning for decentralized unlabeled medical images": "2109.07504", "An XAI Approach to Deep Learning Models in the Detection of Ductal Carcinoma in Situ": "2106.14186"}}