{"title": "Operationalizing Specifications, In Addition to Test Sets for Evaluating Constrained Generative Models", "abstract": "In this work, we present some recommendations on the evaluation of\nstate-of-the-art generative models for constrained generation tasks. The\nprogress on generative models has been rapid in recent years. These large-scale\nmodels have had three impacts: firstly, the fluency of generation in both\nlanguage and vision modalities has rendered common average-case evaluation\nmetrics much less useful in diagnosing system errors. Secondly, the same\nsubstrate models now form the basis of a number of applications, driven both by\nthe utility of their representations as well as phenomena such as in-context\nlearning, which raise the abstraction level of interacting with such models.\nThirdly, the user expectations around these models and their feted public\nreleases have made the technical challenge of out of domain generalization much\nless excusable in practice. Subsequently, our evaluation methodologies haven't\nadapted to these changes. More concretely, while the associated utility and\nmethods of interacting with generative models have expanded, a similar\nexpansion has not been observed in their evaluation practices. In this paper,\nwe argue that the scale of generative models could be exploited to raise the\nabstraction level at which evaluation itself is conducted and provide\nrecommendations for the same. Our recommendations are based on leveraging\nspecifications as a powerful instrument to evaluate generation quality and are\nreadily applicable to a variety of tasks.", "authors": ["Vikas Raunak", "Matt Post", "Arul Menezes"], "published_date": "2022_11_19", "pdf_url": "http://arxiv.org/pdf/2212.00006v1", "list_table_and_caption": [{"table": "<table><thead><tr><th>Property</th><th>Source-Translation Instance</th></tr></thead><tbody><tr><th>Physical Unit</th><td><p>Teacher’s hallway song and dance reminds students to stay 6 feet apart.</p></td></tr><tr><th></th><td><p>Lehrer Flur Lied und Tanz erinnert die Schüler zu bleiben 6 Meter auseinander.</p></td></tr><tr><th>Currency</th><td><p>Floorpops Medina Self Adhesive Floor Tiles, £14 from Dunelm - buy now</p></td></tr><tr><th></th><td><p>Floorpops Medina selbstklebende Bodenfliesen, 15 € von Dunelm günstig kaufen</p></td></tr></tbody></table>", "caption": "Table 1: Specification based evaluation for Google Machine Translation (Raunak et al., 2022)", "list_citation_info": ["Raunak et al. [2022] Vikas Raunak, Matt Post, and Arul Menezes. Salted: A framework for salient long-tail translation error detection. In Findings of the Association for Computational Linguistics: EMNLP 2022, Online, December 2022. Association for Computational Linguistics. URL https://arxiv.org/abs/2205.09988."]}], "citation_info_to_title": {"Raunak et al. [2022] Vikas Raunak, Matt Post, and Arul Menezes. Salted: A framework for salient long-tail translation error detection. In Findings of the Association for Computational Linguistics: EMNLP 2022, Online, December 2022. Association for Computational Linguistics. URL https://arxiv.org/abs/2205.09988.": "Salted: A framework for salient long-tail translation error detection"}, "source_title_to_arxiv_id": {"Salted: A framework for salient long-tail translation error detection": "2205.09988"}}